{"Name": ["BLACKROCK INC.", "VANGUARD GROUP INC", "OAKTREE CAPITAL MANAGEMENT LP", "PRIMECAP MANAGEMENT CO/CA/", "GOLDMAN SACHS GROUP INC"], "Description": ["BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "Oaktree Capital Management is an American global asset management firm specializing in alternative investment strategies. It is the largest distressed securities investor in the world, and one of the largest credit investors in the world. Oaktree emphasizes an opportunistic, value-oriented, and risk-controlled approach to investments in distressed debt, corporate debt (including high yield debt and senior loans), control investing (including private equity and special situations), convertible securities, real estate and listed equities.\nAs of December 31, 2019, the company managed $124.7 billion for its clientele which includes 73 of the 100 largest U.S. pension plans, as well as public funds, foundations, corporate and insurance companies, endowments, and sovereign wealth funds. The company's co-chairman, Howard Marks, has been described as “one of the savviest investors in the world,” and is known in the investment community for letters to investors called the \"Oaktree memos”.The firm was co-founded in 1995 by a group who had formerly worked together at the TCW Group starting in the 1980s. Oaktree quickly established a reputation in the high-yield and distressed-debt markets. On April 12, 2012, Oaktree Capital Group LLC became listed on the NYSE: OAK.On March 13, 2019, Brookfield Asset Management announced  that it had agreed to buy 62% of Oaktree Capital Management for about $4.7 billion, creating one of the world’s largest alternative money managers.", "Adobe Inc. ( ə-DOH-bee), known until October 3, 2018 as Adobe Systems Incorporated, is an American multinational computer software company headquartered in San Jose, California, and incorporated in Delaware. It has historically focused upon the creation of multimedia and creativity software products, with a more recent foray towards digital marketing software. Adobe is best known for its Adobe Flash web software ecosystem, Photoshop image editing software, Adobe Illustrator vector graphics editor, Acrobat Reader, the Portable Document Format (PDF), and Adobe Creative Suite, as well as its successor Adobe Creative Cloud.Adobe was founded in December 1982 by John Warnock and Charles Geschke, who established the company after leaving Xerox PARC in order to develop and sell the PostScript page description language. In 1985, Apple Computer licensed PostScript for use in its LaserWriter printers, which helped spark the desktop publishing revolution.As of 2019, Adobe has more than 21,000 employees worldwide, about 40% of whom work in San Jose. Adobe also has major development operations in the United States in Newton, New York City, Minneapolis, Lehi, Seattle, and San Francisco. It also has major development operations in Noida and Bangalore in India.", "The Goldman Sachs Group, Inc., () is an American multinational investment bank and financial services company headquartered in New York City. It offers services in investment management, securities, asset management, prime brokerage, and securities underwriting.\nThe bank is one of the largest investment banking enterprises in the world, and is a primary dealer in the United States Treasury security market and more generally, a prominent market maker. The group also owns Goldman Sachs Bank USA, a direct bank. Goldman Sachs was founded in 1869 and is headquartered at 200 West Street in Lower Manhattan with additional offices in other international financial centers.As a result of its involvement in securitization during the subprime mortgage crisis, Goldman Sachs suffered during the financial crisis of 2007–2008, and received a $10 billion investment from the United States Department of the Treasury as part of the Troubled Asset Relief Program, a financial bailout created by the Emergency Economic Stabilization Act of 2008. The investment was made in November 2008 and was repaid in June 2009.Former employees of Goldman Sachs have moved on to government positions. Notable examples include former U.S. Secretaries of the Treasury Robert Rubin and Henry Paulson; current United States Secretary of the Treasury Steven Mnuchin; former Under Secretary of State John C. Whitehead; former chief economic advisor Gary Cohn; Governor of New Jersey Phil Murphy and former Governor of New Jersey Jon Corzine; former Prime Minister of Italy Mario Monti; European Central Bank President Mario Draghi; former Bank of Canada and Bank of England Governor Mark Carney; British Chancellor of the Exchequer Rishi Sunak; and the former Prime Minister of Australia Malcolm Turnbull. In addition, former Goldman employees have headed the New York Stock Exchange, the World Bank, and competing banks such as Citigroup and Merrill Lynch.\nThe company is ranked 62nd on the Fortune 500 list of the largest United States corporations by total revenue."], "NoShare(Trillion)": ["7.43", "6.2", "NO INFO", "NO INFO", "1.859"], "KeyPeople": [["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], ["Mortimer J. Buckley"], ["John B. Frank|John Frank", "Bruce Karsh", "Howard Marks (investor)|Howard Marks"], ["Shantanu Narayen", "Chairman", "Chief executive officer|CEO", "Chief financial officer|CFO", "Chief technology officer|CTO"], ["Lloyd Blankfein", "Chairman|Senior Chairman", "David M. Solomon", "Chairman", "CEO", "President (corporate title)|President", "Chief operating officer|COO", "Richard Gnodde", "John F. W. Rogers"]]}