{"Name": ["ICAHN CARL C", "VANGUARD GROUP INC", "BLACKROCK INC.", "CANYON CAPITAL ADVISORS LLC", "ALLIANZ ASSET MANAGEMENT GMBH"], "Description": ["Carl Celian Icahn (; born February 16, 1936) is an American businessman and philanthropist. He is the founder and controlling shareholder of Icahn Enterprises, a diversified conglomerate holding company based in New York City, formerly known as American Real Estate Partners. He is also Chairman of Federal-Mogul, an American developer, manufacturer and supplier of powertrain components and vehicle safety products.\nIn the 1980s, Icahn developed a reputation as a \"corporate raider\" after profiting from the hostile takeover and asset stripping of the American airline TWA. According to Forbes magazine, Icahn had a net worth of $16.7 billion in 2020, making him the 26th-wealthiest person on the Forbes 400, and the 5th-wealthiest hedge fund manager.Icahn served as special economic adviser on financial regulation to U.S. President Donald Trump briefly in 2017, leaving amid concerns of conflicts of interest.\n\n", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "Canyon Partners is an employee-owned hedge fund founded by Joshua S. Friedman and Mitchell R. Julis in 1990 located in Los Angeles, California.Canyon Partners is a multi-strategy hedge fund and invests across asset classes ranging from bank debt, high yield and distressed securities, securitized assets, direct investments, convertible arbitrage, risk arbitrage, equities and special situation securities.As of January 2015, assets were approximately $23 billion. In the 2011 Hedge Fund Journal's 50 Largest US Hedge Fund Managers, Canyon Capital Advisors ranked 20. In 2015, Institutional Investor/Alpha magazine gave Canyon an A grade and the #10 ranking among hedge funds worldwide.", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "6.2", "7.43", "NO INFO", "NO INFO"], "KeyPeople": ["NO INFO", ["Mortimer J. Buckley"], ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], "NO INFO", "NO INFO"]}