{"Name": ["YORKTOWN ENERGY PARTNERS VI LP", "YORKTOWN ENERGY PARTNERS VII, L.P.", "DISCIPLINED INVESTMENTS, LLC", "CAPITAL ADVISORS INC/OK", "UBS GROUP AG"], "Description": ["NO INFO", "NO INFO", "NO INFO", "Merrill, legally Merrill Lynch, Pierce, Fenner & Smith Incorporated and previously branded as Merrill Lynch, is an American investing and wealth management division of Bank of America. Along with BofA Securities, the investment banking arm, both firms engage in prime brokerage and broker-dealer activities. The firm is headquartered in New York City, and once occupied the entire 34 stories of 250 Vesey Street, part of the Brookfield Place complex in Manhattan. Merrill employs over 14,000 financial advisors and manages $2.3 trillion in client assets. The company also operates Merrill Edge, an electronic trading platform.\nPrior to 2009, the company was publicly owned and traded on the New York Stock Exchange. Merrill Lynch & Co. agreed to be acquired by Bank of America on September 14, 2008, at the height of the financial crisis of 2007–2008, the same weekend that Lehman Brothers was allowed to fail. The acquisition was completed in January 2009 and Merrill Lynch & Co., Inc. was merged into Bank of America Corporation in October 2013, with certain Bank of America subsidiaries continuing to carry the Merrill Lynch name, including the broker-dealer Merrill Lynch, Pierce, Fenner & Smith. In 2019, Bank of America rebranded the unit to \"Merrill\".Merrill Lynch rose to prominence on the strength of its network financial advisors, sometimes referred to as the \"thundering herd\", that allowed it to place securities it underwrote directly. In contrast, many established Wall Street firms, such as Morgan Stanley, relied on groups of independent brokers for placement of the securities they underwrote. It was once known as the \"Catholic\" firm of Wall Street and most of its executives were Irish Catholics.\n\n", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": ["NO INFO", "NO INFO", "NO INFO", "NO INFO", "NO INFO"]}