{"Name": ["DIMENSIONAL FUND ADVISORS LP", "RENAISSANCE TECHNOLOGIES LLC", "VANGUARD GROUP INC", "WEDBUSH SECURITIES INC", "MORGAN STANLEY"], "Description": ["Dimensional Fund Advisors L.P. (abbreviated as Dimensional, DFA) is a private investment firm headquartered in Austin, Texas, United States. The company has affiliates within 13 offices in the US, Canada, UK, Germany, Netherlands, Australia, Singapore, and Japan. DFA was founded in 1981 by David G. Booth and Rex Sinquefield, both graduates of the School of Business (now known as the Booth School of Business), and Larry G Klotz. The company’s investment philosophy is rooted in the efficient market hypothesis and thus they were one of the earliest investing firms to emphasize index funds. [1]  The company offers over 100 equity and fixed income mutual funds.\nDimensional has $609 billion (USD) in firmwide assets under management as of December 31, 2019. Institutional investors can access Dimensional funds directly or through their consultant. Individual investors can access Dimensional funds through financial professionals, or through their retirement plans (both 401k and defined benefit), or certain 529 college savings plans. The company is owned by its employees, board members and outside investors, which as of 2005 was reported to include Governor Arnold Schwarzenegger of California. On November 6, 2008, the University of Chicago Graduate School of Business announced a $300 million gift from David Booth in the form of cash and the income stream from Dimensional stock.  The school was renamed the University of Chicago Booth School of Business.On December 2, 2009, Dimensional announced the acquisition of SmartNest, a retirement planning computer software company. The technology offered by SmartNest was developed by Robert C. Merton, who left the company's board after the purchase to become Resident Scientist.While having its headquarters in Austin, Texas, DFA opened its East Coast headquarters in Charlotte, North Carolina in 2019. Dimensional Charlotte was designed to serve the needs of clients and the advisors who work with the firm. The building includes expansive training and meeting spaces and will host many of the firm’s signature conferences and events.  DFA currently operates in Austin (TX), Charlotte (NC), Santa Monica (CA), Toronto (Canada), Vancouver (Canada), London (UK), Amsterdam (Netherlands), Berlin (Germany), Tokyo (Japan), Hong Kong (Hong Kong), Singapore (Singapore), Sydney (Australia), Melbourne (Australia).", "Renaissance Technologies LLC, also known as RenTech or RenTec, is an American hedge fund based in East Setauket, New York, on Long Island, which specializes in systematic trading using quantitative models derived from mathematical and statistical analyses. The firm is regarded as one of the \"most secretive and successful\" hedge funds in the world. Their signature Medallion fund is famed for the best record in investing history. Renaissance was founded in 1982 by James Simons, an award-winning mathematician and former Cold War code breaker.\nIn 1988, the firm established its most profitable portfolio, the Medallion Fund, which used an improved and expanded form of Leonard Baum's mathematical models, improved by algebraist James Ax, to explore correlations from which they could profit. Jim Berlekamp was instrumental in evolving trading to shorter-dated, pure systems driven decision-making. The hedge fund was named Medallion in honor of the math awards that Simons and Ax had won.Renaissance's flagship Medallion fund, which is run mostly for fund employees, is famed for the best track record on Wall Street, returning more than 66 percent annualized before fees and 39 percent after fees over a 30-year span from 1988 to 2018. Renaissance offers two portfolios to outside investors—Renaissance Institutional Equities Fund (RIEF) and Renaissance Institutional Diversified Alpha (RIDA).Simons ran Renaissance until his retirement in late 2009. The company is now run by Peter Brown (after Robert Mercer resigned). Both of them were computer scientists specializing in computational linguistics who joined Renaissance in 1993 from IBM Research. Simons continues to play a role at the firm as non-executive chairman and remains invested in its funds, particularly the secretive and consistently profitable black-box strategy known as Medallion. Because of the success of Renaissance in general and Medallion in particular, Simons has been described as the best money manager on earth.", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "Wedbush Securities Inc. is a privately held financial services and investment firm. based in Los Angeles. Gary Wedbush was appointed as Co-President in May 2018. The founder, Edward Wedbush, served as President for 63 years.", "Morgan Stanley is an American multinational investment bank and financial services company headquartered at 1585 Broadway in the Morgan Stanley Building, Midtown Manhattan, New York City. With offices in more than 42 countries and more than 60,000 employees, the firm's clients include corporations, governments, institutions, and individuals. Morgan Stanley ranked No. 67 in the 2018 Fortune 500 list of the largest United States corporations by total revenue.The original Morgan Stanley, formed by J.P. Morgan & Co. partners Henry Sturgis Morgan (grandson of J.P. Morgan), Harold Stanley, and others, came into existence on September 16, 1935, in response to the Glass–Steagall Act that required the splitting of commercial and investment banking businesses. In its first year, the company operated with a 24% market share (US$1.1 billion) in public offerings and private placements.\nThe current Morgan Stanley is the result of merger of the original Morgan Stanley with Dean Witter Discover & Co. in 1997. Dean Witter's Chairman and CEO, Philip J. Purcell, became the Chairman and CEO of the newly merged \"Morgan Stanley Dean Witter Discover & Co.\"  The new firm changed its name back to \"Morgan Stanley\" in 2001. The main areas of business for the firm today are institutional securities, wealth management and investment management.\n\n"], "NoShare(Trillion)": ["6.9", "NO INFO", "6.2", "NO INFO", "5.2"], "KeyPeople": [["David G. Booth"], [], ["Mortimer J. Buckley"], [], ["James P. Gorman", "Chairman", "Chief executive officer|CEO", "Thomas R. Nides|Thomas Nides", "Chief financial officer|CFO"]]}