{"Name": ["BLACK DIAMOND CAPITAL MANAGEMENT, L.L.C.", "CITIGROUP INC", "DIMENSIONAL FUND ADVISORS LP", "BRIDGEWAY CAPITAL MANAGEMENT INC", "CONTINENTAL ADVISORS LLC"], "Description": ["NO INFO", "Citigroup Inc. or Citi (stylized as citi) is an American multinational investment bank and financial services corporation headquartered in New York City. The company was formed by the merger of banking giant Citicorp and financial conglomerate Travelers Group in 1998; Travelers was subsequently spun off from the company in 2002. Citigroup owns Citicorp, the holding company for Citibank, as well as several international subsidiaries. Citi is incorporated in NY.Citigroup is ranked 3rd on the list of largest banks in the United States and, alongside JPMorgan Chase, Bank of America, and Wells Fargo, it is one of the Big Four banks of the United States. It is a systemically important financial institution and is on the list of systemically important banks that are commonly cited as being too big to fail. It is one of the nine global investment banks in the Bulge Bracket.\nCitigroup is ranked 30th on the Fortune 500 as of 2019. Citigroup has over 200 million customer accounts and does business in more than 160 countries. It has 214,000 employees, although it had 357,000 employees before the financial crisis of 2007-2008, when it was rescued via a massive stimulus package by the U.S. government.\n\n", "Dimensional Fund Advisors L.P. (abbreviated as Dimensional, DFA) is a private investment firm headquartered in Austin, Texas, United States. The company has affiliates within 13 offices in the US, Canada, UK, Germany, Netherlands, Australia, Singapore, and Japan. DFA was founded in 1981 by David G. Booth and Rex Sinquefield, both graduates of the School of Business (now known as the Booth School of Business), and Larry G Klotz. The company’s investment philosophy is rooted in the efficient market hypothesis and thus they were one of the earliest investing firms to emphasize index funds. [1]  The company offers over 100 equity and fixed income mutual funds.\nDimensional has $609 billion (USD) in firmwide assets under management as of December 31, 2019. Institutional investors can access Dimensional funds directly or through their consultant. Individual investors can access Dimensional funds through financial professionals, or through their retirement plans (both 401k and defined benefit), or certain 529 college savings plans. The company is owned by its employees, board members and outside investors, which as of 2005 was reported to include Governor Arnold Schwarzenegger of California. On November 6, 2008, the University of Chicago Graduate School of Business announced a $300 million gift from David Booth in the form of cash and the income stream from Dimensional stock.  The school was renamed the University of Chicago Booth School of Business.On December 2, 2009, Dimensional announced the acquisition of SmartNest, a retirement planning computer software company. The technology offered by SmartNest was developed by Robert C. Merton, who left the company's board after the purchase to become Resident Scientist.While having its headquarters in Austin, Texas, DFA opened its East Coast headquarters in Charlotte, North Carolina in 2019. Dimensional Charlotte was designed to serve the needs of clients and the advisors who work with the firm. The building includes expansive training and meeting spaces and will host many of the firm’s signature conferences and events.  DFA currently operates in Austin (TX), Charlotte (NC), Santa Monica (CA), Toronto (Canada), Vancouver (Canada), London (UK), Amsterdam (Netherlands), Berlin (Germany), Tokyo (Japan), Hong Kong (Hong Kong), Singapore (Singapore), Sydney (Australia), Melbourne (Australia).", "Bridgeway Capital Management Inc. (\"Bridgeway\") is a U.S. quantitative investment management firm that employs several multi-factor proprietary statistical models to assemble its investment portfolios. Bridgeway specializes in domestic equities, and is the adviser for Bridgeway Funds, the company's family of eleven no-load mutual funds. Bridgeway also provides sub-advisory and separate account services.", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "NO INFO", "6.9", "NO INFO", "NO INFO"], "KeyPeople": ["NO INFO", ["John C. Dugan", "Michael Corbat", "Jane Fraser (banking)|Jane Fraser"], ["David G. Booth"], "NO INFO", "NO INFO"]}