{"ModuleTitle": "Company Description", "CompanyName": "Cisco Systems, Inc.", "Symbol": "CSCO", "Address": "170 WEST TASMAN DR, SAN JOSE, California, 95134-1706, United States of America", "Phone": "4085264000", "Industry": "Computer Communications Equipment", "Sector": "Technology", "Region": "North America", "CompanyDescription": " <p>Cisco (ticker symbol: <b>CSCO</b>) is the world's largest supplier of networking equipment and systems, playing an important role in a wide variety of computing fields. The company was founded in 1984 in San Francisco, California, by a pair of Stanford University computer engineers - Len Bosack and Sandy Lerner. The two named the company after a common nickname for San Francisco.</p>\r\n\r\n<p>Entering the market as computers began to play a more widespread role in business, Cisco focused on developing routers. In particular, the company emphasized the development of multiple-protocol routers, eventually expanding into Ethernet switching after the acquisition of several companies in that field. Cisco's strong pursuit of service providers in the early days of the internet provided it a dominant market position in the late 1990s and early 2000s, at one point becoming the most valuable company in the world.</p>\r\n\r\n<p>Routers, switches and other network systems still account for a significant proportion of Cisco's overall product offerings, but its portfolio has since expanded to include software services such as security and video conferencing. The company still largely targets businesses, but its Linksys access points and switches are a prominent part of the consumer market.</p>\r\n\r\n<p>Since its founding 30 years ago, Cisco has migrated away from its namesake, moving its headquarters south to 170 West Tasman Drive, San Jose, California 95134. However, with 60,000 employees the company features locations around the world, including a major presence in India with its Globalisation Centre East in Bangalore.</p>\r\n\r\n<p>Despite strong recent performance, Cisco still faces a wide variety of risk factors, including uncertain demand for network products during economic downturns, growing challenges from domestic and international competitors and potential supply chain interruptions.\r\n</p> \r\n", "KeyExecutives": [{"name": "Charles H. Robbins", "title": "Chairman & Chief Executive Officer"}, {"name": "Chuck Churchill", "title": "Director-IT"}, {"name": "Kelly A. Kramer", "title": "Chief Financial Officer & Executive Vice President"}, {"name": "Tiang Yew Tan", "title": "Chief Operations"}], "Number_of_employees": ["5,900"], "Subsidiaries": ["Cisco Systems"]}