{"Name": ["US BANCORP \\DE\\", "MORGAN STANLEY", "ROYAL BANK OF CANADA", "BLACKROCK INC.", "TOWER RESEARCH CAPITAL LLC (TRC)"], "Description": ["U.S. Bancorp (stylized as us bancorp) is an American bank holding company based in Minneapolis, Minnesota, and incorporated in Delaware. It is the parent company of U.S. Bank National Association, and is on the list of largest banks in the United States. The company provides banking, investment, mortgage, trust, and payment services products to individuals, businesses, governmental entities, and other financial institutions. It has 3,106 branches and 4,842 ATMs, primarily in the Western and Midwestern United States. It is ranked 117th on the Fortune 500. The company also owns Elavon, a processor of credit card transactions for merchants and Elan Financial Services, a credit card issuer that issue credit card products to US Bank and other financial institutions.U.S. Bancorp operates under the second-oldest continuous national charter, originally Charter #24, granted in 1863 following the passage of the National Bank Act. Earlier charters have expired as banks were closed or acquired, raising U.S. Bank's charter number from #24 to #2. The oldest national charter, originally granted to the First National Bank of Philadelphia, is held by Wells Fargo, which it obtained upon its merger with Wachovia.\n\n", "Morgan Stanley is an American multinational investment bank and financial services company headquartered at 1585 Broadway in the Morgan Stanley Building, Midtown Manhattan, New York City. With offices in more than 42 countries and more than 60,000 employees, the firm's clients include corporations, governments, institutions, and individuals. Morgan Stanley ranked No. 67 in the 2018 Fortune 500 list of the largest United States corporations by total revenue.The original Morgan Stanley, formed by J.P. Morgan & Co. partners Henry Sturgis Morgan (grandson of J.P. Morgan), Harold Stanley, and others, came into existence on September 16, 1935, in response to the Glass–Steagall Act that required the splitting of commercial and investment banking businesses. In its first year, the company operated with a 24% market share (US$1.1 billion) in public offerings and private placements.\nThe current Morgan Stanley is the result of merger of the original Morgan Stanley with Dean Witter Discover & Co. in 1997. Dean Witter's Chairman and CEO, Philip J. Purcell, became the Chairman and CEO of the newly merged \"Morgan Stanley Dean Witter Discover & Co.\"  The new firm changed its name back to \"Morgan Stanley\" in 2001. The main areas of business for the firm today are institutional securities, wealth management and investment management.\n\n", "The Royal Bank of Canada (RBC; French: Banque royale du Canada) is a Canadian multinational financial services company and the  largest bank in Canada by market capitalization. The bank serves over 16 million clients and has 86,000+ employees worldwide. The bank was founded in 1864 in Halifax, Nova Scotia, although its corporate headquarters is located in Toronto, Ontario, and its legal head office in Montreal, Quebec. RBC's institution number (or bank number) is 003. In November 2017, RBC was added to the Financial Stability Board's list of global systemically important banks.\nIn Canada, the bank's personal and commercial banking operations are branded as RBC Royal Bank in English and RBC Banque Royale in French and serves approximately ten million clients through its network of 1,209 branches. RBC Bank is the U.S. banking subsidiary which formerly operated 439 branches across six states in the Southeastern United States, but now only offers cross-border banking services to Canadian travellers and expats. RBC also has 127 branches across seventeen countries in the Caribbean, which serve more than 16 million clients. RBC Capital Markets is RBC's worldwide investment and corporate banking subsidiary, while the investment brokerage firm is known as RBC Dominion Securities. Investment banking services are also provided through RBC Bank and the focus is on middle market clients.\nIn 2011, RBC was the largest Canadian company by revenue and market capitalization. and was ranked at No. 50 in the 2013 Forbes Global 2000 listing, The company has operations in Canada, and 40 other countries and had US$673.2 billion of assets under management in 2014.", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "Tower Research Capital LLC is a financial services fund started by Mark Gorton and John Martello in 1998.\nThe financial engine behind many of Mark Gorton's business and civic interests is Tower Research Capital LLC, a financial services firm that he started in 1998, following a 4½ year stint in the proprietary trading department of Credit Suisse First Boston (now Credit Suisse). At Credit Suisse, Gorton traded stocks and built sophisticated hedging tools used to analyze markets. Tower evolved these models and specializes in quantitative trading and investment strategies based on proprietary trading algorithms using a statistical methodology to identify non-random patterns in the stock markets. Buying and selling are done through an automated trade execution infrastructure.Tower is staffed by employees proficient in diverse backgrounds such as mathematics, computer programming, physics, law, economics, engineering, finance, and more. As of 2012, Tower had 500 people in its global staff."], "NoShare(Trillion)": ["NO INFO", "5.2", "NO INFO", "7.43", "NO INFO"], "KeyPeople": [["Chairman#Public corporations|Chairman", "President (corporate title)|President", "CEO"], ["James P. Gorman", "Chairman", "Chief executive officer|CEO", "Thomas R. Nides|Thomas Nides", "Chief financial officer|CFO"], ["David I. McKay"], ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], "NO INFO"]}