{"Name": ["KOHLBERG KRAVIS ROBERTS & CO. L.P.", "ARROWMARK COLORADO HOLDINGS LLC", "FMR LLC", "G2 INVESTMENT PARTNERS MANAGEMENT LLC", "BLACKROCK INC."], "Description": ["KKR & Co. Inc. (formerly known as Kohlberg Kravis Roberts & Co. and KKR & Co. L.P.) is an American global investment firm that manages multiple alternative asset classes, including private equity, energy, infrastructure, real estate, credit, and, through its strategic partners, hedge funds. The firm has completed more than 280 private equity investments in portfolio companies with approximately $545 billion of total enterprise value as of June 30, 2017. As of September 30, 2017, Assets Under Management (\"AUM\") and Fee Paying Assets Under Management (\"FPAUM\") were $153 billion and $114 billion, respectively.The firm was founded in 1976 by Jerome Kohlberg, Jr., and cousins Henry Kravis and George R. Roberts, all of whom had previously worked together at Bear Stearns, where they completed some of the earliest leveraged buyout transactions. Since its founding, KKR has completed a number of transactions, including the 1989 leveraged buyout of RJR Nabisco, which was the largest buyout in history to that point, as well as the 2007 buyout of TXU, which is currently the largest buyout completed to date.KKR has offices in 21 cities in 16 countries across five continents. The firm is currently headquartered in the Solow Building (9 West 57th Street, New York, NY), but in October 2015, the firm announced its intention to occupy a newly constructed 30 Hudson Yards.In October 2009, KKR listed shares in the company through KKR & Co., an affiliate that holds 30% of the firm's ownership equity, with the remainder held by the firm's partners. In March 2010, KKR filed to list its shares on the New York Stock Exchange (NYSE), with trading commencing four months later, on July 15, 2010.\n\n", "NO INFO", "Fidelity Investments Inc., commonly referred to as Fidelity, earlier as Fidelity Management & Research or FMR, is an American multinational financial services corporation based in Boston, Massachusetts.\nIt is one of the largest asset managers in the world with $2.46 trillion in assets under management as of March 2018 and a combined total customer asset value number of $6.7 trillion. Fidelity Investments operates a brokerage firm, manages a large family of mutual funds, provides fund distribution and investment advice, retirement services, Index funds, wealth management, cryptocurrency, securities execution and clearance, and life insurance.", "NO INFO", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank."], "NoShare(Trillion)": ["148.5", "NO INFO", "2.46", "NO INFO", "7.43"], "KeyPeople": [["Chairman|Co-Chairman", "Chief executive officer|Co-CEO"], "NO INFO", ["Abigail Johnson", "CEO", "CEO"], "NO INFO", ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"]]}