{"Name": ["BLACKROCK INC.", "ROYAL BANK OF CANADA", "AREX CAPITAL MANAGEMENT, LP", "DIMENSIONAL FUND ADVISORS LP", "HCSF MANAGEMENT, LLC"], "Description": ["BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "The Royal Bank of Canada (RBC; French: Banque royale du Canada) is a Canadian multinational financial services company and the  largest bank in Canada by market capitalization. The bank serves over 16 million clients and has 86,000+ employees worldwide. The bank was founded in 1864 in Halifax, Nova Scotia, although its corporate headquarters is located in Toronto, Ontario, and its legal head office in Montreal, Quebec. RBC's institution number (or bank number) is 003. In November 2017, RBC was added to the Financial Stability Board's list of global systemically important banks.\nIn Canada, the bank's personal and commercial banking operations are branded as RBC Royal Bank in English and RBC Banque Royale in French and serves approximately ten million clients through its network of 1,209 branches. RBC Bank is the U.S. banking subsidiary which formerly operated 439 branches across six states in the Southeastern United States, but now only offers cross-border banking services to Canadian travellers and expats. RBC also has 127 branches across seventeen countries in the Caribbean, which serve more than 16 million clients. RBC Capital Markets is RBC's worldwide investment and corporate banking subsidiary, while the investment brokerage firm is known as RBC Dominion Securities. Investment banking services are also provided through RBC Bank and the focus is on middle market clients.\nIn 2011, RBC was the largest Canadian company by revenue and market capitalization. and was ranked at No. 50 in the 2013 Forbes Global 2000 listing, The company has operations in Canada, and 40 other countries and had US$673.2 billion of assets under management in 2014.", "NO INFO", "Dimensional Fund Advisors L.P. (abbreviated as Dimensional, DFA) is a private investment firm headquartered in Austin, Texas, United States. The company has affiliates within 13 offices in the US, Canada, UK, Germany, Netherlands, Australia, Singapore, and Japan. DFA was founded in 1981 by David G. Booth and Rex Sinquefield, both graduates of the School of Business (now known as the Booth School of Business), and Larry G Klotz. The company’s investment philosophy is rooted in the efficient market hypothesis and thus they were one of the earliest investing firms to emphasize index funds. [1]  The company offers over 100 equity and fixed income mutual funds.\nDimensional has $609 billion (USD) in firmwide assets under management as of December 31, 2019. Institutional investors can access Dimensional funds directly or through their consultant. Individual investors can access Dimensional funds through financial professionals, or through their retirement plans (both 401k and defined benefit), or certain 529 college savings plans. The company is owned by its employees, board members and outside investors, which as of 2005 was reported to include Governor Arnold Schwarzenegger of California. On November 6, 2008, the University of Chicago Graduate School of Business announced a $300 million gift from David Booth in the form of cash and the income stream from Dimensional stock.  The school was renamed the University of Chicago Booth School of Business.On December 2, 2009, Dimensional announced the acquisition of SmartNest, a retirement planning computer software company. The technology offered by SmartNest was developed by Robert C. Merton, who left the company's board after the purchase to become Resident Scientist.While having its headquarters in Austin, Texas, DFA opened its East Coast headquarters in Charlotte, North Carolina in 2019. Dimensional Charlotte was designed to serve the needs of clients and the advisors who work with the firm. The building includes expansive training and meeting spaces and will host many of the firm’s signature conferences and events.  DFA currently operates in Austin (TX), Charlotte (NC), Santa Monica (CA), Toronto (Canada), Vancouver (Canada), London (UK), Amsterdam (Netherlands), Berlin (Germany), Tokyo (Japan), Hong Kong (Hong Kong), Singapore (Singapore), Sydney (Australia), Melbourne (Australia).", "NO INFO"], "NoShare(Trillion)": ["7.43", "NO INFO", "NO INFO", "6.9", "NO INFO"], "KeyPeople": [["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], ["David I. McKay"], "NO INFO", ["David G. Booth"], "NO INFO"]}