{"Name": ["DODGE & COX", "ELLIOTT ASSOCIATES, L.P.", "ELLIOTT INVESTMENT MANAGEMENT L.P.", "CAPITAL WORLD INVESTORS", "TEMASEK HOLDINGS (PRIVATE) LTD"], "Description": ["Dodge & Cox is an American mutual fund company, founded in 1930 by Van Duyn Dodge and E. Morris Cox, that provides professional investment management services. Dodge and Cox specializes in value investing and has been described as \"best known for its conservatively managed funds with solid track records and modest fees.\" Having been created during the Great Depression, the firm has \"a razor sharp focus on capital preservation\". Dodge & Cox practices a team-based management strategy and as of 2017, the firm had US$297 billion in assets under management.Headquartered in San Francisco, California, the company offers six no-load mutual funds: a domestic stock fund, an international stock fund, a balanced fund, an income fund, a global stock fund, and a global bond fund. Their balanced fund, comprising 50-70% large company stocks and the remainder in bonds, was established in 1931 and is one of the oldest US mutual funds still in operation as of February 2019.Due to their devotion to the principles of value investing, Dodge & Cox avoided the worst of the dot com bubble during the late 1990s and early 2000 by limiting their exposure to overvalued and then-trendy internet stocks, thereby significantly out-performing the broader market when the bubble collapsed. According to a 2017 Morningstar, Inc. analysis, the firm's low staff turnover and investing principles have been largely beneficial over the long-term but have also led to \"bouts of sluggishness or disappointing results\".", "NO INFO", "NO INFO", "NO INFO", "Temasek Holdings Private Limited (abbreviated as Temasek) is a Singaporean holding company, owned by the Government of Singapore. Incorporated on 25 June 1974 as a Commercial Investment Company, Temasek owns and manages a net portfolio of $313 billion (as of 31 March 2019), with S$28 billion divested and S$24 billion invested during the year, and 66% exposure to Asia – 26% Singapore and 40% Asia ex-Singapore. It is an active shareholder and investor, and its investments are guided by four key themes – transforming economies, growing middle income populations, deepening comparative advantages and emerging champions. Its portfolio covers a broad spectrum of sectors including financial services, telecommunications, media and technology, transportation and industrials, life sciences and agribusiness, consumer and real estate, energy and resources, as well as multi-sector funds. Headquartered in Singapore, Temasek has a multinational team of 800 people, in 11 global offices including two offices in Beijing, and one office in each of Shanghai, Mumbai, Hanoi, London, New York, San Francisco, Mexico City, Washington, D.C., and Sao Paulo.Temasek differs from many sovereign wealth funds because it invests mostly in equities, is the outright owner of many assets, and pays taxes like other commercial investment firms.Temasek has credit ratings of “AAA/Aaa” by Standard & Poor's Global Ratings and Moody's Investors Service respectively since their inaugural ratings in 2004. Temasek has also attained perfect quarterly scores on the Linaburg-Maduell Transparency Index, a measure of the openness of government-owned investment funds."], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": [[], "NO INFO", "NO INFO", "NO INFO", ["Lim Boon Heng", "Chairman", "Cheng Wai Keung", "Deputy Chairman", "Ho Ching", "Executive Director", "Chief executive officer|CEO"]]}