{"ModuleTitle": "Company Description", "CompanyName": "Alphabet Inc.", "Symbol": "GOOG", "Address": "1600 AMPHITHEATRE PARKWAY, MOUNTAIN VIEW, California, 94043, United States of America", "Phone": "650 253-0000", "Industry": "Computer Software: Programming, Data Processing", "Sector": "Technology", "Region": "North America", "CompanyDescription": " <p>Google (ticker symbol: <b>GOOG</b>) is an American multinational leader in technology that aims to \"organize the world's information and make it universally accessible and useful.\" Founded by Larry Page and Sergey Brin, who were attending Stanford University at the time, Google was first incorporated as a privately held company on September 4, 1998.</p>\r\n\r\n<p>From the outset, Google's core product has been its internet search engine, which remains the most popular such service across the globe. The company boasts one of the largest research groups in the world tasked with solving search problems and improving the process of accessing information.</p>\r\n\r\n<p>Beyond its search engine, Google has introduced a significant number of successful products, including Gmail, Google Maps, an office suite and applications for web browsing, instant messaging and photo editing. The vast majority of Google's revenue is gained through advertising, however. Its AdWords program offers businesses an opportunity to promote their products to a targeted audience, while its AdSense program allows third parties within the Google Network to generate revenue through relevant advertisements.</p>\r\n\r\n<p>The numbers tell the story of Google's global reach. The company runs more than 1 million servers in data centers around the world and processes more than 1 billion search requests on a daily basis, according to estimates.</p>\r\n\r\n<p>Currently headquartered at 1600 Amphitheatre Parkway, Mountain View, California 94043, Google was reincorporated in Delaware in 2003 and operates six data centers across the U.S., one in Belgium and another in Finland. Plans are in place for the completion of three more data centers in Singapore, Taiwan and Hong Kong.</p>\r\n\r\n<p>The leading risk factors facing Google include constantly changing technology, shifting consumer demand, service disruptions and increased competition from both established and startup companies in industries ranging from traditional media to social networking.\r\n</p> \r\n", "KeyExecutives": [{"name": "Ruth M. Porat", "title": "Chief Financial Officer & Senior Vice President"}, {"name": "Sundar Pichai", "title": "Chief Executive Officer & Director"}], "Number_of_employees": ["8,899"], "Subsidiaries": ["Google Fiber", "Loon L", "Sidewalk Labs"]}