{"ModuleTitle": "Company Description", "CompanyName": "Constellation Pharmaceuticals, Inc.", "Symbol": "CNST", "Address": "215 FIRST STREET SUITE 200, CAMBRIDGE, Massachusetts, 02142, United States of America", "Phone": "617-714-0555", "Industry": "Major Pharmaceuticals", "Sector": "Health Care", "Region": "North America", "CompanyDescription": "We are a clinical-stage biopharmaceutical company using our expertise in\r\nepigenetics to discover and develop novel therapeutics that address serious\r\nunmet medical needs in patients with cancers associated with abnormal gene\r\nexpression or drug resistance. Our integrated epigenetics platform enables us to\r\nvalidate targets and generate small molecules impacting these targets to\r\nselectively modulate gene expression in tumor and immune cells to drive\r\nanti-tumor activity. This platform reflects our deep understanding of the\r\nbiology of regulation of gene expression by epigenetic regulatory proteins, or\r\nepigenetic regulators, the development of small-molecule product candidates that\r\nselectively modulate their activity, and the design of clinical development\r\nprograms supported by novel biomarker strategies. We are able to target a broad\r\nvariety of epigenetic regulators using our platform and have generated\r\ndevelopment candidates acting against distinct classes of those regulators.&nbsp;&nbsp;... <a href=\"http://secfilings.nasdaq.com/edgar_conv_html%2f2020%2f03%2f10%2f0001564590-20-009735.html#FIS_BUSINESS\" target=\"_blank\">More</a> ...&nbsp;&nbsp;\r\n", "KeyExecutives": [{"name": "Adrian M. Senderowicz", "title": "Chief Medical Officer & Senior Vice President"}, {"name": "Brenda J. Sousa", "title": "Senior VP-Human Resources & Operations"}, {"name": "Emma Reeve", "title": "Chief Financial Officer, Treasurer & Senior VP"}, {"name": "Jigar Raythatha", "title": "President, Chief Executive Officer & Director"}, {"name": "Patric Trojer", "title": "Chief Scientific Officer"}], "Number_of_employees": ["NO INFO"], "Subsidiaries": ["NO INFO"]}