{"ModuleTitle": "Company Description", "CompanyName": "Intel Corporation", "Symbol": "INTC", "Address": "2200 MISSION COLLEGE BLVD RNB-4-151, SANTA CLARA, California, 95054, United States of America", "Phone": "4087658080", "Industry": "Semiconductors", "Sector": "Technology", "Region": "North America", "CompanyDescription": " <p>Intel (ticker symbol: <b>INTC</b>)  is the world's leading manufacturer and developer of computer microprocessors and chipsets, founded in California's Silicon Valley in 1968. The name Intel derives from the phrase Integrated Electronics.</p>\r\n\r\n<p>In 1971, Intel introduced the first microprocessor after several years of producing semiconductor-based memory storage products, revolutionizing the shape of the global computing industry. The company's most important products remain its microchips, which power a huge number of the personal computers, tablets and smartphones around the world,. However, it also manufactures a wide variety of different chipsets, memory solutions, mobile phone components, software and services.</p>\r\n\r\n<p>Intel remains one of the great research and development powerhouses of Silicon Valley, pushing forward chip technology and manufacturing through what it calls its \"tick-tock technology development cadence.\" Its main focus is continuously improving the speed, efficiency and portability of its chip products, and the company boasts of a major role in bringing about the realization of Moore's law, which asserted in 1965 \"that transistor density on integrated circuits would double about every two years.\"</p>\r\n\r\n<p>Although Intel's principal executives offices remain in California and the technology company is incorporated in Delaware, its manufacturing and research facilities sprawl across the United States and, indeed, the globe, with major operations in New Mexico, Arizona, Massachusetts, Ireland, China and Israel. The growing importance of smartphones and lightweight tablets and notebooks led to a surge of investment in smaller, more efficient and cheaper chips. In fact, Intel will become the first company to construct a high-volume facility for 14nm process technology.</p>\r\n\r\n<p>Risk factors facing the company include a downturn in general business conditions or the technology industry in particular, currency and commodity price fluctuation, disruption of the global supply chain and major shifts in business and consumer and behavior for tech products.\r\n</p> \r\n", "KeyExecutives": [{"name": "Ann-Marie Holmes", "title": "Vice President-Operations & Manufacturing"}, {"name": "Archana Deskus", "title": "Chief Information Officer & Senior Vice President"}, {"name": "Daniel J. McKeon", "title": "Vice President-Information Technology Group"}, {"name": "George S. Davis", "title": "Chief Financial Officer & Executive Vice President"}, {"name": "Mark H. Henninger", "title": "CFO-Sales & Marketing Group, VP-Finance"}, {"name": "Michael Mayberry", "title": "Chief Technology Officer & Senior Vice President"}, {"name": "Robert Holmes Swan", "title": "Chief Executive Officer & Director"}, {"name": "Todd M. Underwood", "title": "Vice President & CFO-Client Computing Group"}, {"name": "Venkata S. M. Renduchintala", "title": "Chief Engineering Officer"}], "Number_of_employees": ["0,200"], "Subsidiaries": ["Intel Corp.", "Intel Corporation", "Corporation Subsidiaries"]}