{"Name": ["HILLHOUSE CAPITAL ADVISORS, LTD.", "VANGUARD GROUP INC", "TEMASEK HOLDINGS (PRIVATE) LTD", "MASO CAPITAL PARTNERS LTD", "BANK OF AMERICA CORP /DE/"], "Description": ["NO INFO", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "Temasek Holdings Private Limited (abbreviated as Temasek) is a Singaporean holding company, owned by the Government of Singapore. Incorporated on 25 June 1974 as a Commercial Investment Company, Temasek owns and manages a net portfolio of $313 billion (as of 31 March 2019), with S$28 billion divested and S$24 billion invested during the year, and 66% exposure to Asia – 26% Singapore and 40% Asia ex-Singapore. It is an active shareholder and investor, and its investments are guided by four key themes – transforming economies, growing middle income populations, deepening comparative advantages and emerging champions. Its portfolio covers a broad spectrum of sectors including financial services, telecommunications, media and technology, transportation and industrials, life sciences and agribusiness, consumer and real estate, energy and resources, as well as multi-sector funds. Headquartered in Singapore, Temasek has a multinational team of 800 people, in 11 global offices including two offices in Beijing, and one office in each of Shanghai, Mumbai, Hanoi, London, New York, San Francisco, Mexico City, Washington, D.C., and Sao Paulo.Temasek differs from many sovereign wealth funds because it invests mostly in equities, is the outright owner of many assets, and pays taxes like other commercial investment firms.Temasek has credit ratings of “AAA/Aaa” by Standard & Poor's Global Ratings and Moody's Investors Service respectively since their inaugural ratings in 2004. Temasek has also attained perfect quarterly scores on the Linaburg-Maduell Transparency Index, a measure of the openness of government-owned investment funds.", "NO INFO", "The Bank of America Corporation (simply referred to as Bank of America, often abbreviated as BofA) is an American multinational investment bank and financial services company headquartered in Charlotte, with central hubs in New York City, London, Hong Kong, Dallas, and Toronto. Founded in San Francisco, Bank of America was formed through NationsBank's acquisition of BankAmerica in 1998. It is the second largest banking institution in the United States, after JPMorgan Chase, and the ninth largest financial services company in the world (by revenue). As a part of the Big Four, it services approximately 10.73% of all American bank deposits, in direct competition with Citigroup, Wells Fargo, and JPMorgan Chase. Its primary financial services revolve around commercial banking, wealth management, and investment banking.\nOne branch of its history stretches back to Bank of Italy, founded by Amadeo Pietro Giannini in 1904, which provided Italian immigrants who faced service discrimination various banking options. Originally headquartered in San Francisco, California, Giannini acquired Banca d'America e d'Italia (Bank of America and Italy) in 1922. The passage of landmark federal banking legislation facilitated rapid growth in the 1950s, quickly establishing a prominent market share. After suffering a significant loss after the 1998 Russian bond default, BankAmerica, as it was then known, was acquired by the Charlotte-based NationsBank for US$62 billion. Following what was then the largest bank acquisition in history, the Bank of America Corporation was founded. Through a series of mergers and acquisitions, it built upon its commercial banking business by establishing Merrill Lynch for wealth management and Bank of America Merrill Lynch for investment banking in 2008 and 2009, respectively (since renamed BofA Securities).Both Bank of America and Merrill Lynch Wealth Management retain large market shares in their respective offerings. The investment bank is considered within the \"Bulge Bracket\" as the third largest investment bank in the world, as of 2018. Its wealth management side manages US$1.081 trillion in assets under management (AUM) as the second largest wealth manager in the world, after UBS. In commercial banking, Bank of America operates—but does not necessarily maintain retail branches—in all 50 states of the United States, the District of Columbia and more than 40 other countries. Its commercial banking footprint encapsulates 46 million consumer and small business relationships at 4,600 banking centers and 15,900 automated teller machines (ATMs).\nThe bank's large market share, business activities, and economic impact has led to numerous lawsuits and investigations regarding both mortgages and financial disclosures dating back to the 2008 financial crisis. Its corporate practices of servicing the middle class and wider banking community has yielded a substantial market share since the early 20th century. As of August 2018, Bank of America has a $313.5 billion market capitalization, making it the 13th largest company in the world. As the sixth largest American public company, it garnered $102.98 billion in sales as of June 2018. Bank of America was ranked #24 on the 2018 Fortune 500 rankings of the largest United States corporations by total revenue. Bank of America was named the \"World's Best Bank\" by the Euromoney Institutional Investor in their 2018 Awards for Excellence.\n\n"], "NoShare(Trillion)": ["NO INFO", "6.2", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": ["NO INFO", ["Mortimer J. Buckley"], ["Lim Boon Heng", "Chairman", "Cheng Wai Keung", "Deputy Chairman", "Ho Ching", "Executive Director", "Chief executive officer|CEO"], "NO INFO", ["Brian Moynihan", "Chairman", "Chief executive officer|CEO", "Anne Finucane", "Chairman|Co-Vice Chairman", "Chairman|Co-Vice Chairman"]]}