{"Name": ["BAILLIE GIFFORD & CO", "NIKKO ASSET MANAGEMENT AMERICAS, INC.", "SUMITOMO MITSUI TRUST HOLDINGS, INC.", "VANGUARD GROUP INC", "FMR LLC"], "Description": ["Baillie Gifford is an investment management firm which is wholly owned by 44 partners, all of whom work within the firm. It was founded in Edinburgh in 1908 and still has its headquarters in the city. Assets under management and advice of £196.3 billion or $262 billion (as at 30 September 2018).", "NO INFO", "Sumitomo Mitsui Trust Holdings, Inc. (三井住友トラスト・ホールディングス株式会社, Mitsui Sumitomo Torasuto Hōrudingusu Kabushiki Gaisha), formerly Chuo Mitsui Trust Holdings, Inc., is a Japanese financial holding company headquartered in Chiyoda, Tokyo. It provides an assortment of financial products to retail and wholesale customers, with a focus on asset management, financial brokerage and real estate services.Its main operating company is Sumitomo Mitsui Trust Bank, Limited (三井住友信託銀行株式会社, Mitsui Sumitomo Shintaku Ginkō Kabushiki Gaisha), which is the largest trust company and the fifth-largest bank in Japan measured by assets.\nThe company has no capital relationship with the Sumitomo Mitsui Financial Group; the two banking groups are similarly named because both are descended from the historical Sumitomo and Mitsui conglomerates.\nThere is just a weak control relationship between Sumitomo Mitsui Trust Holdings and Sumitomo Mitsui Financial Group. In fact SM Trust Holdings controls about 66% of Japan Trustee Services Bank. As of March 31, 2017, SM Financial Group's website reports that Japan Trustee Services Bank owned 5.50% of Sumitomo Mitsui Financial Group, but also 1.52% from trust location n. 1 (信託口1), 1.50% from trust location n. 2 (信託口2), 2.05% from location n. 5 (信託口5), 1.36% from trust location n. 7 (信託口7), and 1.85% from trust location n. 9 (信託口9) as well.", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "Fidelity Investments Inc., commonly referred to as Fidelity, earlier as Fidelity Management & Research or FMR, is an American multinational financial services corporation based in Boston, Massachusetts.\nIt is one of the largest asset managers in the world with $2.46 trillion in assets under management as of March 2018 and a combined total customer asset value number of $6.7 trillion. Fidelity Investments operates a brokerage firm, manages a large family of mutual funds, provides fund distribution and investment advice, retirement services, Index funds, wealth management, cryptocurrency, securities execution and clearance, and life insurance."], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "6.2", "2.46"], "KeyPeople": [[], "NO INFO", ["President (corporate title)|President"], ["Mortimer J. Buckley"], ["Abigail Johnson", "CEO", "CEO"]]}