{"Name": ["FIRST TRUST ADVISORS LP", "VANGUARD GROUP INC", "ALIBABA GROUP HOLDING LTD", "MIG CAPITAL, LLC", "BLACKROCK INC."], "Description": ["NO INFO", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "Alibaba Group Holding Limited (also known as Alibaba Group and as Alibaba.com) is a Chinese multinational technology company specializing in e-commerce, retail, Internet, and technology. Founded on 4 April 1999 in Hangzhou, Zhejiang, the company provides consumer-to-consumer (C2C), business-to-consumer (B2C), and business-to-business (B2B) sales services via web portals, as well as electronic payment services, shopping search engines and cloud computing services. It owns and operates a diverse array of businesses around the world in numerous sectors.At closing time on the date of its initial public offering (IPO) – US$25 billion, the world's highest in history – 19 September 2014, Alibaba's market value was US$231 billion. It is one of the top 10 most valuable and is the 59th biggest public company in the world by Global 2000 list. In January 2018, Alibaba became the second Asian company to break the US$500 billion valuation mark, after its competitor Tencent. As of 2018, Alibaba has the 9th highest global brand valuation.Alibaba is the world's largest retailer and e-commerce company, is on the list of largest Internet companies and artificial intelligence companies, is one of the biggest venture capital firms, and one of the biggest investment corporations in the world. The company hosts the largest B2B (Alibaba.com), C2C (Taobao), and B2C (Tmall) marketplaces in the world. Its online sales and profits surpassed all US retailers (including Walmart, Amazon, and eBay) combined since 2015. It has been expanding into the media industry, with revenues rising by triple percentage points year after year. It also sets the record on the 2018 edition of China's Singles' Day, the world's biggest online and offline shopping day.", "NO INFO", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank."], "NoShare(Trillion)": ["NO INFO", "6.2", "NO INFO", "NO INFO", "7.43"], "KeyPeople": ["NO INFO", ["Mortimer J. Buckley"], ["Daniel Zhang", "Chairman#Executive chairman|executive chairman", "CEO", "Joseph Tsai", "Vice Chairman|executive vice chairman", "J. Michael Evans", "President (corporate title)|president"], "NO INFO", ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"]]}