{"Name": ["VANGUARD GROUP INC", "BLACKROCK INC.", "STATE STREET CORP", "FMR LLC", "BANK OF AMERICA CORP /DE/"], "Description": ["The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $5.3 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "State Street Corporation is an American financial services and bank holding company headquartered at One Lincoln Street in Boston with operations worldwide. It is the second-oldest continually operating United States bank; its predecessor, Union Bank, was founded in 1792. State Street is ranked 15th on the list of largest banks in the United States by assets. It is one of the largest asset management companies in the world with US$2.511 trillion under management and US$31.62 trillion under custody and administration. It is the second largest custodian bank in the world.The company is ranked 247th on the Fortune 500 as of 2019. The company is on the list of the banks that are too big to fail published by the Financial Stability Board.The company is named after State Street in Boston, which was known as the \"Great Street to the Sea\" in the 18th century as Boston became a flourishing maritime capital. The company's logo includes a clipper to reflect the maritime industry in Boston during this time.\n\n", "Fidelity Investments Inc., commonly referred to as Fidelity, earlier as Fidelity Management & Research or FMR, is an American multinational financial services corporation based in Boston, Massachusetts.\nIt is one of the largest asset managers in the world with $2.46 trillion in assets under management as of March 2018 and a combined total customer asset value number of $6.7 trillion. Fidelity Investments operates a brokerage firm, manages a large family of mutual funds, provides fund distribution and investment advice, retirement services, Index funds, wealth management, cryptocurrency, securities execution and clearance, and life insurance.", "The Bank of America Corporation (simply referred to as Bank of America, often abbreviated as BofA) is an American multinational investment bank and financial services company headquartered in Charlotte, with central hubs in New York City, London, Hong Kong, Dallas, and Toronto. Founded in San Francisco, Bank of America was formed through NationsBank's acquisition of BankAmerica in 1998. It is the second largest banking institution in the United States, after JPMorgan Chase, and the ninth largest financial services company in the world (by revenue). As a part of the Big Four, it services approximately 10.73% of all American bank deposits, in direct competition with Citigroup, Wells Fargo, and JPMorgan Chase. Its primary financial services revolve around commercial banking, wealth management, and investment banking.\nOne branch of its history stretches back to Bank of Italy, founded by Amadeo Pietro Giannini in 1904, which provided Italian immigrants who faced service discrimination various banking options. Originally headquartered in San Francisco, California, Giannini acquired Banca d'America e d'Italia (Bank of America and Italy) in 1922. The passage of landmark federal banking legislation facilitated rapid growth in the 1950s, quickly establishing a prominent market share. After suffering a significant loss after the 1998 Russian bond default, BankAmerica, as it was then known, was acquired by the Charlotte-based NationsBank for US$62 billion. Following what was then the largest bank acquisition in history, the Bank of America Corporation was founded. Through a series of mergers and acquisitions, it built upon its commercial banking business by establishing Merrill Lynch for wealth management and Bank of America Merrill Lynch for investment banking in 2008 and 2009, respectively (since renamed BofA Securities).Both Bank of America and Merrill Lynch Wealth Management retain large market shares in their respective offerings. The investment bank is considered within the \"Bulge Bracket\" as the third largest investment bank in the world, as of 2018. Its wealth management side manages US$1.081 trillion in assets under management (AUM) as the second largest wealth manager in the world, after UBS. In commercial banking, Bank of America operates—but does not necessarily maintain retail branches—in all 50 states of the United States, the District of Columbia and more than 40 other countries. Its commercial banking footprint encapsulates 46 million consumer and small business relationships at 4,600 banking centers and 15,900 automated teller machines (ATMs).\nThe bank's large market share, business activities, and economic impact has led to numerous lawsuits and investigations regarding both mortgages and financial disclosures dating back to the 2008 financial crisis. Its corporate practices of servicing the middle class and wider banking community has yielded a substantial market share since the early 20th century. As of August 2018, Bank of America has a $313.5 billion market capitalization, making it the 13th largest company in the world. As the sixth largest American public company, it garnered $102.98 billion in sales as of June 2018. Bank of America was ranked #24 on the 2018 Fortune 500 rankings of the largest United States corporations by total revenue. Bank of America was named the \"World's Best Bank\" by the Euromoney Institutional Investor in their 2018 Awards for Excellence."], "NoShare(Trillion)": ["6.2", "7.43", "2.511", "2.46", "NO INFO"], "KeyPeople": ["Mortimer J. Buckley", "Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito", "Abigail Johnson", "CEO", "CEO", "Brian Moynihan", "Chairman", "Chief executive officer|CEO", "Anne Finucane", "Chairman|Co-Vice Chairman", "Chairman|Co-Vice Chairman"]}