{"Name": ["VANGUARD GROUP INC", "BLACKROCK INC.", "STATE STREET CORP", "PUNCH & ASSOCIATES INVESTMENT MANAGEMENT, INC.", "AMUNDI PIONEER ASSET MANAGEMENT INC"], "Description": ["The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "State Street Corporation is an American financial services and bank holding company headquartered at One Lincoln Street in Boston with operations worldwide. It is the second-oldest continually operating United States bank; its predecessor, Union Bank, was founded in 1792. State Street is ranked 15th on the list of largest banks in the United States by assets. It is one of the largest asset management companies in the world with US$2.511 trillion under management and US$31.62 trillion under custody and administration. It is the second largest custodian bank in the world.The company is ranked 247th on the Fortune 500 as of 2019. The company is on the list of the banks that are too big to fail published by the Financial Stability Board.The company is named after State Street in Boston, which was known as the \"Great Street to the Sea\" in the 18th century as Boston became a flourishing maritime capital. The company's logo includes a clipper to reflect the maritime industry in Boston during this time.", "NO INFO", "Amundi is a French asset management company. With 1,653 billion euros of assets under management (AUM) at the end of 2019, it is the largest asset manager in Europe and one of the 10 biggest investment managers by AUM in the world.Founded on 1 January 2010, the company is the result of the merger between the asset management activities of Crédit Agricole (Crédit Agricole Asset Management, CAAM) and Société Générale (Société Générale Asset Management, SGAM). Amundi Group has been listed on the Euronext stock exchange since November 2015. Its majority shareholder is Crédit Agricole S.A.\nIn legal terms, Amundi Group owns Amundi Asset Management, as well as several other subsidiaries in the asset management sector, notably CPR Asset Management (CPR AM) and BFT Investment Managers (BFT IM) in France. In 2016, Amundi Group announced the acquisition of Pioneer Investments, UniCredit's asset management subsidiary. The two entities merged in 2017.\nAmundi is involved in a range of investment management activities. The company is particularly engaged in active management, through a range of mutual funds (equity management, bond management, diversified management, structured products management and treasury management) as well as in passive management as an ETF issuer and index fund manager. The company also offers products in the real and alternative asset investment segments (real estate and private equity in particular). Its offering is aimed at retail investors and institutional investors, either in the form of collectivised investments or specific mandates. In France, Amundi is more widely known for its activities in the field of French employee savings schemes (épargne salariale). The company also has a research and analysis unit, which issues regular publications on global economic conditions and stock market developments.\nAmundi Group has offices in several countries around the world, including Europe, Asia and the United States, and is estimated to have around 100 million direct or indirect individual clients and 1,000 institutional customers worldwide."], "NoShare(Trillion)": ["6.2", "7.43", "2.511", "NO INFO", "NO INFO"], "KeyPeople": [["Mortimer J. Buckley"], ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], [], "NO INFO", []]}