{"Name": ["TRUIST FINANCIAL CORP", "SUNTRUST BANKS INC", "ADVISORS ASSET MANAGEMENT, INC.", "KEMPER CORP", "BRIDGEWAY CAPITAL MANAGEMENT INC"], "Description": ["Truist Financial Corporation is an American bank holding company headquartered in Charlotte, North Carolina. The company was formed in December 2019 as the result of the merger of BB&T (Branch Banking and Trust Company) and SunTrust Banks. Its bank operates 2,049 branches in 15 states and Washington, D.C., and offers consumer and commercial banking, securities brokerage, asset management, mortgage, and insurance products and services. It is on the list of largest banks in the United States by assets. Its subsidiary, McGriff Insurance Services (formerly known as BB&T Insurance Services), was one of the largest insurance brokers in the world. In its history, it has made 106 mergers and acquisitions. Since it took over Southern National Bank in 1995, it has made 43 deals.\n\n", "SunTrust Banks, Inc. is an American bank holding company with SunTrust Bank as its largest subsidiary and assets of US$199 billion as of March 31, 2018. The bank's most direct corporate parent was established in 1891 in Atlanta, where it was headquartered.   \nAs of September 2016, SunTrust Bank operated 1,400 bank branches and 2,160 ATMs across 11 southeastern states and Washington, D.C.. The bank's primary businesses included deposits, lending, credit cards, and trust and investment services. Through its various subsidiaries, the company provided corporate and investment banking, capital market services, mortgage banking, and wealth management — with  nearly 24,000 employees. In 2013, it was ordered to pay $1.5 billion \"to resolve claims of shoddy mortgage lending, servicing and foreclosure practices,\" and it reached a preliminary $968 Million settlement with the US government in 2014.In February 2019, SunTrust Banks announced its pending purchase by BB&T for $28 billion in an all-stock deal, creating the sixth largest U.S. lender, being the biggest bank deal since the 2007-2008 financial crisis. On December 6, 2019, the merger between BB&T and SunTrust closed, forming Truist Financial Corporation. The two banks continue to operate separately, while merging their operating systems.", "NO INFO", "Kemper Corporation is an insurance provider. With $12 billion in assets, the Kemper family of companies provides insurance for individuals, families and businesses.", "Bridgeway Capital Management Inc. (\"Bridgeway\") is a U.S. quantitative investment management firm that employs several multi-factor proprietary statistical models to assemble its investment portfolios. Bridgeway specializes in domestic equities, and is the adviser for Bridgeway Funds, the company's family of eleven no-load mutual funds. Bridgeway also provides sub-advisory and separate account services."], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": [["Kelly King", "Chairman", "CEO", "William H. Rogers Jr.", "President (corporate title)|President & COO", "CFO"], ["William H. Rogers Jr."], "NO INFO", [], "NO INFO"]}