{"ModuleTitle": "Company Description", "CompanyName": "Harmonic Inc.", "Symbol": "HLIT", "Address": "4300 NORTH FIRST STREET, SAN JOSE, California, 95134, United States of America", "Phone": "4084906242", "Industry": "Radio And Television Broadcasting And Communications Equipment", "Sector": "Technology", "Region": "North America", "CompanyDescription": "We are a leading global provider of (i) versatile and high performance video\r\ndelivery software, products, system solutions and services that enable our\r\ncustomers to efficiently create, prepare, store, playout and deliver a full\r\nrange of high-quality broadcast and \"over-the-top\" (OTT) video services to\r\nconsumer devices, including televisions, personal computers, laptops, tablets\r\nand smart phones and (ii) cable access solutions that enable cable operators to\r\nmore efficiently and effectively deploy high-speed internet, for data, voice and\r\nvideo services to consumers.\r\nWe operate in two segments, Video and Cable Access. Our Video business provides\r\nvideo processing and production and playout solutions and services worldwide to\r\ncable operators and satellite and telecommunications (telco) pay-TV service\r\nproviders, which we refer to collectively as \"service providers,\" and to\r\nbroadcast and media companies, including streaming media companies.&nbsp;&nbsp;... <a href=\"http://secfilings.nasdaq.com/edgar_conv_html%2f2020%2f03%2f02%2f0000851310-20-000006.html#FIS_BUSINESS\" target=\"_blank\">More</a> ...&nbsp;&nbsp;\r\n", "KeyExecutives": [{"name": "Jean-Marc Guiot", "title": "Senior VP-Operations & Information Technology"}, {"name": "Neven Haltmayer", "title": "Senior Vice President-R&D, Video Business"}, {"name": "Patrick J. Harshman", "title": "President, Chief Executive Officer & Director"}, {"name": "Sanjay Kalra", "title": "Chief Financial Officer & Senior Vice President"}, {"name": "Tim Warren", "title": "Chief Technology Officer-Video Business & SVP"}], "Number_of_employees": [], "Subsidiaries": ["NO INFO"]}