{"Name": ["JPMORGAN CHASE & CO", "B. RILEY WEALTH MANAGEMENT, INC.", "WEST FAMILY INVESTMENTS, INC.", "ADVISORS ASSET MANAGEMENT, INC.", "RESOURCE AMERICA, INC."], "Description": ["JPMorgan Chase & Co. is an American multinational investment bank and financial services holding company headquartered in New York City. JPMorgan Chase is ranked by S&P Global as the largest bank in the United States and the sixth largest bank in the world by total assets, with total assets of US$2.687 trillion. It is also the world's most valuable bank by market capitalization. JPMorgan Chase is incorporated in Delaware.As a \"Bulge Bracket\" bank, it is a major provider of various investment banking and financial services. It is one of America's Big Four banks, along with Bank of America, Citigroup, and Wells Fargo. JPMorgan Chase is considered to be a universal bank and a custodian bank. The J.P. Morgan brand, is used by the investment banking, asset management, private banking, private wealth management, and treasury services divisions. Fiduciary activity within private banking and private wealth management is done under the aegis of JPMorgan Chase Bank, N.A.—the actual trustee. The Chase brand is used for credit card services in the United States and Canada, the bank's retail banking activities in the United States, and commercial banking. Both the retail and commercial bank and the bank's corporate headquarters are currently located at 383 Madison Avenue in Midtown Manhattan, New York City, while the prior headquarters building directly across the street, 270 Park Avenue, is demolished and replaced with a new building. The current company was originally known as Chemical Bank, which acquired Chase Manhattan and assumed that company's name. The present company was formed in 2000, when Chase Manhattan Corporation merged with J.P. Morgan & Co.As of 2019, the asset management arm of the bank has US$2.988 trillion in assets under management, while its investment and corporate bank arm holds US$25.45 trillion in assets under custody. At US$45.0 billion in assets under management, the hedge fund unit of JPMorgan Chase is the third largest hedge fund in the world.", "NO INFO", "NO INFO", "NO INFO", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": [["Jamie Dimon", "Chairperson|Chairman", "Chief executive officer|CEO", "President (corporate title)|President", "Chief operating officer|COO", "President (corporate title)|President", "Chief operating officer|COO", "Jennifer Piepszak", "Chief financial officer|CFO"], "NO INFO", "NO INFO", "NO INFO", "NO INFO"]}