{"Name": ["FINE CAPITAL PARTNERS, L.P.", "BLACKROCK INC.", "AMERICAN INTERNATIONAL GROUP INC", "HONEYWELL INTERNATIONAL INC", "VANGUARD GROUP INC"], "Description": ["NO INFO", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "American International Group, Inc., also known as AIG, is an American multinational finance and insurance corporation with operations in more than 80 countries and jurisdictions. As of January 1, 2019, AIG companies employed 49,600 people. The company operates through three core businesses: General Insurance, Life & Retirement, and a standalone technology-enabled subsidiary. General Insurance includes Commercial, Personal Insurance, U.S. and International field operations. Life & Retirement includes Group Retirement, Individual Retirement, Life, and Institutional Markets.AIG's corporate headquarters are in New York City and the company also has offices around the world. AIG serves 87% of the Fortune Global 500 and 83% of the Forbes 2000. AIG was ranked 60th on the 2018 Fortune 500 list. According to the 2016 Forbes Global 2000 list, AIG is the 87th largest public company in the world. On December 31, 2017, AIG had $65.2 billion in shareholder equity.During the financial crisis of 2008, the Federal Reserve bailed the company out for $180 billion and assumed control, with the Financial Crisis Inquiry Commission correlating AIG's failure with the mass sales of unhedged insurance. In 2011 the nationalization of AIG was ruled illegal, and after regaining autonomy, AIG repaid $205 billion to the United States government in 2012.", "Honeywell International Inc. is a publicly traded, multinational conglomerate currently headquartered in Charlotte, North Carolina, United States. It primarily operates in 4 areas of business— aerospace and building technologies, performance materials & technologies (PMT), and safety & productivity solutions (SPS).\nHoneywell is a Fortune 100 company, and was ranked 77th in 2018. The company has a global workforce of approximately 110,000 workers with approximately 44,000 employed in the United States. The current chairman and chief executive officer (CEO) is Darius Adamczyk.The company's current name, Honeywell International Inc., is the product of a merger in which Honeywell Inc. was acquired by the much larger AlliedSignal in 1999. The company headquarters were consolidated with AlliedSignal's headquarters in Morristown, New Jersey; however the combined company chose the name \"Honeywell\" because of the cosiderable brand recognition. Honeywell was a component of the Dow Jones Industrial Average index from 1999 to 2008; and prior to 1999, its corporate predecessors were included dating back to 1925, including early entrants in the computing and thermostat industries.\n\n", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe."], "NoShare(Trillion)": ["NO INFO", "7.43", "NO INFO", "NO INFO", "6.2"], "KeyPeople": ["NO INFO", ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], ["Chairman|Chair", "Brian Duperreault", "President (corporate title)|Pres", "CEO", "Peter Zaffino", "President (corporate title)|Pres", "Chief operating officer|COO", "CFO", "Lucy Fato", "General counsel"], ["Darius Adamczyk", "chairman", "Chief executive officer|CEO"], ["Mortimer J. Buckley"]]}