{"Name": ["GRACE & WHITE INC /NY", "US BANCORP \\DE\\", "VANGUARD GROUP INC", "MILLENNIUM MANAGEMENT LLC", "TWO SIGMA SECURITIES, LLC"], "Description": ["Madame Bovary (; French: [madam bɔvaʁi]), originally published as Madame Bovary: Provincial Manners (French: Madame Bovary: Mœurs de province [madam bɔvaʁi mœʁ də pʁɔvɛ̃s]), is the debut novel of French writer Gustave Flaubert, published in 1856. The eponymous character lives beyond her means in order to escape the banalities and emptiness of provincial life.\nWhen the novel was first serialized in La Revue de Paris between 1 October 1856 and 15 December 1856, public prosecutors attacked the novel for obscenity.  The resulting trial in January 1857 made the story notorious. After Flaubert's acquittal on 7 February 1857, Madame Bovary became a bestseller in April 1857 when it was published in two volumes. A seminal work of literary realism, the novel is now considered Flaubert's masterpiece, and one of the most influential literary works in history. The British critic James Wood writes:  \"Flaubert established, for good or ill, what most readers think of as modern realist narration, and his influence is almost too familiar to be visible.\"", "U.S. Bancorp (stylized as us bancorp) is an American bank holding company based in Minneapolis, Minnesota, and incorporated in Delaware. It is the parent company of U.S. Bank National Association, and is on the list of largest banks in the United States. The company provides banking, investment, mortgage, trust, and payment services products to individuals, businesses, governmental entities, and other financial institutions. It has 3,106 branches and 4,842 ATMs, primarily in the Western and Midwestern United States. It is ranked 117th on the Fortune 500. The company also owns Elavon, a processor of credit card transactions for merchants and Elan Financial Services, a credit card issuer that issue credit card products to US Bank and other financial institutions.U.S. Bancorp operates under the second-oldest continuous national charter, originally Charter #24, granted in 1863 following the passage of the National Bank Act. Earlier charters have expired as banks were closed or acquired, raising U.S. Bank's charter number from #24 to #2. The oldest national charter, originally granted to the First National Bank of Philadelphia, is held by Wells Fargo, which it obtained upon its merger with Wachovia.\n\n", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "Millennium Management is an investment management firm with a multistrategy hedge fund offering. It is one of the world's largest alternative asset management firms with $39 billion assets under management. The firm operates in America, Europe and Asia.", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "NO INFO", "6.2", "NO INFO", "NO INFO"], "KeyPeople": ["NO INFO", ["Chairman#Public corporations|Chairman", "President (corporate title)|President", "CEO"], ["Mortimer J. Buckley"], ["General counsel|chief legal officer", "General counsel|chief legal officer"], "NO INFO"]}