{"Name": ["STRS OHIO", "STEPHENS INC /AR/", "OMERS ADMINISTRATION CORP", "FRONTIER INVESTMENT MGMT CO", "FORT WASHINGTON INVESTMENT ADVISORS INC /OH/"], "Description": ["NO INFO", "DeviantArt (formerly stylized as deviantART) is an American online community featuring artwork, videography, and photography. It was launched on August 7, 2000 by Angelo Sotira, Scott Jarkoff, Matthew Stephens, and others. Artworks are organized in a category structure, including photography, digital art, traditional art, literature, Flash, filmmaking, skins for applications, operating system customization utilities and others, along with downloadable resources such as tutorials and stock photography. Additional features include journals, polls, groups, and portfolios.\nDeviantArt, Inc. is headquartered in the Hollywood area of Los Angeles, California. Fella, a small, devil-esque robotic character,  was the official mascot of the website until 2014. DeviantArt had at least 36 million visitors annually by 2008. By 2010, DeviantArt users were submitting over 1.4 million favorites and 1.5 million comments daily. In 2011, it was the thirteenth largest social network with 3.8 million weekly visits. In 2017, the site had over 26 million members and 251 million submissions. On February 23, 2017, the company announced it was being acquired by Wix.com in a $36 million deal.", "The Ontario Municipal Employees Retirement System (OMERS) is a Canadian Province of Ontario Government  pension fund created by statute in 1962 to handle the retirement benefits of all local government employees in the province of Ontario in Eastern Canada Canadian province of Ontario.  It has become one of the largest institutional investors in Canada. As of December 2019, OMERS had 109 billion Canadian dollars in net investment assets.  OMERS serves 1,000 participating employers and almost half a million active, deferred and retired employees. OMERS members are employed by municipalities, school boards, transit systems, electrical utilities, emergency services and children's aid societies.", "NO INFO", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": ["NO INFO", "NO INFO", ["Chief Executive Officer"], "NO INFO", "NO INFO"]}