{"Name": ["VANGUARD GROUP INC", "BLACKROCK INC.", "GEODE CAPITAL MANAGEMENT, LLC", "BARCLAYS PLC", "HONKAMP KRUEGER FINANCIAL SERVICES, INC."], "Description": ["The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "NO INFO", "Barclays plc () is a British multinational investment bank and financial services company, headquartered in London, England. Apart from investment banking, Barclays is organised into four core businesses: personal banking, corporate banking, wealth management, and investment management.Barclays traces its origins to the goldsmith banking business established in the City of London in 1690. James Barclay became a partner in the business in 1736. In 1896, several banks in London and the English provinces, including Backhouse's Bank and Gurney's Bank, united as a joint-stock bank under the name Barclays and Co. Over the following decades, Barclays expanded to become a nationwide bank. In 1967, Barclays deployed the world's first cash dispenser. Barclays has made numerous corporate acquisitions, including of London, Provincial and South Western Bank in 1918, British Linen Bank in 1919, Mercantile Credit in 1975, the Woolwich in 2000 and the North American operations of Lehman Brothers in 2008.\nBarclays has a primary listing on the London Stock Exchange and is a constituent of the FTSE 100 Index. It has a secondary listing on the New York Stock Exchange.\nAccording to a 2011 paper by Vitali et al., Barclays was the most powerful transnational corporation in terms of ownership and thus corporate control over global financial stability and market competition, with Axa and State Street Corporation taking the 2nd and 3rd positions, respectively.\n\n", "NO INFO"], "NoShare(Trillion)": ["6.2", "7.43", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": [["Mortimer J. Buckley"], ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], "NO INFO", ["Jes Staley"], "NO INFO"]}