{"Name": ["FMR LLC", "MAVERICK CAPITAL LTD", "VANGUARD GROUP INC", "FPR PARTNERS LLC", "WELLINGTON MANAGEMENT GROUP LLP"], "Description": ["Fidelity Investments Inc., commonly referred to as Fidelity, earlier as Fidelity Management & Research or FMR, is an American multinational financial services corporation based in Boston, Massachusetts.\nIt is one of the largest asset managers in the world with $2.46 trillion in assets under management as of March 2018 and a combined total customer asset value number of $6.7 trillion. Fidelity Investments operates a brokerage firm, manages a large family of mutual funds, provides fund distribution and investment advice, retirement services, Index funds, wealth management, cryptocurrency, securities execution and clearance, and life insurance.", "Maverick Capital is a long/short equity hedge fund in Dallas, TX founded in 1993 by Lee Ainslie. In 1993, Lee Ainslie (who was just 28 at the time, and a Tiger Cub, or a protege under Julian Robertson at Tiger Management.) helped raise $38 million in capital by the family of Texas entrepreneur Sam Wyly. From 1995 to 2014, the fund returned a compounded return of 13% annually. As of February 2019, Maverick has $14.9 billion in assets under management and 129 employees.It primarily sticks with stocks (avoiding bonds, commodities, currencies, and options), holding both long and short positions and buying what it thinks will beat the market. It employs fundamental analysis and examines management closely. It examines companies for \"good capital-allocation decisions\", and especially how incremental returns on invested capital compare to the cost of capital. In 2006, Lee Ainslie mentioned \"It’s quite frustrating as a shareholder that companies are not using cash more productively for their shareholders, whether by buying back stock or by issuing dividends\". Lee Ainslie describes Maverick Capital as a traditional fund that puts greater premium on the value of its relationships with management teams than more \"interventionist\" hedge funds.It started to diversify into young companies in 2004 under its flagship equities hedge fund (under David Singer). On October 2014, Maverick announced that it would be hitting the startup scene by launching its first venture capital fund on January 1, 2015. Many of its investments involve healthcare and biotechnology.\nSome of its investments include OnLive, Zenefits, Science Exchange, and Apptimize. By the end of 2015, it carried over $6.9 billion in holdings.", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "NO INFO", "Wellington Management Company is a private, independent investment management firm with client assets under management totaling over US$1 trillion.\nThe firm serves as investment advisor to over 2,150 institutions in over 60 countries, as of 30 December 2017. Its clients include central banks and sovereign institutions, pension funds, endowments and foundations, family offices, fund sponsors, insurance companies, financial intermediaries, and wealth managers."], "NoShare(Trillion)": ["2.46", "NO INFO", "6.2", "NO INFO", "NO INFO"], "KeyPeople": [["Abigail Johnson", "CEO", "CEO"], "NO INFO", ["Mortimer J. Buckley"], "NO INFO", "NO INFO"]}