{"Name": ["MORGAN STANLEY", "SUMITOMO MITSUI TRUST HOLDINGS, INC.", "NIKKO ASSET MANAGEMENT AMERICAS, INC.", "BLACKROCK INC.", "ARK INVESTMENT MANAGEMENT LLC"], "Description": ["Morgan Stanley is an American multinational investment bank and financial services company headquartered at 1585 Broadway in the Morgan Stanley Building, Midtown Manhattan, New York City. With offices in more than 42 countries and more than 60,000 employees, the firm's clients include corporations, governments, institutions, and individuals. Morgan Stanley ranked No. 67 in the 2018 Fortune 500 list of the largest United States corporations by total revenue.The original Morgan Stanley, formed by J.P. Morgan & Co. partners Henry Sturgis Morgan (grandson of J.P. Morgan), Harold Stanley, and others, came into existence on September 16, 1935, in response to the Glass–Steagall Act that required the splitting of commercial and investment banking businesses. In its first year, the company operated with a 24% market share (US$1.1 billion) in public offerings and private placements.\nThe current Morgan Stanley is the result of merger of the original Morgan Stanley with Dean Witter Discover & Co. in 1997. Dean Witter's Chairman and CEO, Philip J. Purcell, became the Chairman and CEO of the newly merged \"Morgan Stanley Dean Witter Discover & Co.\"  The new firm changed its name back to \"Morgan Stanley\" in 2001. The main areas of business for the firm today are institutional securities, wealth management and investment management.\n\n", "Sumitomo Mitsui Trust Holdings, Inc. (三井住友トラスト・ホールディングス株式会社, Mitsui Sumitomo Torasuto Hōrudingusu Kabushiki Gaisha), formerly Chuo Mitsui Trust Holdings, Inc., is a Japanese financial holding company headquartered in Chiyoda, Tokyo. It provides an assortment of financial products to retail and wholesale customers, with a focus on asset management, financial brokerage and real estate services.Its main operating company is Sumitomo Mitsui Trust Bank, Limited (三井住友信託銀行株式会社, Mitsui Sumitomo Shintaku Ginkō Kabushiki Gaisha), which is the largest trust company and the fifth-largest bank in Japan measured by assets.\nThe company has no capital relationship with the Sumitomo Mitsui Financial Group; the two banking groups are similarly named because both are descended from the historical Sumitomo and Mitsui conglomerates.\nThere is just a weak control relationship between Sumitomo Mitsui Trust Holdings and Sumitomo Mitsui Financial Group. In fact SM Trust Holdings controls about 66% of Japan Trustee Services Bank. As of March 31, 2017, SM Financial Group's website reports that Japan Trustee Services Bank owned 5.50% of Sumitomo Mitsui Financial Group, but also 1.52% from trust location n. 1 (信託口1), 1.50% from trust location n. 2 (信託口2), 2.05% from location n. 5 (信託口5), 1.36% from trust location n. 7 (信託口7), and 1.85% from trust location n. 9 (信託口9) as well.", "NO INFO", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "NO INFO"], "NoShare(Trillion)": ["5.2", "NO INFO", "NO INFO", "7.43", "NO INFO"], "KeyPeople": [["James P. Gorman", "Chairman", "Chief executive officer|CEO", "Thomas R. Nides|Thomas Nides", "Chief financial officer|CFO"], ["President (corporate title)|President"], "NO INFO", ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], "NO INFO"]}