{"Name": ["KAYNE ANDERSON RUDNICK INVESTMENT MANAGEMENT LLC", "MAIRS & POWER INC", "BLACKROCK INC.", "VANGUARD GROUP INC", "RENAISSANCE TECHNOLOGIES LLC"], "Description": ["NO INFO", "NO INFO", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "Renaissance Technologies LLC, also known as RenTech or RenTec, is an American hedge fund based in East Setauket, New York, on Long Island, which specializes in systematic trading using quantitative models derived from mathematical and statistical analyses. The firm is regarded as one of the \"most secretive and successful\" hedge funds in the world. Their signature Medallion fund is famed for the best record in investing history. Renaissance was founded in 1982 by James Simons, an award-winning mathematician and former Cold War code breaker.\nIn 1988, the firm established its most profitable portfolio, the Medallion Fund, which used an improved and expanded form of Leonard Baum's mathematical models, improved by algebraist James Ax, to explore correlations from which they could profit. Jim Berlekamp was instrumental in evolving trading to shorter-dated, pure systems driven decision-making. The hedge fund was named Medallion in honor of the math awards that Simons and Ax had won.Renaissance's flagship Medallion fund, which is run mostly for fund employees, is famed for the best track record on Wall Street, returning more than 66 percent annualized before fees and 39 percent after fees over a 30-year span from 1988 to 2018. Renaissance offers two portfolios to outside investors—Renaissance Institutional Equities Fund (RIEF) and Renaissance Institutional Diversified Alpha (RIDA).Simons ran Renaissance until his retirement in late 2009. The company is now run by Peter Brown (after Robert Mercer resigned). Both of them were computer scientists specializing in computational linguistics who joined Renaissance in 1993 from IBM Research. Simons continues to play a role at the firm as non-executive chairman and remains invested in its funds, particularly the secretive and consistently profitable black-box strategy known as Medallion. Because of the success of Renaissance in general and Medallion in particular, Simons has been described as the best money manager on earth."], "NoShare(Trillion)": ["NO INFO", "NO INFO", "7.43", "6.2", "NO INFO"], "KeyPeople": ["NO INFO", "NO INFO", ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], ["Mortimer J. Buckley"], []]}