{"Name": ["HILLHOUSE CAPITAL ADVISORS, LTD.", "STONE POINT CAPITAL LLC", "CANADA PENSION PLAN INVESTMENT BOARD", "HILLHOUSE CAPITAL MANAGEMENT, LTD.", "VANGUARD GROUP INC"], "Description": ["NO INFO", "NO INFO", "The Canada Pension Plan Investment Board (CPPIB; French: Office d'investissement du régime de pensions du Canada), operating as CPP Investments (French: RPC Investissements), is a Canadian Crown corporation established by way of the 1997 Canada Pension Plan Investment Board Act to oversee and invest the funds contributed to and held by the Canada Pension Plan (CPP).\nCPP Investments is one of the world's largest investors in private equity, having invested over US$28.1 billion between 2010 and 2014 alone. Despite being a Crown corporation, CPPIB is not considered a sovereign wealth fund because it operates at arms-length from the Government of Canada and solely manages CPP contributions paid by workers and employers, not public funds.As of March 31, 2020, the CPP Investment Board manages over C$409 billion in investment assets for the Canada Pension Plan on behalf of 20 million Canadians.", "Hillhouse Capital Group (“Hillhouse”) is a global East and Southeast Asia-focused private equity firm. It was founded by Lei Zhang in 2005 with US$20 million in seed capital from the Yale Endowment. Hillhouse has offices in Beijing, Hong Kong and Singapore.Hillhouse manages over US$50 billion as of October 2018, and is known for its avoidance of publicity. Hillhouse manages capital for institutional clients such as university endowments, foundations, sovereign wealth funds, pension funds and family offices. Hillhouse is a long-term fundamental research-driven equity investor, investing in all equity stages in sectors including consumer, healthcare, financials and services.", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe."], "NoShare(Trillion)": ["NO INFO", "NO INFO", "409.6", "NO INFO", "6.2"], "KeyPeople": ["NO INFO", "NO INFO", ["Heather Munroe-Blum", "Chairperson", "Mark Machin", "President (corporate title)|President", "Chief executive officer|CEO"], "NO INFO", ["Mortimer J. Buckley"]]}