{"Name": ["VANGUARD GROUP INC", "BLACKROCK INC.", "WATER ASSET MANAGEMENT LLC", "ODEY ASSET MANAGEMENT GROUP LTD", "KBC GROUP NV"], "Description": ["The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "NO INFO", "NO INFO", "KBC Group N.V. is a Belgian universal multi-channel bank-insurer, focusing on private clients and small and medium-sized enterprises in Belgium, Ireland, Central Europe and South-East Asia. Besides retail banking, insurance and asset management activities (in collaboration with daughter companies KBC Insurance NV and KBC Asset Management NV), KBC is active in, among other things, European debt capital markets, domestic cash equity markets and in the field of corporate banking, private banking, leasing, factoring, reinsurance, private equity and project and trade finance in Belgium, Central and Eastern Europe and elsewhere (mainly in Europe). KBC is an acronym for Kredietbank ABB Insurance CERA Bank (CEntrale RAiffeisenkas).\nThe parent company, KBC Group N.V., is one of the major companies and the second largest bancassurer in Belgium. It is the 18th largest bank in Europe by market capitalisation and a major financial player in Central and Eastern Europe, employing some 42,000 staff worldwide (of which more than half in Central and Eastern Europe) and serves 11 million customers worldwide (some 7 to 8 million in Central and Eastern Europe).\nThe group is controlled by a syndicate of core shareholders, and has a free float of approximately 60%. In the core shareholders, KBC Ancora controls 19%, MRBB (part of the Flemish farmers' association) controls around 11%, CERA (the largest cooperative in Wallonia) 3% and a group of industrialist families controls another 7%. The free float was chiefly held by a large variety of international institutional investors as of mid 2018. Its shares are traded on the Euronext exchange in Brussels.\nThe group's overall ambition is to be the reference in bank-insurance in all its core markets.\nThe private art collection of KBC bank is situated in the Rockox House in Antwerp.\n\n"], "NoShare(Trillion)": ["6.2", "7.43", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": [["Mortimer J. Buckley"], ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], "NO INFO", "NO INFO", ["Chairman", "chief executive officer|CEO", "Chief financial officer|CFO"]]}