{"ModuleTitle": "Company Description", "CompanyName": "Renewable Energy Group, Inc.", "Symbol": "REGI", "Address": "406 FIRST STREET PO BOX 128, RALSTON, Iowa, 51459, United States of America", "Phone": "712-667-3500", "Industry": "Major Chemicals", "Sector": "Basic Industries", "Region": "North America", "CompanyDescription": "We focus on providing cleaner, lower carbon intensity products and services. We are North America's largest producer of advanced biofuels. We utilize a nationwide production, distribution and logistics system as part of an integrated value chain model designed to convert natural fats, oils and greases into advanced biofuels. During 2016 , we sold 567  million gallons and had revenues of $2.0 billion . We are also engaged in research and development efforts focused on the conversion of diverse feedstocks into renewable chemicals.\n\nWe own and operate a network of 14 biorefineries. Twelve biorefineries are located in the United States and two in Germany, and 13 of which produce biodiesel or renewable hydrocarbon diesel and have an aggregate nameplate production capacity of 502 million gallons per year, or mmgy. We also operate one microbial fermentation facility in connection with our development of renewable chemicals and one feedstock processing facility. We believe our fully integrated approach, which includes acquiring feedstock, managing biorefinery facility construction and upgrades, operating biorefineries, and distributing through a network of terminals, positions us to serve the market for biomass-based diesel and other advanced biofuels along with other products and services.\n\nWe are a lower-cost biomass-based diesel producer. We primarily produce our biomass-based diesel from a wide variety of lower cost feedstocks, including inedible corn oil, used cooking oil and in", "KeyExecutives": [{"name": "Chad Stone", "title": "Chief Financial Officer"}, {"name": "Cynthia J. Warner", "title": "President, Chief Executive Officer & Director"}], "Number_of_employees": [], "Subsidiaries": ["NO INFO"]}