{"Name": ["CAPITAL RESEARCH GLOBAL INVESTORS", "BLACKROCK INC.", "VANGUARD GROUP INC", "CLEARBRIDGE INVESTMENTS, LLC", "PRIMECAP MANAGEMENT CO/CA/"], "Description": ["NO INFO", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "NO INFO", "Adobe Inc. ( ə-DOH-bee), known until October 3, 2018 as Adobe Systems Incorporated, is an American multinational computer software company headquartered in San Jose, California, and incorporated in Delaware. It has historically focused upon the creation of multimedia and creativity software products, with a more recent foray towards digital marketing software. Adobe is best known for its Adobe Flash web software ecosystem, Photoshop image editing software, Adobe Illustrator vector graphics editor, Acrobat Reader, the Portable Document Format (PDF), and Adobe Creative Suite, as well as its successor Adobe Creative Cloud.Adobe was founded in December 1982 by John Warnock and Charles Geschke, who established the company after leaving Xerox PARC in order to develop and sell the PostScript page description language. In 1985, Apple Computer licensed PostScript for use in its LaserWriter printers, which helped spark the desktop publishing revolution.As of 2019, Adobe has more than 21,000 employees worldwide, about 40% of whom work in San Jose. Adobe also has major development operations in the United States in Newton, New York City, Minneapolis, Lehi, Seattle, and San Francisco. It also has major development operations in Noida and Bangalore in India."], "NoShare(Trillion)": ["NO INFO", "7.43", "6.2", "NO INFO", "NO INFO"], "KeyPeople": ["NO INFO", ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], ["Mortimer J. Buckley"], "NO INFO", ["Shantanu Narayen", "Chairman", "Chief executive officer|CEO", "Chief financial officer|CFO", "Chief technology officer|CTO"]]}