{"Name": ["RENAISSANCE TECHNOLOGIES LLC", "FMR LLC", "BLACKROCK INC.", "ROYAL BANK OF CANADA", "SANDERS MORRIS HARRIS LLC"], "Description": ["Renaissance Technologies LLC, also known as RenTech or RenTec, is an American hedge fund based in East Setauket, New York, on Long Island, which specializes in systematic trading using quantitative models derived from mathematical and statistical analyses. The firm is regarded as one of the \"most secretive and successful\" hedge funds in the world. Their signature Medallion fund is famed for the best record in investing history. Renaissance was founded in 1982 by James Simons, an award-winning mathematician and former Cold War code breaker.\nIn 1988, the firm established its most profitable portfolio, the Medallion Fund, which used an improved and expanded form of Leonard Baum's mathematical models, improved by algebraist James Ax, to explore correlations from which they could profit. Jim Berlekamp was instrumental in evolving trading to shorter-dated, pure systems driven decision-making. The hedge fund was named Medallion in honor of the math awards that Simons and Ax had won.Renaissance's flagship Medallion fund, which is run mostly for fund employees, is famed for the best track record on Wall Street, returning more than 66 percent annualized before fees and 39 percent after fees over a 30-year span from 1988 to 2018. Renaissance offers two portfolios to outside investors—Renaissance Institutional Equities Fund (RIEF) and Renaissance Institutional Diversified Alpha (RIDA).Simons ran Renaissance until his retirement in late 2009. The company is now run by Peter Brown (after Robert Mercer resigned). Both of them were computer scientists specializing in computational linguistics who joined Renaissance in 1993 from IBM Research. Simons continues to play a role at the firm as non-executive chairman and remains invested in its funds, particularly the secretive and consistently profitable black-box strategy known as Medallion. Because of the success of Renaissance in general and Medallion in particular, Simons has been described as the best money manager on earth.", "Fidelity Investments Inc., commonly referred to as Fidelity, earlier as Fidelity Management & Research or FMR, is an American multinational financial services corporation based in Boston, Massachusetts.\nIt is one of the largest asset managers in the world with $2.46 trillion in assets under management as of March 2018 and a combined total customer asset value number of $6.7 trillion. Fidelity Investments operates a brokerage firm, manages a large family of mutual funds, provides fund distribution and investment advice, retirement services, Index funds, wealth management, cryptocurrency, securities execution and clearance, and life insurance.", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "The Royal Bank of Canada (RBC; French: Banque royale du Canada) is a Canadian multinational financial services company and the  largest bank in Canada by market capitalization. The bank serves over 16 million clients and has 86,000+ employees worldwide. The bank was founded in 1864 in Halifax, Nova Scotia, although its corporate headquarters is located in Toronto, Ontario, and its legal head office in Montreal, Quebec. RBC's institution number (or bank number) is 003. In November 2017, RBC was added to the Financial Stability Board's list of global systemically important banks.\nIn Canada, the bank's personal and commercial banking operations are branded as RBC Royal Bank in English and RBC Banque Royale in French and serves approximately ten million clients through its network of 1,209 branches. RBC Bank is the U.S. banking subsidiary which formerly operated 439 branches across six states in the Southeastern United States, but now only offers cross-border banking services to Canadian travellers and expats. RBC also has 127 branches across seventeen countries in the Caribbean, which serve more than 16 million clients. RBC Capital Markets is RBC's worldwide investment and corporate banking subsidiary, while the investment brokerage firm is known as RBC Dominion Securities. Investment banking services are also provided through RBC Bank and the focus is on middle market clients.\nIn 2011, RBC was the largest Canadian company by revenue and market capitalization. and was ranked at No. 50 in the 2013 Forbes Global 2000 listing, The company has operations in Canada, and 40 other countries and had US$673.2 billion of assets under management in 2014.", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "2.46", "7.43", "NO INFO", "NO INFO"], "KeyPeople": [[], ["Abigail Johnson", "CEO", "CEO"], ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], ["David I. McKay"], "NO INFO"]}