{"Name": ["VANGUARD GROUP INC", "BLACKROCK INC.", "JPMORGAN CHASE & CO", "MASSACHUSETTS FINANCIAL SERVICES CO /MA/", "STATE STREET CORP"], "Description": ["The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.\n\n", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.\n\n", "JPMorgan Chase & Co. is an American multinational investment bank and financial services holding company headquartered in New York City. JPMorgan Chase is ranked by S&P Global as the largest bank in the United States and the sixth largest bank in the world by total assets, with total assets of US$2.687 trillion. It is also the world's most valuable bank by market capitalization. JPMorgan Chase is incorporated in Delaware.As a \"Bulge Bracket\" bank, it is a major provider of various investment banking and financial services. It is one of America's Big Four banks, along with Bank of America, Citigroup, and Wells Fargo. JPMorgan Chase is considered to be a universal bank and a custodian bank. The J.P. Morgan brand, is used by the investment banking, asset management, private banking, private wealth management, and treasury services divisions. Fiduciary activity within private banking and private wealth management is done under the aegis of JPMorgan Chase Bank, N.A.—the actual trustee. The Chase brand is used for credit card services in the United States and Canada, the bank's retail banking activities in the United States, and commercial banking. Both the retail and commercial bank and the bank's corporate headquarters are currently located at 383 Madison Avenue in Midtown Manhattan, New York City, while the prior headquarters building directly across the street, 270 Park Avenue, is demolished and replaced with a new building. The current company was originally known as Chemical Bank, which acquired Chase Manhattan and assumed that company's name. The present company was formed in 2000, when Chase Manhattan Corporation merged with J.P. Morgan & Co.As of 2019, the asset management arm of the bank has US$2.988 trillion in assets under management, while its investment and corporate bank arm holds US$25.45 trillion in assets under custody. At US$45.0 billion in assets under management, the hedge fund unit of JPMorgan Chase is the third largest hedge fund in the world.", "NO INFO", "State Street Corporation is an American financial services and bank holding company headquartered at One Lincoln Street in Boston with operations worldwide. It is the second-oldest continually operating United States bank; its predecessor, Union Bank, was founded in 1792. State Street is ranked 15th on the list of largest banks in the United States by assets. It is one of the largest asset management companies in the world with US$2.511 trillion under management and US$31.62 trillion under custody and administration. It is the second largest custodian bank in the world.The company is ranked 247th on the Fortune 500 as of 2019. The company is on the list of the banks that are too big to fail published by the Financial Stability Board.The company is named after State Street in Boston, which was known as the \"Great Street to the Sea\" in the 18th century as Boston became a flourishing maritime capital. The company's logo includes a clipper to reflect the maritime industry in Boston during this time."], "NoShare(Trillion)": ["6.2", "7.43", "NO INFO", "NO INFO", "2.511"], "KeyPeople": [["Mortimer J. Buckley"], ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], ["Jamie Dimon", "Chairperson|Chairman", "Chief executive officer|CEO", "President (corporate title)|President", "Chief operating officer|COO", "President (corporate title)|President", "Chief operating officer|COO", "Jennifer Piepszak", "Chief financial officer|CFO"], "NO INFO", []]}