{"Name": ["BLACKROCK INC.", "VANGUARD GROUP INC", "PRICE T ROWE ASSOCIATES INC /MD/", "NEUBERGER BERMAN GROUP LLC", "FRANKLIN RESOURCES INC"], "Description": ["BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "NO INFO", "Neuberger Berman Group LLC is a private, independent, employee-owned investment management firm. The firm manages equities, fixed income, private equity and hedge fund portfolios for global institutional investors, advisors and high-net-worth individuals.  In 2016, it was rated the #1 Best Place to Work in asset management amongst firms with greater than 1,000 employees.", "Franklin Resources Inc. is an American multinational holding company that, together with its subsidiaries, is referred to as Franklin Templeton; it is a global investment firm founded in New York City in 1947 as Franklin Distributors, Inc. It is listed on the New York Stock Exchange under the ticker symbol BEN, in honor of Benjamin Franklin, for whom the company is named, and who was admired by founder Rupert Johnson, Sr. In 1973 the company's headquarters moved from New York to San Mateo, California. As of December 31, 2019 Franklin Templeton held US$698 billion in assets under management (AUM) on behalf of private, professional and institutional investors."], "NoShare(Trillion)": ["7.43", "6.2", "NO INFO", "3.9", "NO INFO"], "KeyPeople": [["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], ["Mortimer J. Buckley"], "NO INFO", ["George Herbert Walker IV|George H. Walker"], ["Gregory E. Johnson", "Rupert Johnson, Jr.|Rupert H. Johnson Jr."]]}