{"Name": ["FJ CAPITAL MANAGEMENT LLC", "VANGUARD GROUP INC", "ALLIANCEBERNSTEIN L.P.", "LYNCH & ASSOCIATES/IN", "EJF CAPITAL LLC"], "Description": ["NO INFO", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "AllianceBernstein Holding L.P. (AB) is a global asset management firm providing investment management and research services worldwide to institutional, high-net-worth and retail investors.\nAllianceBernstein's headquarters are located in Nashville, Tennessee, in the United States, as well as having locations throughout the world. It has approximately US$581 billion in assets under management as of June 30, 2019. It is 64 percent owned by Equitable Holdings.", "Mallory Jones Lynch Flynn & Associates (MJLF & Associates or MJLF) is an international ship brokerage and advisory firm with primary offices\nlocated in Stamford, Connecticut, United States, and a second office located in Athens, Greece. Formally founded in 1979 in New York City, the MJLF maritime tradition dates back\nto the early 19th century by way of Charles Mallory, a named partner and founder of the firm. The\nMallory's of Mystic, Connecticut began as sail makers in 1819 and by 1945 had developed\ninto America's largest ship owner.\nAs a ship brokerage firm, MJLF functions as an intermediary between clients who need shipping\nservices and suppliers who provide them. The firm executes vessel chartering, as well as\nconcluding sales and purchase transactions.", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "6.2", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": ["NO INFO", ["Mortimer J. Buckley"], ["Jim Gingrich"], [], "NO INFO"]}