{"Name": ["RENAISSANCE TECHNOLOGIES LLC", "MEASURED WEALTH PRIVATE CLIENT GROUP, LLC", "BANCO BILBAO VIZCAYA ARGENTARIA, S.A.", "WELLS FARGO & COMPANY/MN", "SUSQUEHANNA INTERNATIONAL GROUP, LLP"], "Description": ["Renaissance Technologies LLC, also known as RenTech or RenTec, is an American hedge fund based in East Setauket, New York, on Long Island, which specializes in systematic trading using quantitative models derived from mathematical and statistical analyses. The firm is regarded as one of the \"most secretive and successful\" hedge funds in the world. Their signature Medallion fund is famed for the best record in investing history. Renaissance was founded in 1982 by James Simons, an award-winning mathematician and former Cold War code breaker.\nIn 1988, the firm established its most profitable portfolio, the Medallion Fund, which used an improved and expanded form of Leonard Baum's mathematical models, improved by algebraist James Ax, to explore correlations from which they could profit. Jim Berlekamp was instrumental in evolving trading to shorter-dated, pure systems driven decision-making. The hedge fund was named Medallion in honor of the math awards that Simons and Ax had won.Renaissance's flagship Medallion fund, which is run mostly for fund employees, is famed for the best track record on Wall Street, returning more than 66 percent annualized before fees and 39 percent after fees over a 30-year span from 1988 to 2018. Renaissance offers two portfolios to outside investors—Renaissance Institutional Equities Fund (RIEF) and Renaissance Institutional Diversified Alpha (RIDA).Simons ran Renaissance until his retirement in late 2009. The company is now run by Peter Brown (after Robert Mercer resigned). Both of them were computer scientists specializing in computational linguistics who joined Renaissance in 1993 from IBM Research. Simons continues to play a role at the firm as non-executive chairman and remains invested in its funds, particularly the secretive and consistently profitable black-box strategy known as Medallion. Because of the success of Renaissance in general and Medallion in particular, Simons has been described as the best money manager on earth.", "NO INFO", "Banco Bilbao Vizcaya Argentaria, S.A. (Spanish pronunciation: [ˈbaŋko βilˈβao βiθˈkaʝa aɾxenˈtaɾja]), better known by its initialism BBVA, is a Spanish multinational financial services company based in Madrid and Bilbao, Spain. It is one of the largest financial institutions in the world, and is present mainly in Spain, South America, North America, Turkey and Romania.The bank was founded as Banco de Bilbao, on May 28, 1857, in Bilbao. BBVA's operational headquarters are located in Madrid, in the \"Ciudad BBVA\" complex. It is Spain's second largest bank after Banco Santander. It is listed on the Madrid Stock Exchange and is part of the IBEX 35 as well as the Dow Jones EURO STOXX 50.As of December 31, 2018, BBVA's assets amounted to 676,689 million euros, making it the second Spanish financial institution by volume of assets. In that same date, it had 7,963 offices, 125,627 employees and 74.5 million customers, and was present in more than 30 countries. At April 2, 2018, it was ranked the 42nd largest bank in the world by total assets.", "Wells Fargo & Company is an American multinational financial services company headquartered in San Francisco, California, with central offices throughout the United States. It is the world's fourth-largest bank by market capitalization and the fourth largest bank in the US by total assets. Wells Fargo is ranked number 26 on the 2018 Fortune 500 rankings of the largest US corporations by total revenue. In July 2015, Wells Fargo became the world's largest bank by market capitalization, edging past ICBC, before slipping behind JPMorgan Chase in September 2016, in the wake of a scandal involving the creation of over 2 million fake bank accounts  and illegal manipulation of other accounts by Wells Fargo employees. Wells Fargo fell behind Bank of America to third by bank deposits in 2017 and behind Citigroup to fourth by total assets in 2018. Wells Fargo is incorporated in Delaware.The firm's primary operating subsidiary is national bank Wells Fargo Bank, N.A., which designates its main office as Sioux Falls, South Dakota. Wells Fargo in its present form is a result of a merger between San Francisco–based Wells Fargo & Company and Minneapolis-based Norwest Corporation in 1998 and the subsequent 2008 acquisition of Charlotte-based Wachovia. Following the mergers, the company transferred its headquarters to Wells Fargo's headquarters in San Francisco and merged its operating subsidiary with Wells Fargo's operating subsidiary in Sioux Falls. Along with JPMorgan Chase, Bank of America, and Citigroup, Wells Fargo is one of the \"Big Four Banks\" of the United States. As of June 2018, it had 8,050 branches and 13,000 ATMs. In 2018 the company had operations in 35 countries with over 70 million customers globally.In February 2014, Wells Fargo was named the world's most valuable bank brand for the second consecutive year in The Banker and Brand Finance study of the top 500 banking brands. In 2016, Wells Fargo ranked 7th on the Forbes Global 2000 list of largest public companies in the world and ranked 27th on the Fortune 500 list of the largest companies in the US. In 2015, the company was ranked the 22nd most admired company in the world, and the 7th most respected company in the world. As of December 2018, the company had a Standard & Poors credit rating of A−. However, for a brief period in 2007, the company was the only AAA-rated bank, reflecting the highest credit rating from two firms.On February 2, 2018, the US Federal Reserve Bank barred Wells Fargo from growing its nearly US$2 trillion-asset base any further, based upon years of misconduct, until Wells Fargo fixes its internal problems to the satisfaction of the Federal Reserve. In April 2018, The Wall Street Journal reported that the US Department of Labor had launched a probe into whether Wells Fargo was pushing its customers into more expensive retirement plans as well as into retirement funds managed by Wells Fargo itself. Subsequently in May 2018, The Wall Street Journal reported that Wells Fargo's business banking group had improperly altered documents about business clients in 2017 and early 2018. In June 2018, Wells Fargo began retreating from retail banking in the Midwestern United States by announcing the sale of all its physical bank branch locations in Indiana, Michigan, and Ohio to Flagstar Bank.", "Susquehanna International Group, LLP (SIG) is a privately held, global trading and technology firm. SIG comprises a number of affiliated entities specializing in trading and proprietary investments in equities, fixed income, energy, commodity, index and derivative products, private equity and venture capital, research, customer trading and institutional sales. Susquehanna is probably best known for expertise in derivatives pricing and trading, especially equity options.\n\nSIG is a specialist or DPM (designated primary market maker) in approximately 600 equity options and 45 index options on the CBOE, AMEX, PHLX, and ISE, including big name equities such as Google, Goldman Sachs, JPMorgan Chase, GE, PepsiCo, and Microsoft and indices such as Nasdaq and Russell 2000 options.SIG's headquarters office is in Bala Cynwyd, a western suburb of Philadelphia, Pennsylvania, US, and its European headquarters are in the IFSC, Dublin, Ireland. The firm employs more than 1,900 people in offices across North America (New York City, Chicago, San Francisco, Philadelphia, Boston, Stamford), Australia (Sydney), Europe (Dublin, London) and Asia (Shanghai, Beijing, Hong Kong, Tokyo). SIG is one of the largest employers in Lower Merion Township and was listed as one of Philadelphia Magazine's \"Coolest Companies\" in 2015.\n\n"], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": [[], "NO INFO", ["Carlos Torres Vila (banker)|Carlos Torres Vila", "Onur Genç"], ["Elizabeth Ashburn Duke|Elizabeth Duke", "Chairman|Chair", "Charles Scharf", "President (corporate title)|President", "CEO", "CFO", "C. Allen Parker", "General counsel"], "NO INFO"]}