{"Name": ["SUNTRUST BANKS INC", "TRUIST FINANCIAL CORP", "WEDBUSH SECURITIES INC", "VANGUARD GROUP INC", "DIMENSIONAL FUND ADVISORS LP"], "Description": ["SunTrust Banks, Inc. is an American bank holding company with SunTrust Bank as its largest subsidiary and assets of US$199 billion as of March 31, 2018. The bank's most direct corporate parent was established in 1891 in Atlanta, where it was headquartered.   \nAs of September 2016, SunTrust Bank operated 1,400 bank branches and 2,160 ATMs across 11 southeastern states and Washington, D.C.. The bank's primary businesses included deposits, lending, credit cards, and trust and investment services. Through its various subsidiaries, the company provided corporate and investment banking, capital market services, mortgage banking, and wealth management — with  nearly 24,000 employees. In 2013, it was ordered to pay $1.5 billion \"to resolve claims of shoddy mortgage lending, servicing and foreclosure practices,\" and it reached a preliminary $968 Million settlement with the US government in 2014.In February 2019, SunTrust Banks announced its pending purchase by BB&T for $28 billion in an all-stock deal, creating the sixth largest U.S. lender, being the biggest bank deal since the 2007-2008 financial crisis. On December 6, 2019, the merger between BB&T and SunTrust closed, forming Truist Financial Corporation. The two banks continue to operate separately, while merging their operating systems.", "Truist Financial Corporation is an American bank holding company headquartered in Charlotte, North Carolina. The company was formed in December 2019 as the result of the merger of BB&T (Branch Banking and Trust Company) and SunTrust Banks. Its bank operates 2,049 branches in 15 states and Washington, D.C., and offers consumer and commercial banking, securities brokerage, asset management, mortgage, and insurance products and services. It is on the list of largest banks in the United States by assets. Its subsidiary, McGriff Insurance Services (formerly known as BB&T Insurance Services), was one of the largest insurance brokers in the world. In its history, it has made 106 mergers and acquisitions. Since it took over Southern National Bank in 1995, it has made 43 deals.\n\n", "Wedbush Securities Inc. is a privately held financial services and investment firm. based in Los Angeles. Gary Wedbush was appointed as Co-President in May 2018. The founder, Edward Wedbush, served as President for 63 years.", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "Dimensional Fund Advisors L.P. (abbreviated as Dimensional, DFA) is a private investment firm headquartered in Austin, Texas, United States. The company has affiliates within 13 offices in the US, Canada, UK, Germany, Netherlands, Australia, Singapore, and Japan. DFA was founded in 1981 by David G. Booth and Rex Sinquefield, both graduates of the School of Business (now known as the Booth School of Business), and Larry G Klotz. The company’s investment philosophy is rooted in the efficient market hypothesis and thus they were one of the earliest investing firms to emphasize index funds. [1]  The company offers over 100 equity and fixed income mutual funds.\nDimensional has $609 billion (USD) in firmwide assets under management as of December 31, 2019. Institutional investors can access Dimensional funds directly or through their consultant. Individual investors can access Dimensional funds through financial professionals, or through their retirement plans (both 401k and defined benefit), or certain 529 college savings plans. The company is owned by its employees, board members and outside investors, which as of 2005 was reported to include Governor Arnold Schwarzenegger of California. On November 6, 2008, the University of Chicago Graduate School of Business announced a $300 million gift from David Booth in the form of cash and the income stream from Dimensional stock.  The school was renamed the University of Chicago Booth School of Business.On December 2, 2009, Dimensional announced the acquisition of SmartNest, a retirement planning computer software company. The technology offered by SmartNest was developed by Robert C. Merton, who left the company's board after the purchase to become Resident Scientist.While having its headquarters in Austin, Texas, DFA opened its East Coast headquarters in Charlotte, North Carolina in 2019. Dimensional Charlotte was designed to serve the needs of clients and the advisors who work with the firm. The building includes expansive training and meeting spaces and will host many of the firm’s signature conferences and events.  DFA currently operates in Austin (TX), Charlotte (NC), Santa Monica (CA), Toronto (Canada), Vancouver (Canada), London (UK), Amsterdam (Netherlands), Berlin (Germany), Tokyo (Japan), Hong Kong (Hong Kong), Singapore (Singapore), Sydney (Australia), Melbourne (Australia)."], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "6.2", "6.9"], "KeyPeople": [["William H. Rogers Jr."], ["Kelly King", "Chairman", "CEO", "William H. Rogers Jr.", "President (corporate title)|President & COO", "CFO"], [], ["Mortimer J. Buckley"], ["David G. Booth"]]}