{"Name": ["DEUTSCHE BANK AG\\", "OBERWEIS ASSET MANAGEMENT INC/", "PHOENIX HOLDINGS LTD.", "ACADIAN ASSET MANAGEMENT LLC", "GLOBAL ALPHA CAPITAL MANAGEMENT LTD."], "Description": ["Deutsche Bank AG (German pronunciation: [ˈdɔʏ̯tʃə ˈbaŋk ʔaːˈɡeː] (listen)) is a multinational investment bank  and financial services company headquartered in Frankfurt, Germany, and dual-listed in New York Stock Exchange and Frankfurt Stock Exchange.\nThe bank's network spans 58 countries with a large presence in Europe, the Americas and Asia. As of 2017–2018, Deutsche Bank was the 17th largest bank in the world by total assets. As the largest German banking institution, it is a component of the DAX stock market index.\nThe company is a universal bank with three major divisions: the Private & Commercial Bank, the Corporate & Investment Bank (CIB), and Asset Management (DWS). Its investment banking operations often command substantial deal flow.", "NO INFO", "Phoenix Television is a partially state-owned television network that offers Mandarin and Cantonese-language channels that serve the Chinese mainland, Hong Kong, Macau, Taiwan and other markets with substantial Chinese-language viewers. It is operated by Phoenix Satellite Television Holdings Ltd, a television broadcaster with headquarters in Mainland China and Hong Kong. It is also registered in Cayman Islands.The CEO and founder of Phoenix TV, Liu Changle (劉長樂), was an officer and political instructor in the People's Liberation Army in its 40th Group Army. He later became a journalist for the Communist Party of China-controlled China National Radio after the Cultural Revolution and remains well-connected to the Party's leadership. Liu is a standing member of the National Committee of the Chinese People's Political Consultative Conference.Phoenix Television calls itself a Hong Kong media and holds a non-domestic television programme services licence in Hong Kong. Most of the company's customers and non-current assets come from Mainland China.The company's head offices are located in  Shenzhen, China and Tai Po, New Territories, Hong Kong and it also has correspondent offices in Beijing and Shanghai. The Shenzhen office is said to produce half its TV output.Phoenix TV operates six television channels, including Phoenix InfoNews Channel, Phoenix Chinese Channel, Phoenix Movies Channel and Phoenix Hong Kong Channel. Phoenix Television provides news, information, and entertainment programmes.\nThe Group now has global coverage, through its Chinese Channel, InfoNews Channel, European Channel, American Channel, Movie Channel and Hong Kong Channel, carried on AsiaSat 7, China Sat-6B, EUROBIRD, Telsat-12, Directv, Echostar, G3-C, SATMEX-6, Bell ExpressVU and other broadcasting platforms, operating 60 news bureaus and production teams located worldwide.", "NO INFO", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": [["Paul Achleitner", "chairman", "Christian Sewing", "Chief Executive Officer|CEO", "The New York Times"], "NO INFO", [], "NO INFO", "NO INFO"]}