{"ModuleTitle": "Company Description", "CompanyName": "Morningstar, Inc.", "Symbol": "MORN", "Address": "22 WEST WASHINGTON STREET, CHICAGO, Illinois, 60602, United States of America", "Phone": "(312) 696-6000", "Industry": "Investment Managers", "Sector": "Finance", "Region": "North America", "CompanyDescription": "Morningstar, Inc. is a leading provider of independent investment research in\r\nNorth America, Europe, Australia, and Asia. Our core competencies are data,\r\nresearch, and design, and we employ each of these to create products that\r\nclearly convey complex investment information to investors of all kinds. We\r\nstarted with affordable publications for individuals, then moved to creating\r\ntechnology solutions for professionals to help them research and select\r\ninvestments for clients. Today, we offer a suite of web-based solutions that\r\nserve individuals, financial advisors, asset managers, retirement-plan providers\r\nand sponsors, and institutional investors in the private capital markets. We\r\nalso apply our investing philosophy to managing assets for clients who prefer\r\nnot to make investment decisions themselves. Since our founding in 1984, we've\r\nexpanded our presence in global markets where investors need an independent view\r\nthey can trust.\r\n\r\nWe help investors in two primary ways.&nbsp;&nbsp;... <a href=\"http://secfilings.nasdaq.com/edgar_conv_html%2f2020%2f03%2f02%2f0001289419-20-000041.html#FIS_BUSINESS\" target=\"_blank\">More</a> ...&nbsp;&nbsp;\r\n", "KeyExecutives": [{"name": "Christopher P. Boruff", "title": "Operations Director"}, {"name": "Daniel Edward Needham", "title": "President & Chief Investment Officer"}, {"name": "James Rhodes", "title": "Chief Technology Officer"}, {"name": "Jason M. Dubinsky", "title": "Chief Financial Officer"}, {"name": "John A. Rekenthaler", "title": "Vice President-Research"}, {"name": "Kunal Kapoor", "title": "Chief Executive Officer & Director"}], "Number_of_employees": ["4,595"], "Subsidiaries": ["NO INFO"]}