{"Name": ["KOHLBERG KRAVIS ROBERTS & CO. L.P.", "PRICE T ROWE ASSOCIATES INC /MD/", "VANGUARD GROUP INC", "BLACKROCK INC.", "MASSACHUSETTS FINANCIAL SERVICES CO /MA/"], "Description": ["KKR & Co. Inc. (formerly known as Kohlberg Kravis Roberts & Co. and KKR & Co. L.P.) is an American global investment firm that manages multiple alternative asset classes, including private equity, energy, infrastructure, real estate, credit, and, through its strategic partners, hedge funds. The firm has completed more than 280 private equity investments in portfolio companies with approximately $545 billion of total enterprise value as of June 30, 2017. As of September 30, 2017, Assets Under Management (\"AUM\") and Fee Paying Assets Under Management (\"FPAUM\") were $153 billion and $114 billion, respectively.The firm was founded in 1976 by Jerome Kohlberg, Jr., and cousins Henry Kravis and George R. Roberts, all of whom had previously worked together at Bear Stearns, where they completed some of the earliest leveraged buyout transactions. Since its founding, KKR has completed a number of transactions, including the 1989 leveraged buyout of RJR Nabisco, which was the largest buyout in history to that point, as well as the 2007 buyout of TXU, which is currently the largest buyout completed to date.KKR has offices in 21 cities in 16 countries across five continents. The firm is currently headquartered in the Solow Building (9 W. 57th Street, New York, NY), but in October 2015, the firm announced its intention to occupy a newly constructed 30 Hudson Yards.In October 2009, KKR listed shares in the company through KKR & Co., an affiliate that holds 30% of the firm's ownership equity, with the remainder held by the firm's partners. In March 2010, KKR filed to list its shares on the New York Stock Exchange (NYSE), with trading commencing four months later, on July 15, 2010.", "NO INFO", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $5.3 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "NO INFO"], "NoShare(Trillion)": ["148.5", "NO INFO", "6.2", "7.43", "NO INFO"], "KeyPeople": [["Chairman|Co-Chairman", "Chief executive officer|Co-CEO"], "NO INFO", ["Mortimer J. Buckley"], ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], "NO INFO"]}