{"Name": ["BLACKROCK INC.", "VANGUARD GROUP INC", "MACQUARIE GROUP LTD", "WELLS FARGO & COMPANY/MN", "NEUBERGER BERMAN GROUP LLC"], "Description": ["BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "Macquarie Group Limited () is an Australian multinational independent investment bank and financial services company. Headquartered and listed in Australia (ASX: MQG), Macquarie employs more than 14,000 staff in 25 countries, is the world's largest infrastructure asset manager and Australia's top ranked mergers and acquisitions adviser, with more than A$495 billion in assets under management. The company's operating groups include Macquarie Asset Management and Macquarie Capital. \nMacquarie holds a number of licences enabling it to conduct activities in the jurisdictions in which it operates and is regulated by a significant number of regulators globally. In Australia, Macquarie Bank Limited holds a banking licence and as an authorised deposit-taking institution (ADI), is supervised by the Australian Prudential Regulation Authority (APRA).  Other key Australian regulators include the Australian Securities & Investments Commission (ASIC) and AUSTRAC.  Globally, key regulators include the UK FCA and PRA; US CFTC, FINRA, NFA, FERC, SEC and Federal Reserve Board; IIROC; MAS; Hong Kong SFC; HKMA; SEBI; Japan FSA; Korean FSS; and New Zealand FMA.\nMacquarie's philanthropic arm, the Macquarie Group Foundation, has contributed more than A$330 million globally since 1985 with its community investment strategy “to support social innovation, and to strengthen the impact of non-profit organisations by funding capacity building and collaboration.”. Recipients include the Clontarf Foundation and The Centre for Social Impact.\nThe firm's collection of artworks, the Macquarie Group Collection, established in 1987 to support emerging artists and displayed in more than 30 Macquarie offices worldwide, is one of world's largest corporate collections of Australian art comprising more than 750 individual works.", "Wells Fargo & Company is an American multinational financial services company headquartered in San Francisco, California, with central offices throughout the United States. It is the world's fourth-largest bank by market capitalization and the fourth largest bank in the US by total assets. Wells Fargo is ranked number 26 on the 2018 Fortune 500 rankings of the largest US corporations by total revenue. In July 2015, Wells Fargo became the world's largest bank by market capitalization, edging past ICBC, before slipping behind JPMorgan Chase in September 2016, in the wake of a scandal involving the creation of over 2 million fake bank accounts  and illegal manipulation of other accounts by Wells Fargo employees. Wells Fargo fell behind Bank of America to third by bank deposits in 2017 and behind Citigroup to fourth by total assets in 2018. Wells Fargo is incorporated in Delaware.The firm's primary operating subsidiary is national bank Wells Fargo Bank, N.A., which designates its main office as Sioux Falls, South Dakota. Wells Fargo in its present form is a result of a merger between San Francisco–based Wells Fargo & Company and Minneapolis-based Norwest Corporation in 1998 and the subsequent 2008 acquisition of Charlotte-based Wachovia. Following the mergers, the company transferred its headquarters to Wells Fargo's headquarters in San Francisco and merged its operating subsidiary with Wells Fargo's operating subsidiary in Sioux Falls. Along with JPMorgan Chase, Bank of America, and Citigroup, Wells Fargo is one of the \"Big Four Banks\" of the United States. As of June 2018, it had 8,050 branches and 13,000 ATMs. In 2018 the company had operations in 35 countries with over 70 million customers globally.In February 2014, Wells Fargo was named the world's most valuable bank brand for the second consecutive year in The Banker and Brand Finance study of the top 500 banking brands. In 2016, Wells Fargo ranked 7th on the Forbes Global 2000 list of largest public companies in the world and ranked 27th on the Fortune 500 list of the largest companies in the US. In 2015, the company was ranked the 22nd most admired company in the world, and the 7th most respected company in the world. As of December 2018, the company had a Standard & Poors credit rating of A−. However, for a brief period in 2007, the company was the only AAA-rated bank, reflecting the highest credit rating from two firms.On February 2, 2018, the US Federal Reserve Bank barred Wells Fargo from growing its nearly US$2 trillion-asset base any further, based upon years of misconduct, until Wells Fargo fixes its internal problems to the satisfaction of the Federal Reserve. In April 2018, The Wall Street Journal reported that the US Department of Labor had launched a probe into whether Wells Fargo was pushing its customers into more expensive retirement plans as well as into retirement funds managed by Wells Fargo itself. Subsequently in May 2018, The Wall Street Journal reported that Wells Fargo's business banking group had improperly altered documents about business clients in 2017 and early 2018. In June 2018, Wells Fargo began retreating from retail banking in the Midwestern United States by announcing the sale of all its physical bank branch locations in Indiana, Michigan, and Ohio to Flagstar Bank.", "Neuberger Berman Group LLC is a private, independent, employee-owned investment management firm. The firm manages equities, fixed income, private equity and hedge fund portfolios for global institutional investors, advisors and high-net-worth individuals.  In 2016, it was rated the #1 Best Place to Work in asset management amongst firms with greater than 1,000 employees."], "NoShare(Trillion)": ["7.43", "6.2", "NO INFO", "NO INFO", "3.9"], "KeyPeople": [["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], ["Mortimer J. Buckley"], ["Shemara Wikramanayake"], ["Elizabeth Ashburn Duke|Elizabeth Duke", "Chairman|Chair", "Charles Scharf", "President (corporate title)|President", "CEO", "CFO", "C. Allen Parker", "General counsel"], ["George Herbert Walker IV|George H. Walker"]]}