{"Name": ["MORGAN STANLEY", "RENAISSANCE TECHNOLOGIES LLC", "STIFEL FINANCIAL CORP", "BRIDGEWAY CAPITAL MANAGEMENT INC", "SUSQUEHANNA INTERNATIONAL GROUP, LLP"], "Description": ["Morgan Stanley is an American multinational investment bank and financial services company headquartered at 1585 Broadway in the Morgan Stanley Building, Midtown Manhattan, New York City. With offices in more than 42 countries and more than 60,000 employees, the firm's clients include corporations, governments, institutions, and individuals. Morgan Stanley ranked No. 67 in the 2018 Fortune 500 list of the largest United States corporations by total revenue.The original Morgan Stanley, formed by J.P. Morgan & Co. partners Henry Sturgis Morgan (grandson of J.P. Morgan), Harold Stanley, and others, came into existence on September 16, 1935, in response to the Glass–Steagall Act that required the splitting of commercial and investment banking businesses. In its first year, the company operated with a 24% market share (US$1.1 billion) in public offerings and private placements.\nThe current Morgan Stanley is the result of merger of the original Morgan Stanley with Dean Witter Discover & Co. in 1997. Dean Witter's Chairman and CEO, Philip J. Purcell, became the Chairman and CEO of the newly merged \"Morgan Stanley Dean Witter Discover & Co.\"  The new firm changed its name back to \"Morgan Stanley\" in 2001. The main areas of business for the firm today are institutional securities, wealth management and investment management.\n\n", "Renaissance Technologies LLC, also known as RenTech or RenTec, is an American hedge fund based in East Setauket, New York, on Long Island, which specializes in systematic trading using quantitative models derived from mathematical and statistical analyses. The firm is regarded as one of the \"most secretive and successful\" hedge funds in the world. Their signature Medallion fund is famed for the best record in investing history. Renaissance was founded in 1982 by James Simons, an award-winning mathematician and former Cold War code breaker.\nIn 1988, the firm established its most profitable portfolio, the Medallion Fund, which used an improved and expanded form of Leonard Baum's mathematical models, improved by algebraist James Ax, to explore correlations from which they could profit. Jim Berlekamp was instrumental in evolving trading to shorter-dated, pure systems driven decision-making. The hedge fund was named Medallion in honor of the math awards that Simons and Ax had won.Renaissance's flagship Medallion fund, which is run mostly for fund employees, is famed for the best track record on Wall Street, returning more than 66 percent annualized before fees and 39 percent after fees over a 30-year span from 1988 to 2018. Renaissance offers two portfolios to outside investors—Renaissance Institutional Equities Fund (RIEF) and Renaissance Institutional Diversified Alpha (RIDA).Simons ran Renaissance until his retirement in late 2009. The company is now run by Peter Brown (after Robert Mercer resigned). Both of them were computer scientists specializing in computational linguistics who joined Renaissance in 1993 from IBM Research. Simons continues to play a role at the firm as non-executive chairman and remains invested in its funds, particularly the secretive and consistently profitable black-box strategy known as Medallion. Because of the success of Renaissance in general and Medallion in particular, Simons has been described as the best money manager on earth.", "Stifel Financial Corp. is an American multinational independent investment bank and financial services company created under its present name in July 1983 and listed on the New York Stock Exchange on November 24, 1986. Its predecessor company was founded in 1890 as the Altheimer and Rawlings Investment Company and is headquartered in downtown St. Louis, Missouri.\nStifel offers securities-related financial services in the United States and Europe through several wholly owned subsidiaries. Its clients are served through Stifel, Nicolaus & Company, Incorporated (Stifel Nicolaus) in the U.S., a full-service retail and institutional brokerage and investment banking firm, through Stifel Nicolaus Canada Inc. in Canada, and through Stifel Nicolaus Europe Limited (SNEL) in the United Kingdom and Europe. Its other subsidiaries include Thomas Weisel Partners LLC (TWP), Century Securities Associates, Inc. (CSA), an independent contractor broker-dealer firm, and Stifel Bank & Trust, a retail and commercial bank. Stifel Bank & Trust offers consumer and commercial lending. Stifel Trust Company, N.A. offers trust and related services.", "Bridgeway Capital Management Inc. (\"Bridgeway\") is a U.S. quantitative investment management firm that employs several multi-factor proprietary statistical models to assemble its investment portfolios. Bridgeway specializes in domestic equities, and is the adviser for Bridgeway Funds, the company's family of eleven no-load mutual funds. Bridgeway also provides sub-advisory and separate account services.", "Susquehanna International Group, LLP (SIG) is a privately held, global trading and technology firm. SIG comprises a number of affiliated entities specializing in trading and proprietary investments in equities, fixed income, energy, commodity, index and derivative products, private equity and venture capital, research, customer trading and institutional sales. Susquehanna is probably best known for expertise in derivatives pricing and trading, especially equity options.\n\nSIG is a specialist or DPM (designated primary market maker) in approximately 600 equity options and 45 index options on the CBOE, AMEX, PHLX, and ISE, including big name equities such as Google, Goldman Sachs, JPMorgan Chase, GE, PepsiCo, and Microsoft and indices such as Nasdaq and Russell 2000 options.SIG's headquarters office is in Bala Cynwyd, a western suburb of Philadelphia, Pennsylvania, US, and its European headquarters are in the IFSC, Dublin, Ireland. The firm employs more than 1,900 people in offices across North America (New York City, Chicago, San Francisco, Philadelphia, Boston, Stamford), Australia (Sydney), Europe (Dublin, London) and Asia (Shanghai, Beijing, Hong Kong, Tokyo). SIG is one of the largest employers in Lower Merion Township and was listed as one of Philadelphia Magazine's \"Coolest Companies\" in 2015.\n\n"], "NoShare(Trillion)": ["5.2", "NO INFO", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": [["James P. Gorman", "Chairman", "Chief executive officer|CEO", "Thomas R. Nides|Thomas Nides", "Chief financial officer|CFO"], [], [], "NO INFO", "NO INFO"]}