{"Name": ["VANGUARD GROUP INC", "DODGE & COX", "BLACKROCK INC.", "JANUS HENDERSON GROUP PLC", "PRICE T ROWE ASSOCIATES INC /MD/"], "Description": ["The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $5.3 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "Dodge & Cox is an American mutual fund company, founded in 1930 by Van Duyn Dodge and E. Morris Cox, that provides professional investment management services. Dodge and Cox specializes in value investing and has been described as \"best known for its conservatively managed funds with solid track records and modest fees.\" Having been created during the Great Depression, the firm has \"a razor sharp focus on capital preservation\". Dodge & Cox practices a team-based management strategy and as of 2017, the firm had US$297 billion in assets under management.Headquartered in San Francisco, California, the company offers six no-load mutual funds: a domestic stock fund, an international stock fund, a balanced fund, an income fund, a global stock fund, and a global bond fund. Their balanced fund, comprising 50-70% large company stocks and the remainder in bonds, was established in 1931 and is one of the oldest US mutual funds still in operation as of February 2019.Due to their devotion to the principles of value investing, Dodge & Cox avoided the worst of the dot com bubble during the late 1990s and early 2000 by limiting their exposure to overvalued and then-trendy internet stocks, thereby significantly out-performing the broader market when the bubble collapsed. According to a 2017 Morningstar, Inc. analysis, the firm's low staff turnover and investing principles have been largely beneficial over the long-term but have also led to \"bouts of sluggishness or disappointing results\".", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "Janus Henderson is a global asset management group headquartered in the City of London, United Kingdom. It offers a range of financial products to individuals, intermediary advisors and institutional investors globally under the trade name Janus Henderson Investors.The group's holding company, Janus Henderson Group plc, is incorporated in Jersey and is dual-listed on the New York Stock Exchange and the Australian Securities Exchange (where it is a component of the S&P/ASX 100 index).", "NO INFO"], "NoShare(Trillion)": ["6.2", "NO INFO", "7.43", "NO INFO", "NO INFO"], "KeyPeople": [["Mortimer J. Buckley"], [], ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], ["Richard Gillingwater", "Chairman", "Chief Executive Officer"], "NO INFO"]}