{"Name": ["WELLINGTON MANAGEMENT GROUP LLP", "WILLIAM BLAIR INVESTMENT MANAGEMENT, LLC", "VANGUARD GROUP INC", "BLACKROCK INC.", "TEMASEK HOLDINGS (PRIVATE) LTD"], "Description": ["Wellington Management Company is a private, independent investment management firm with client assets under management totaling over US$1 trillion.\nThe firm serves as investment advisor to over 2,150 institutions in over 60 countries, as of 30 December 2017. Its clients include central banks and sovereign institutions, pension funds, endowments and foundations, family offices, fund sponsors, insurance companies, financial intermediaries, and wealth managers.", "NO INFO", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "Temasek Holdings Private Limited (abbreviated as Temasek) is a Singaporean holding company, owned by the Government of Singapore. Incorporated on 25 June 1974 as a Commercial Investment Company, Temasek owns and manages a net portfolio of $313 billion (as of 31 March 2019), with S$28 billion divested and S$24 billion invested during the year, and 66% exposure to Asia – 26% Singapore and 40% Asia ex-Singapore. It is an active shareholder and investor, and its investments are guided by four key themes – transforming economies, growing middle income populations, deepening comparative advantages and emerging champions. Its portfolio covers a broad spectrum of sectors including financial services, telecommunications, media and technology, transportation and industrials, life sciences and agribusiness, consumer and real estate, energy and resources, as well as multi-sector funds. Headquartered in Singapore, Temasek has a multinational team of 800 people, in 11 global offices including two offices in Beijing, and one office in each of Shanghai, Mumbai, Hanoi, London, New York, San Francisco, Mexico City, Washington, D.C., and Sao Paulo.Temasek differs from many sovereign wealth funds because it invests mostly in equities, is the outright owner of many assets, and pays taxes like other commercial investment firms.Temasek has credit ratings of “AAA/Aaa” by Standard & Poor's Global Ratings and Moody's Investors Service respectively since their inaugural ratings in 2004. Temasek has also attained perfect quarterly scores on the Linaburg-Maduell Transparency Index, a measure of the openness of government-owned investment funds."], "NoShare(Trillion)": ["NO INFO", "NO INFO", "6.2", "7.43", "NO INFO"], "KeyPeople": ["NO INFO", "NO INFO", ["Mortimer J. Buckley"], ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], ["Lim Boon Heng", "Chairman", "Cheng Wai Keung", "Deputy Chairman", "Ho Ching", "Executive Director", "Chief executive officer|CEO"]]}