{
    "Title": ["5 Cheap Stocks That Could Soon Soar Higher", "SOXX, KLAC, ADI, AMAT: Large Outflows Detected at ETF", "The 5G Revolution Could Send These 3 Stocks Higher", "This Dividend Stock Doesn't Look Like an Attractive Bet Right Now", "SOXX, KLAC, ADI, AMAT: Large Inflows Detected at ETF", "Ex-Dividend Reminder: Analog Devices, SBA Communications and Badger Meter", "Analog Devices Inc (ADI) Q2 2020 Earnings Call Transcript", "Technology Sector Update for 05/20/2020: NNDM,PHUN,HPE,ADI,ALRM", "5 Cheap Stocks That Could Soon Soar Higher"],
    "Elapsed Time": ["2 DAYS AGO", "6 DAYS AGO", "JUN 1, 2020", "MAY 28, 2020", "MAY 27, 2020", "MAY 26, 2020", "MAY 20, 2020", "MAY 20, 2020", "2 DAYS AGO"],
    "Published Date": ["Jun 8, 2020 8:54AM EDT", "Jun 4, 2020 10:48AM EDT", "Jun 1, 2020 1:05PM EDT", "May 28, 2020 8:35AM EDT", "May 27, 2020 10:49AM EDT", "May 26, 2020 10:12AM EDT", "May 20, 2020 4:00PM EDT", "May 20, 2020 3:57PM EDT", "Jun 8, 2020 8:54AM EDT"],
    "Link": ["https://www.nasdaq.com/articles/5-cheap-stocks-that-could-soon-soar-higher-2020-06-08", "https://www.nasdaq.com/articles/soxx-klac-adi-amat%3A-large-outflows-detected-at-etf-2020-06-04", "https://www.nasdaq.com/articles/the-5g-revolution-could-send-these-3-stocks-higher-2020-06-01", "https://www.nasdaq.com/articles/this-dividend-stock-doesnt-look-like-an-attractive-bet-right-now-2020-05-28", "https://www.nasdaq.com/articles/soxx-klac-adi-amat%3A-large-inflows-detected-at-etf-2020-05-27", "https://www.nasdaq.com/articles/ex-dividend-reminder%3A-analog-devices-sba-communications-and-badger-meter-2020-05-26", "https://www.nasdaq.com/articles/analog-devices-inc-adi-q2-2020-earnings-call-transcript-2020-05-20", "https://www.nasdaq.com/articles/technology-sector-update-for-05-20-2020%3A-nndmphunhpeadialrm-2020-05-20", "https://www.nasdaq.com/articles/5-cheap-stocks-that-could-soon-soar-higher-2020-06-08"],
    "Content": ["InvestorPlace - Stock Market News, Stock Advice & Trading TipsI wanted to find five cheap stocks that have huge price appreciation potential. For these stocks, the valuations are well below their peers.Here, the market is failing to recognize the growth potential of these cheap stocks. In effect, they are value stocks that should be growth stocks. The patient investor — who can withstand temporary dips –will do quite well with these investments.For example, the average price-earnings ratio of this group of cheap stocks is just 17 times earnings. But their peers have much higher P/E ratios. In addition, the same is true of their enterprise value-revenue valuations.END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares PHLX Semiconductor ETF (Symbol: SOXX) where we have detected an approximate $92.2 million dollar outflow -- that's a 3.1% decrease week over week (from 11,400,000 to 11,050,000).  Among the largest underlying components of SOXX, in trading today KLA Corp (Symbol: KLAC) is up about 1%, Analog Devices Inc (Symbol: ADI) is up about 0.5%, and Applied Materials, Inc. (Symbol: AMAT) is higher by about 1.7%. For a complete list of holdings, visit the SOXX Holdings page » \n\nThe chart below shows the one year price performance of SOXX, versus its 200 day moving average:\n   \n\nEND", "The ongoing advance in digital wireless technology, 5G, is bringing a sea-change to the way we connect in the virtual sphere. By now, we all know the advantages that 5G will bring: faster connection times, lower latency, and improved connectivity – especially in networked systems and Internet of Things. First introduced at the end of 2017, 5G is going to dominate the digital landscape. The current crises – health and economic – have only slowed it down slightly.The major US providers – Verizon, AT&T, and Sprint/T-Mobile – have all introduced 5G coverage, at least in the largest urban markets. It’s only a matter of time before the new systems are available uninterrupted coast-to-coast. The tech is expanding in Europe and Asia, too. China already has the world’s largest 5G networks, and Europe is working on cross-border networks.From an investor’s perspective, 5G is going to send successful providers and supply chain companies soaring. Investors have a rare opportunity here – there is a new technology in the offing, it has been around just long enough that we know it works, and it’s public knowledge where to find the companies involved. We’ve pulled up the TipRanks data on three tech firms that are tied to 5G; here are the details.Analog Devices, Inc. (ADI)We’ll start with a chip maker. Silicon semiconductors are the heart and soul of modern electronics, and leaps in chip technology usually stand behind advanced in computing and networking. Analog is well known for its data conversion and signal processing chips.END", "Analog Devices (NASDAQ: ADI) has made a nice recovery since the March crash on the back of a turnaround in the broader stock market, but the chipmaker's comeback isn't backed by a robust financial performance.The company had to pull its fiscal second-quarter guidance in the wake of the COVID-19 outbreak that spawned uncertainty with respect to demand and disrupted supply chains. The novel coronavirus pandemic compounded Analog Devices' problems as the company was already witnessing a cyclical downturn in the semiconductor business.ADI data by YChartsAnd now, the company's latest quarterly results and the accompanying guidance provide further evidence that a turnaround in its fortunes is still some way off. There are quite a few pointers why Analog Devices may be a risky bet despite a nice dividend. Let's take a look.END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares PHLX Semiconductor ETF (Symbol: SOXX) where we have detected an approximate $173.1 million dollar inflow -- that's a 6.5% increase week over week in outstanding units (from 10,700,000 to 11,400,000).  Among the largest underlying components of SOXX, in trading today KLA Corp (Symbol: KLAC) is down about 1.7%, Analog Devices Inc (Symbol: ADI) is up about 1%, and Applied Materials, Inc. (Symbol: AMAT) is lower by about 0.1%. For a complete list of holdings, visit the SOXX Holdings page » \n\nThe chart below shows the one year price performance of SOXX, versus its 200 day moving average:\n   \n\nEND", "Looking at the universe of stocks we cover at Dividend Channel, on 5/28/20, Analog Devices Inc (Symbol: ADI), SBA Communications Corp  (Symbol: SBAC), and Badger Meter Inc (Symbol: BMI) will all trade ex-dividend for their respective upcoming dividends.  Analog Devices Inc will pay its quarterly dividend of $0.62 on 6/9/20, SBA Communications Corp  will pay its quarterly dividend of $0.465 on 6/18/20, and Badger Meter Inc will pay its quarterly dividend of $0.17 on 6/12/20.  \n\nAs a percentage of ADI's recent stock price of $114.36, this dividend works out to approximately 0.54%, so look for shares of Analog Devices Inc to trade 0.54% lower — all else being equal — when ADI shares open for trading on 5/28/20.  Similarly, investors should look for SBAC to open 0.16% lower in price and for BMI to open 0.27% lower, all else being equal.\n\n\n\nWhen an S&P 1500 component reaches 20 years of dividend increases, it becomes a contender to join the elite \"Dividend Aristocrats\" index.  Analog Devices Inc (Symbol: ADI) is a \"future dividend aristocrats contender,\" with 17+ years of increases.  \n\t\n\n\nBelow are dividend history charts for ADI, SBAC, and BMI, showing historical dividends prior to the most recent ones declared.\n\nAnalog Devices Inc (Symbol: ADI):\nEND", "END", "Technology stocks continued to advance Wednesday afternoon, with the SPDR Technology Select Sector ETF climbing 2.2% while the Philadelphia Semiconductor Index was rising 3.7% in late trade.In company news, Nano Dimension (NNDM) slumped 14% on Wednesday after the additively manufactured electronics company priced a $39.5 million direct placement of almost 18 million American depository shares at $2 apiece, or 41.2% under Tuesday's closing price for the stock. Net proceeds will be used for working capital and for other general corporate purposes.Phunware (PHUN) rallied Wednesday, at one point climbing 348%, after the software firm said it was partnering with Hewlett Packard Enterprise (HPE) to create a mobile product integrating technology from Phunware and HPE's Aruba Networks unit to provide patients with appointment reminders, virtual visits and other health care services.Cree (CREE) climbed 7.8% after JPMorgan raised its investment rating for the light emitting diode products company to neutral from underweight previously and increased its price price target on the stock by $20 to $60 a share.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsI wanted to find five cheap stocks that have huge price appreciation potential. For these stocks, the valuations are well below their peers.Here, the market is failing to recognize the growth potential of these cheap stocks. In effect, they are value stocks that should be growth stocks. The patient investor — who can withstand temporary dips –will do quite well with these investments.For example, the average price-earnings ratio of this group of cheap stocks is just 17 times earnings. But their peers have much higher P/E ratios. In addition, the same is true of their enterprise value-revenue valuations.END"]
}