{"Title": ["Notable ETF Outflow Detected - ACWX, BABA, JD, BIDU", "Analysts Anticipate ADRE Will Reach $44", "EXCLUSIVE-Winning bidder for Grindr has ties to Chinese owner", "2 Top Tech Stocks for a Post-Pandemic World", "Could Baidu Be a Millionaire Maker Stock?", "Why Boeing Stock Is Up", "Baidu Accelerates Its Self-Driving Car Initiative with New Test Center and Partnership", "As Chinese authorities expand use of health tracking apps, privacy concerns grow", "Notable ETF Outflow Detected - ACWX, BABA, JD, BIDU", "Nasdaq Today: Baidu, NetEase Stocks Fall on Delisting Fears", "Nasdaq 100 Movers: NTES, SPLK", "Chinese Stocks will Soon Struggle in American Markets", "Chinese Companies Could Be Delisted From U.S. Stock Exchanges: What It Means for Investors", "3 Chinese Stocks to Trade As Tensions Mount Over Transparency Issues", "BUZZ-U.S. STOCKS ON THE MOVE-Akorn, L Brands, Aurora Cannabis", "IEMG, BABA, JD, BIDU: ETF Outflow Alert", "As Chinese authorities expand use of health tracking apps, privacy concerns grow", "Alibaba to invest $1.4 bln in AI system for smart speakers", "Breakingviews - Corona Capital: Natural gas, Disney, Brazil", "Technology Sector Update for 05/19/2020: NNDM,FSLY,BIDU,AYX", "Why Baidu Stock Popped 12% This Morning", "BUZZ-U.S. STOCKS ON THE MOVE-Xenetic Biosciences, Dycom, Dynavax Technologies", "Technology Sector Update for 05/19/2020: FSLY,BIDU,AYX", "Nasdaq Today: Strong Quarter Lifts Baidu Stock; Expedia Gets a Downgrade", "Is Baidu's Stock Finally Ready to Rebound?", "Breakingviews - Corona Capital: Airlines, UniCredit, Caterers", "This Chinese Search Engine Continues to Grow in Baidu’s Shadow", "BUZZ-U.S. STOCKS ON THE MOVE-KemPharm, Flotek, Arbutus Biopharama", "Baidu Breaks Above 200-Day Moving Average - Bullish for BIDU", "Nasdaq 100 Movers: TMUS, BIDU", "Will Baidu Stock Finally Bounce Back in 2020?", "Stock Alert: Baidu Rises 9% After Reporting Upbeat Results", "Why iQiyi Stock Dropped Nearly 10% This Morning", "Technology Sector Update for 05/19/2020: BIDU, SINA, IQ, XLK, XSD", "Breakingviews - Corona Capital: Julius Baer, Baidu, Imperial", "Baidu, Inc. (BIDU) Q1 2020 Earnings Call Transcript", "Baidu.com Inc. Q1 adjusted earnings of RMB8.84 per share", "5 Top Stock Trades for Tuesday: MSFT, PENN, SAVE, KSS, BIDU", "Baidu forecasts current-quarter revenue above estimates, shares rise", "Baidu.com Posts Q1 Profit", "BUZZ-U.S. STOCKS ON THE MOVE-Dynavax Technologies, Arbutus Biopharama, Flotek", "Baidu (BIDU) 1st Quarter Earnings: What to Expect", "Hong Kong's Hang Seng benchmark paves way to include Alibaba", "Weekly Preview: Stocks To Watch (BIDU, HD, NVDA, TGT, WMT)", "IEMG, BIDU, NTES, TAL: Large Outflows Detected at ETF", "3 Reasons to Buy Alibaba Stock on the Dip", "7 Tech Stocks to Buy Amidst Coronavirus Uncertainty", "China's Tesla wannabes risk running out of road in virus-stricken times", "Baidu beats quarterly revenue estimates", "IXUS, BABA, JD, BIDU: ETF Inflow Alert"], "Elapsed Time": ["1 DAY AGO", "1 DAY AGO", "2 DAYS AGO", "4 DAYS AGO", "6 DAYS AGO", "MAY 28, 2020", "MAY 27, 2020", "MAY 26, 2020", "1 DAY AGO", "MAY 22, 2020", "MAY 22, 2020", "MAY 22, 2020", "MAY 21, 2020", "MAY 21, 2020", "MAY 21, 2020", "MAY 21, 2020", "MAY 26, 2020", "MAY 20, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 20, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 18, 2020", "MAY 18, 2020", "MAY 18, 2020", "MAY 18, 2020", "MAY 19, 2020", "MAY 18, 2020", "MAY 18, 2020", "MAY 17, 2020", "MAY 13, 2020", "MAY 13, 2020", "MAY 12, 2020", "MAY 12, 2020", "MAY 18, 2020", "MAY 5, 2020"], "Published Date": ["Jun 3, 2020 10:48AM EDT", "Jun 3, 2020 10:21AM EDT", "Jun 2, 2020 6:00AM EDT", "May 31, 2020 12:00PM EDT", "May 29, 2020 9:26AM EDT", "May 28, 2020 8:50AM EDT", "May 27, 2020 2:04PM EDT", "May 26, 2020 11:00AM EDT", "Jun 3, 2020 10:48AM EDT", "May 22, 2020 12:34PM EDT", "May 22, 2020 10:32AM EDT", "May 22, 2020 6:15AM EDT", "May 21, 2020 1:46PM EDT", "May 21, 2020 11:53AM EDT", "May 21, 2020 11:42AM EDT", "May 21, 2020 10:50AM EDT", "May 26, 2020 4:59AM EDT", "May 20, 2020 3:25AM EDT", "May 19, 2020 4:44PM EDT", "May 19, 2020 3:52PM EDT", "May 19, 2020 1:34PM EDT", "May 19, 2020 1:29PM EDT", "May 19, 2020 1:26PM EDT", "May 19, 2020 12:28PM EDT", "May 20, 2020 2:09PM EDT", "May 19, 2020 11:51AM EDT", "May 19, 2020 11:48AM EDT", "May 19, 2020 11:34AM EDT", "May 19, 2020 11:32AM EDT", "May 19, 2020 10:24AM EDT", "May 19, 2020 10:00AM EDT", "May 19, 2020 9:57AM EDT", "May 19, 2020 12:24PM EDT", "May 19, 2020 9:09AM EDT", "May 19, 2020 6:24AM EDT", "May 19, 2020 3:30AM EDT", "May 18, 2020 5:25PM EDT", "May 18, 2020 5:02PM EDT", "May 18, 2020 4:59PM EDT", "May 18, 2020 4:58PM EDT", "May 19, 2020 9:17AM EDT", "May 18, 2020 7:57AM EDT", "May 18, 2020 5:25AM EDT", "May 17, 2020 8:11AM EDT", "May 13, 2020 10:51AM EDT", "May 13, 2020 10:48AM EDT", "May 12, 2020 12:26PM EDT", "May 12, 2020 6:58AM EDT", "May 18, 2020 4:42PM EDT", "May 5, 2020 10:49AM EDT"], "Link": ["https://www.nasdaq.com/articles/notable-etf-outflow-detected-acwx-baba-jd-bidu-2020-06-03", "https://www.nasdaq.com/articles/analysts-anticipate-adre-will-reach-%2444-2020-06-03", "https://www.nasdaq.com/articles/exclusive-winning-bidder-for-grindr-has-ties-to-chinese-owner-2020-06-02", "https://www.nasdaq.com/articles/2-top-tech-stocks-for-a-post-pandemic-world-2020-05-31", "https://www.nasdaq.com/articles/could-baidu-be-a-millionaire-maker-stock-2020-05-29", "https://www.nasdaq.com/articles/why-boeing-stock-is-up-2020-05-28", "https://www.nasdaq.com/articles/baidu-accelerates-its-self-driving-car-initiative-with-new-test-center-and-partnership", "https://www.nasdaq.com/articles/as-chinese-authorities-expand-use-of-health-tracking-apps-privacy-concerns-grow-2020-05-0", "https://www.nasdaq.com/articles/notable-etf-outflow-detected-acwx-baba-jd-bidu-2020-06-03", "https://www.nasdaq.com/articles/nasdaq-today%3A-baidu-netease-stocks-fall-on-delisting-fears-2020-05-22", "https://www.nasdaq.com/articles/nasdaq-100-movers%3A-ntes-splk-2020-05-22", "https://www.nasdaq.com/articles/chinese-stocks-will-soon-struggle-in-american-markets-2020-05-22", "https://www.nasdaq.com/articles/chinese-companies-could-be-delisted-from-u.s.-stock-exchanges%3A-what-it-means-for-investors", "https://www.nasdaq.com/articles/3-chinese-stocks-to-trade-as-tensions-mount-over-transparency-issues-2020-05-21", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-akorn-l-brands-aurora-cannabis-2020-05-21", "https://www.nasdaq.com/articles/iemg-baba-jd-bidu%3A-etf-outflow-alert-2020-05-21", "https://www.nasdaq.com/articles/as-chinese-authorities-expand-use-of-health-tracking-apps-privacy-concerns-grow-2020-05-26", "https://www.nasdaq.com/articles/alibaba-to-invest-%241.4-bln-in-ai-system-for-smart-speakers-2020-05-20", "https://www.nasdaq.com/articles/breakingviews-corona-capital%3A-natural-gas-disney-brazil-2020-05-19", "https://www.nasdaq.com/articles/technology-sector-update-for-05-19-2020%3A-nndmfslybiduayx-2020-05-19", "https://www.nasdaq.com/articles/why-baidu-stock-popped-12-this-morning-2020-05-19", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-xenetic-biosciences-dycom-dynavax-technologies-2020-05-19", "https://www.nasdaq.com/articles/technology-sector-update-for-05-19-2020%3A-fslybiduayx-2020-05-19", "https://www.nasdaq.com/articles/nasdaq-today%3A-strong-quarter-lifts-baidu-stock-expedia-gets-a-downgrade-2020-05-19", "https://www.nasdaq.com/articles/is-baidus-stock-finally-ready-to-rebound-2020-05-20", "https://www.nasdaq.com/articles/breakingviews-corona-capital%3A-airlines-unicredit-caterers-2020-05-19", "https://www.nasdaq.com/articles/this-chinese-search-engine-continues-to-grow-in-baidus-shadow-2020-05-19", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-kempharm-flotek-arbutus-biopharama-2020-05-19", "https://www.nasdaq.com/articles/baidu-breaks-above-200-day-moving-average-bullish-for-bidu-2020-05-19", "https://www.nasdaq.com/articles/nasdaq-100-movers%3A-tmus-bidu-2020-05-19", "https://www.nasdaq.com/articles/will-baidu-stock-finally-bounce-back-in-2020-2020-05-19", "https://www.nasdaq.com/articles/stock-alert%3A-baidu-rises-9-after-reporting-upbeat-results-2020-05-19", "https://www.nasdaq.com/articles/why-iqiyi-stock-dropped-nearly-10-this-morning-2020-05-19", "https://www.nasdaq.com/articles/technology-sector-update-for-05-19-2020%3A-bidu-sina-iq-xlk-xsd-2020-05-19", "https://www.nasdaq.com/articles/breakingviews-corona-capital%3A-julius-baer-baidu-imperial-2020-05-19", "https://www.nasdaq.com/articles/baidu-inc.-bidu-q1-2020-earnings-call-transcript-2020-05-19", "https://www.nasdaq.com/articles/baidu.com-inc.-q1-adjusted-earnings-of-rmb8.84-per-share-2020-05-18", "https://www.nasdaq.com/articles/5-top-stock-trades-for-tuesday%3A-msft-penn-save-kss-bidu-2020-05-18", "https://www.nasdaq.com/articles/baidu-forecasts-current-quarter-revenue-above-estimates-shares-rise-2020-05-18", "https://www.nasdaq.com/articles/baidu.com-posts-q1-profit-2020-05-18", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-dynavax-technologies-arbutus-biopharama-flotek-2020-05-19", "https://www.nasdaq.com/articles/baidu-bidu-1st-quarter-earnings%3A-what-to-expect-2020-05-18", "https://www.nasdaq.com/articles/hong-kongs-hang-seng-benchmark-paves-way-to-include-alibaba-2020-05-18", "https://www.nasdaq.com/articles/weekly-preview%3A-stocks-to-watch-bidu-hd-nvda-tgt-wmt-2020-05-17", "https://www.nasdaq.com/articles/iemg-bidu-ntes-tal%3A-large-outflows-detected-at-etf-2020-05-13", "https://www.nasdaq.com/articles/3-reasons-to-buy-alibaba-stock-on-the-dip-2020-05-13", "https://www.nasdaq.com/articles/7-tech-stocks-to-buy-amidst-coronavirus-uncertainty-2020-05-12", "https://www.nasdaq.com/articles/chinas-tesla-wannabes-risk-running-out-of-road-in-virus-stricken-times-2020-05-12", "https://www.nasdaq.com/articles/baidu-beats-quarterly-revenue-estimates-2020-05-18", "https://www.nasdaq.com/articles/ixus-baba-jd-bidu%3A-etf-inflow-alert-2020-05-05"], "Content": ["Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares MSCI ACWI ex U.S. ETF (Symbol: ACWX) where we have detected an approximate $78.1 million dollar outflow -- that's a 2.5% decrease week over week (from 72,400,000 to 70,600,000).  Among the largest underlying components of ACWX, in trading today Alibaba Group Holding Ltd (Symbol: BABA) is up about 1.1%, JD.com, Inc. (Symbol: JD) is up about 2.5%, and Baidu Inc (Symbol: BIDU) is up by about 4.1%. For a complete list of holdings, visit the ACWX Holdings page » \n\nThe chart below shows the one year price performance of ACWX, versus its 200 day moving average:\n   \n\nEND", "Looking at the underlying holdings of the ETFs in our coverage universe at ETF Channel, we have compared the trading price of each holding against the average analyst 12-month forward target price, and computed the weighted average implied analyst target price for the ETF itself. \tFor the  ETF (Symbol: ADRE), we found that the implied analyst target price for the ETF based upon its underlying holdings is $44.26 per unit.\n\n\nWith ADRE trading at a recent price near $38.34 per unit, that means that analysts see 15.46% upside for this ETF looking through to the average analyst targets of the underlying holdings.   Three of ADRE's underlying holdings with notable upside to their analyst target prices are Momo Inc (Symbol: MOMO), Baidu Inc (Symbol: BIDU), and Trip.com Group Ltd (Symbol: TCOM). Although MOMO has traded at a recent price of $19.62/share, the average analyst target is 62.33% higher at $31.85/share. Similarly, BIDU has 39.19% upside from the recent share price of $107.23 if the average analyst target price of $149.25/share is reached, and analysts on average are expecting TCOM to reach a target price of $34.67/share, which is 30.10% above the recent price of $26.65. Below is a twelve month price history chart comparing the stock performance of MOMO, BIDU, and TCOM:  \n\n END", "By Echo Wang, Alexandra Alper and Chibuike OguhNEW YORK/WASHINGTON, June 2 (Reuters) - An investor group that got U.S. approval to buy Grindr Inc has financial and personal links to the dating app's current owner, China's Beijing Kunlun Tech Co Ltd 300418.SZ, Reuters has found, in a possible departure from Washington’s national security policy on deals.Kunlun said on Friday that the Committee on Foreign Investment in the United States (CFIUS) had cleared the sale of Grindr to San Vicente Acquisition LLC for more than $600 million, but did not give details about the investor group. A Reuters review of confidential fundraising documents and interviews with two sources familiar with the deal show that a close business associate of Kunlun's founder tried to raise money for a fund to buy Grindr. Two of the partners in that fund eventually became part of San Vicente.Kunlun also offered financing support to San Vicente that it didn't extend to two other groups, according to two other sources familiar with some of the other bidders.END", "The novel coronavirus pandemic has led to a surge in internet traffic thanks to the shift toward telecommuting and online education, as well as a bump in video gaming and streaming video demand on account of shelter-in-place orders and lockdowns.This is forcing data center operators to upgrade their capacities and capabilities to handle the increased load. Chinese giant Alibaba recently announced that it will spend $28 billion to bolster its data center infrastructure over the next three years in preparation for a post-COVID-19 world. Market research firm TechNavio estimates that spending on data center construction could increase at an annual rate of 10% through 2024.According to another estimate, cloud computing demand is expected to increase at an annual pace of 12.5% through 2021. Software-as-a-service (SaaS) solutions are expected to account for a lion's share of this growth.This is why investors should be looking at companies providing cloud services and data center equipment in these times. NVIDIA (NASDAQ: NVDA) and Twilio (NYSE: TWLO) are two tech stocks to watch as they stand to win big from more capable data centers and the widespread adoption of cloud computing in a post-pandemic world.END", "Baidu (NASDAQ: BIDU), the Chinese tech giant that owns the country's top search engine, went public 15 years ago. Investors in its IPO are sitting on a near-40 bagger return, but the stock has been cut in half over the past two years.Baidu remains a battleground stock for the bulls and bears. The bulls believe Baidu's dominance of China's search market, the growth of its streaming video unit iQiyi (NASDAQ: IQ), and the expansion of its ecosystem will support its long-term growth.The bears believe intense competition from rivals like Tencent (OTC: TCEHY), ByteDance, and Alibaba (NYSE: BABA) in the advertising market, the slowdown in the Chinese economy, the trade war, and other macro headwinds will curb Baidu's growth. So can Baidu prove the bears wrong and generate more millionaire-making returns?END", "In this episode of MarketFoolery, Chris Hill chats with Motley Fool analyst Jim Gillies about the latest headlines from Wall Street. They talk about some stock offerings and there is news on the work-from-home front. They talk about Boeing, answer listeners' questions, and much more.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than BoeingWhen investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*David and Tom just revealed what they believe are the ten best stocks for investors to buy right now… and Boeing wasn't one of them! That's right -- they think these 10 stocks are even better buys.END", "Baidu (NASDAQ: BIDU) completed development of its Apollo Park testing center for self-driving vehicles on Tuesday, marking another major step in the company's bid to cement leadership in China's autonomous vehicle industry. Located in Beijing and spanning 13,500 square meters, Apollo Park stands as the world's largest research-and-development center for self-driving vehicles.Gosuncn, a Chinese company specializing in Internet of Things and artificial intelligence (AI) applications, also gave Baidu's Apollo autonomous vehicle ecosystem an official vote of confidence on Wednesday. Despite announcing a partnership with Baidu's self-driving technology rival WeRide in April, Gosuncn revealed that it would bring its technology to Apollo and share resources with Baidu to bolster development of vehicle-road collaboration, smart transport, and the Internet of Vehicles applications.END", "By Josh Horwitz and Brenda GohSHANGHAI, May 26 (Reuters) - China's health tracking QR codes, which have played a key part in the country's successful containment of the coronavirus, now look set to play a much broader role in daily life as local authorities dream up new uses for the technology.Embedded in the popular WeChat and Alipay smartphone apps, the codes use self-reported and automatically collected travel and medical data to give people a red, yellow or green rating indicating the likelihood of having the virus.To walk around freely, people in China must have a green rating and since February they have been asked to present their health QR codes to gain entry into restaurants, parks and other venues.The codes had so far met with little public resistance, seen as a necessary tool to get the economy back up on its feet again.END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares MSCI ACWI ex U.S. ETF (Symbol: ACWX) where we have detected an approximate $78.1 million dollar outflow -- that's a 2.5% decrease week over week (from 72,400,000 to 70,600,000).  Among the largest underlying components of ACWX, in trading today Alibaba Group Holding Ltd (Symbol: BABA) is up about 1.1%, JD.com, Inc. (Symbol: JD) is up about 2.5%, and Baidu Inc (Symbol: BIDU) is up by about 4.1%. For a complete list of holdings, visit the ACWX Holdings page » \n\nThe chart below shows the one year price performance of ACWX, versus its 200 day moving average:\n   \n\nEND", "Major benchmarks were modestly lower on Friday morning, with most investors still showing some worry about the fragile state of the U.S. economy in the wake of the coronavirus pandemic. The Nasdaq Composite (NASDAQINDEX: ^IXIC) fell 0.25% shortly after 11:30 a.m. EDT, faring somewhat better than the broader market in a familiar pattern. The Nasdaq 100 of larger Nasdaq-listed stocks fell by a similar percentage.However, the news for Nasdaq 100 components Baidu (NASDAQ: BIDU) and NetEase (NASDAQ: NTES) wasn't as good, as both stocks posted much larger losses of 5% to 6%. At issue is a movement that's picking up steam, aimed at keeping Chinese companies from remaining listed on U.S. stock exchanges. After some recent fraud issues, the move is understandable, but shareholders in these two major stocks aren't happy about the ramifications.END", "In early trading on Friday, shares of Splunk topped the list of the day's best performing components of the Nasdaq 100 index, trading up 8.6%.  Year to date, Splunk registers a 18.6% gain.\n\nAnd the worst performing Nasdaq 100 component thus far on the day is NetEase, trading down 7.4%.  NetEase is showing a gain of 21.4% looking at the year to date performance.\n\nTwo other components making moves today are Baidu, trading down 5.4%, and NVIDIA trading up 2.9% on the day.\n\n \n\n\n\n\n\n\n\nVIDEO: Nasdaq 100 Movers: NTES, SPLK\nEND", "Do you own shares in Chinese stocks Baidu (NASDAQ: BIDU), Alibaba (NYSE: BABA), or perhaps JD.com (NASDAQ: JD)?If you do, enjoy them while they last. On Wednesday, the U.S. Senate passed -- unanimously -- a bill that aims to ban IPOs by Chinese companies on U.S. stock markets, and that could even force Chinese companies already listed on the Nasdaq and NYSE to delist their shares and exit the U.S.  END", "The U.S. Senate approved the Holding Foreign Companies Accountable Act (HFCAA) on Wednesday, sweeping legislation that could result in non-U.S. companies that fail to meet a number of strict criteria being barred from trading on U.S. stock exchanges. The bill was approved without objection. One of the key provisions of the legislation is that companies would be required to certify that \"they are not owned or controlled by a foreign government.\" Lawmakers would also require that these statements be backed up by an audit conducted by the Public Company Accounting Oversight Board (PCAOB). The legislation would still need to pass the House of Representatives before being sent to President Trump for final approval. If passed, though, the law could have far-reaching effects on foreign companies already listed on U.S. exchanges, especially those from China.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsWhile stock markets were rallying hard on Wednesday, Chinese stocks fell into a hole on a U.S. legislative headline.The Senate passed a bill to de-list Chinese companies from U.S. stock exchanges if they cannot be more transparent. So far, this is a mere headline and still needs to go through the rest of the legal procedures. And it will take time because it is not usually a fast process for bills to become law. The companies we are discussing today are not likely the reason for this initiative. It is more likely to dissuade new comers to prevent another Luckin (NASDAQ:LK). Coincidentally or not, though, LK stock resumed trading yesterday after weeks of being in the penalty box.It will be political football going into the election, but the fans and haters of Chinese stocks are dedicated to their cause. Overall, the fundamentals behind these three stocks are solid — and they should also have the tailwind from the fact that China reopened its country to business first. The recovery process is ongoing already, and the government will most likely do all it can to help them along.END", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThWall Street's main indexes dropped about 1% on Thursday as investors worried about escalating U.S.-China trade tensions and concerns over a quick rebound from a coronavirus-led economic slump. .NAt 11:09 a.m. ET, the Dow Jones Industrial Average .DJI was down 0.44% at 24,467.31. The S&P 500 .SPX was down 0.74% at 2,949.61 and the Nasdaq Composite .IXIC was down 0.96% at 9,285.843.   The top three S&P 500 .PG.INX percentage gainers:  ** L Brands Inc <LB.N>, up 14.2%  ** Norwegian Cruise Line Holdings Ltd <NCLH.N>, up 8.5%  ** Royal Caribbean Cruises Ltd <RCL.N>, up 6.5%   The top three S&P 500 .PL.INX percentage losers:  ** National-Oilwell Varco Inc <NOV.N>, down 6.3%  ** Boston Scientific Corp <BSX.N>, down 5.8%  ** Hormel Foods Corp <HRL.N>, down 5.2%   The top three NYSE .PG.N percentage gainers:  ** Xtant Medical Holdings Inc <XTNT.N>, up 218.1%  ** Nabors Industries Ltd <NBR.N>, up 20.4%  ** Aurora Cannabis Inc <ACB.N>, up 19.5%   The top three NYSE .PL.N percentage losers:  ** NanoViricides Inc <NNVC.N>, down 12.3%  ** HUYA Inc <HUYA.N>, down 12.3%  ** Phoenix Tree Holdings Ltd <DNK.N>, down 10.6%   The top three Nasdaq .PG.O percentage gainers:  ** Surface Oncology Inc <SURF.O>, up 55.9%  ** ADDvantage Technologies Group Inc <AEY.O>, up 27.8%  ** LMP Automotive Holdings Inc <LMPX.O>, up 24.3%   The top three Nasdaq .PL.O percentage losers:  ** Shiftpixy Inc <PIXY.O>, down 28.1%  ** Luckin Coffe Inc <LK.O>, down 28.4%  ** Entera Bio Ltd <ENTX.O>, down 24.7%     ** Entergy Corp ETR.N: up 0.1%END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares Core MSCI Emerging Markets ETF (Symbol: IEMG) where we have detected an approximate $242.1 million dollar outflow -- that's a 0.5% decrease week over week (from 1,045,800,000 to 1,040,400,000).  Among the largest underlying components of IEMG, in trading today Alibaba Group Holding Ltd (Symbol: BABA) is down about 1.4%, JD.com, Inc. (Symbol: JD) is down about 1.2%, and Baidu Inc (Symbol: BIDU) is higher by about 1.5%. For a complete list of holdings, visit the IEMG Holdings page » \n\nThe chart below shows the one year price performance of IEMG, versus its 200 day moving average:\n   \n\nEND", "By Josh Horwitz and Brenda GohSHANGHAI, May 26 (Reuters) - China's health tracking QR codes, which have played a key part in the country's successful containment of the coronavirus, now look set to play a much broader role in daily life as local authorities dream up new uses for the technology.Embedded in the popular WeChat and Alipay smartphone apps, the codes use self-reported and automatically collected travel and medical data to give people a red, yellow or green rating indicating the likelihood of having the virus.To walk around freely, people in China must have a green rating and since February they have been asked to present their health QR codes to gain entry into restaurants, parks and other venues.The codes had so far met with little public resistance, seen as a necessary tool to get the economy back up on its feet again.END", "Adds detailSHANGHAI, May 20 (Reuters) - Alibaba Group Holding Ltd BABA.N will invest 10 billion yuan  ($1.41 billion) into an AI (artificial intelligence) and IoT (Internet of Things) system centered around its Tmall Genie smart speaker, the company announced on Wednesday.The announcement comes as the e-commerce giant continues its push into new technologies and business sectors beyond online shopping.The money will be used to add more content to Tmall Genie, as well as develop proprietary technology, Alibaba said.It launched the first model of Tmall Genie in 2017. END", "END", "Technology stocks gave back some of their market-leading gains this afternoon, with the SPDR Technology Select Sector ETF advancing 0.3% in Tuesday trading while the Philadelphia Semiconductor Index was rising 0.5%.In company news, Nano Dimension (NNDM) shares soared Tuesday, at one point racing more than 410% higher, after announcing a \"major breakthrough\" by using 3-D printing technology to produce the first 10-layer printed circuit board. Together with its German partner Hensoldt, Nano Dimension developed a new dielectric polymer ink and adapted its DragonFly 3-D printing process to produce two-sided circuit boards allowing electronic structures to be soldered to both sides of the device.Alteryx (AYX) climbed 7% after Piper Sandler Tuesday raised its investment rating for the data analytics firm to overweight from neutral previously and also increased its price target for the company's shares by $70 to $160.Fastly (FSLY) rose 4% after the cloud platform company late Monday announced plans for a follow-on public offering of 6 million shares of its Class A common stock. Net proceeds will be used for working capital and other general corporate purposes, including potential acquisitions or strategic investments.END", "END", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThThe S&P 500 was largely unchanged on Tuesday, after a strong rally in the prior session, as investors sifted through a mixed batch of results from major retailers including Walmart and Home Depot. .NAt 13:06 ET, the Dow Jones Industrial Average .DJI was down 0.35% at 24,511.51. The S&P 500 .SPX was down 0.03% at 2,953.12 and the Nasdaq Composite .IXIC was up 0.58% at 9,288.802.   The top three S&P 500 .PG.INX percentage gainers:  ** Advance Auto Parts Inc <AAP.N>, up 6.1%  ** HP Inc <HPQ.N>, up 5%  ** Lennar Corp <LEN.N>, up 4.9%   The top three S&P 500 .PL.INX percentage losers:  ** Kohl's Corp <KSS.N>, down 7.9%  ** TechnipFMC Plc <FTI.N>, down 6.7%  ** Noble Energy Inc <NBL.O>, down 6.5%   The top three NYSE .PG.N percentage gainers:  ** Dycom Industries Inc <DY.N>, up 21.2%  ** Puxin Ltd <NEW.N>, up 18.9%  ** John Hancock Mltfactor Energy ETF <JHME.N>, up 15.5%   The top three NYSE .PL.N percentage losers:  ** Timber Pharmaceuticals Inc <TMBR.N>, down 31.4%  ** Aurora Cannabis Inc <ACB.N>, down 14.6%  ** Crescent Point Energy Corp CPG.N, down 11.3%   The top three Nasdaq .PG.O percentage gainers:  ** Nano Dimension Inc <NNDM.O>, up 401.4%  ** Shiftpixy Inc <PIXY.O>, up 84.8%  ** Iterum Therapeutics Plc <ITRM.O>, up 29%   The top three Nasdaq .PL.O percentage losers:  ** Gamida Cell Ltd <GMDA.O>, down 23.1%  ** Sorrento Therapeutics Inc <SRNE.O>, down 21.8%  ** Bellerophon Therapeutics Inc <BLPH.O>, down 18.8%     ** Fastly Inc FSLY.N: up 4.3%END", "Technology stocks were keeping most of the broader indexes above their respective break-even marks with the SPDR Technology Select Sector ETF advancing 1% in Tuesday trading while the Philadelphia Semiconductor Index was up 1.6%.In company news, Fastly (FSLY) rose 5.8% after the cloud platform company late Monday announced plans for a follow-on public offering of 6 million shares of its Class A common stock. Net proceeds will be used for working capital and other general corporate purposes, including potential acquisitions or strategic investments.Alteryx (AYX) climbed 8.3% after Piper Sandler Tuesday raised its investment rating for the data analytics firm to overweight from neutral previously and also increased its price target for the company's shares by $70 to $160.Baidu (BIDU) was 5.4% higher after the Chinese internet search company reported non-GAAP Q1 net income of RMB8.84 per American depository shares, more than tripling its RMB2.77 per ADS adjusted profit during the same quarter last year and beating the Capital IQ consensus expecting RMB3.98 per ADS. Revenue declined 6.7% year-over-year to RMB22.5 billion but still exceeded the RMB21.94 billion analyst mean.END", "On a mixed day for the broader stock market, the tech stocks that make up a disproportionately large part of the Nasdaq fared better than most. As of just before noon EDT, the Nasdaq Composite (NASDAQINDEX: ^IXIC) was up more than half a percentage point, outperforming the breakeven performance from the S&P 500. The Nasdaq 100 Index saw similar gains of about 0.6%.Making news among Nasdaq 100 stocks was Baidu (NASDAQ: BIDU), which released earnings results for the first quarter that gave investors greater confidence in the broader Chinese stock market. Expedia Group (NASDAQ: EXPE) wasn't so lucky, however, with ongoing strains on the travel industry hitting the online-booking specialist and leading one stock analyst to downgrade its stock.END", "Baidu's (NASDAQ: BIDU) stock popped after the Chinese tech giant posted its first-quarter earnings on Monday. Its revenue declined 7% annually to 22.5 billion yuan ($3.2 billion) but beat expectations by $90 million.Its adjusted net income jumped 219% to 3.1 billion yuan ($435 million), or $1.25 per ADS -- which crushed expectations by $0.69. Its adjusted EBITDA, which excluded certain one-time gains and losses, rose 61% to 2.9 billion yuan ($403 million).Baidu expects between a 5% loss and a 4% gain in annual revenue growth in the second quarter. That's a broad range, but it suggests the company passed a cyclical trough in the first quarter. Its profit growth also suggests its dependence on iQiyi (NASDAQ: IQ) isn't denting its margins.Do those improvements indicate it's finally safe to buy Baidu's stock, which tumbled 40% over the past three years due to tough competition in online ads, a slowdown in the Chinese economy, an escalating trade war, and the COVID-19 crisis?END", "END", "Sogou (NYSE: SOGO) controls 18% of China's online search market, according to StatCounter, placing it in second place behind Baidu's (NASDAQ: BIDU) 65% share. Competing against Baidu has been tough for Sogou, which is backed by Tencent (OTC: TCEHY) and its former parent company Sohu, but it continues to grow in the tech giant's shadow.Sogou recently posted its first-quarter numbers, which bore the full impact of the COVID-19 lockdowns across China. Its revenue grew 2% annually to $257.3 million, beating estimates by $6.6 million. Its non-GAAP net loss widened from $2.7 million to $31.1 million, or $0.08 per share -- but still matched analysts' expectations.For the second quarter, Sogou expects its revenue to decline 8%-14% annually due to the impact of COVID-19, the contraction of the Chinese economy, and other macro and advertising-industry challenges.That decline wasn't surprising since Baidu also recently posted a 19% annual drop in its ad revenue in its first quarter. But will Sogou emerge from the crisis a stronger company, or will the macro headwinds weaken its defenses against Baidu and other competitors in China's crowded advertising market?END", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThThe S&P 500 was trading flat on Tuesday, handing back some gains from a strong rally in the previous session, as investors digested a mixed set of quarterly results from retailers including Home Depot and Walmart. .NAt 11:01 ET, the Dow Jones Industrial Average .DJI was down 0.35% at 24,512.1. The S&P 500 .SPX was down 0.25% at 2,946.65 and the Nasdaq Composite .IXIC was up 0.62% at 9,292.181.   The top three S&P 500 .PG.INX percentage gainers:  ** Advance Auto Parts Inc <AAP.N>, up 4.7%  ** Cadence Design Systems Inc <CDNS.O>, up 4.2 %  ** Take-Two Interactive Software Inc <TTWO.O>, up 3.9%   The top three S&P 500 .PL.INX percentage losers:  ** Kohl's Corp <KSS.N>, down 9.5%  ** Nordstrom Inc <JWN.N>, down 5.3%  ** TechnipFMC Plc <FTI.N>, down 5%   The top three NYSE .PG.N percentage gainers:  ** Dycom Industries Inc <DY.N>, up 23.5%  ** Direxion Daily Consumer Discretionary Bull 3X <WANT.N>, up 15.5%  ** Direxion Daily Small Cap Bull 2x Shares <SMLL.N>, up 14.4%   The top three NYSE .PL.N percentage losers:  ** Timber Pharmaceuticals Inc <TMBR.N>, down 31.4%  ** FTS Internationl Inc <FTSI.N>, down 10.4%  ** Carvana Co <CVNA.N>, down 9.5%   The top three Nasdaq .PG.O percentage gainers:  ** Shiftpixy Inc <PIXY.O>, up 80.9%  ** Mercurity Fintech Holdings Inc <MFH.O>, up 44.3%  ** Dynavax Technologies Corp <DVAX.O>, up 27%   The top three Nasdaq .PL.O percentage losers:  ** Gamida Cell Ltd <GMDA.O>, down 24.2%  ** Bellerophon Therapeutics Inc <BLPH.O>, down 17%  ** Sorrento Therapeutics Inc <SRNE.O>, down 16.6%     ** Carvana Co CVNA.N: down 9.6%END", "In trading on Tuesday, shares of Baidu Inc (Symbol: BIDU) crossed above their 200 day moving average of $111.81, changing hands as high as $120.85 per share.  Baidu Inc shares are currently trading up about 4.8% on the day.  The chart below shows the one year performance of BIDU shares, versus its 200 day moving average:\n\n   END", "In early trading on Tuesday, shares of Baidu topped the list of the day's best performing components of the Nasdaq 100 index, trading up 8.1%.  Year to date, Baidu has lost about 8.0% of its value.\n\nAnd the worst performing Nasdaq 100 component thus far on the day is T-Mobile, trading down 3.1%.  T-Mobile is showing a gain of 25.8% looking at the year to date performance.\n\nTwo other components making moves today are Ulta Beauty, trading down 3.1%, and NVIDIA, trading up 3.1% on the day.\n\n \n\n\n\n\n\n\n\nVIDEO: Nasdaq 100 Movers: TMUS, BIDU\nEND", "It remains to be seen when Baidu (NASDAQ: BIDU) will get back on the growth track, and with the shares trading lower for the third year in a row it's easy to wax nostalgic about the glory days. However, with shares of China's leading search engine operator moving sharply higher after posting a better-than-expected earnings report on Monday night one has to wonder if the former dot-com darling is finally ready to start winning again.Baidu's first quarter may not seem solid at first glance. Total revenue declined 7% in the first quarter, with Baidu Core -- its flagship search, feed, and AI businesses -- checking in with a 13% slide. The good news is that investors were bracing for worse. Given the early and thorough impact of COVID-19 in China, Baidu's own guidance for the period was calling for a 5% to 13% year-over-year slide in total revenue with a 10% to 18% plunge in Baidu Core. Baidu landed at the kinder end of the midpoint of both of those ranges, and that was with the initial outlook in late February. The global situation with the pandemic naturally got even worse in the third and final month of the quarter. Baidu's $3.18 billion in revenue for the quarter was comfortably ahead of the $3.1 billion analysts were targeting. END", "(RTTNews) - Shares of Baidu, Inc. (BIDU), Chinese technology company specializing in Internet-related services and products and artificial intelligence, are climbing more than 9% Tuesday morning on the back of upbeat first-quarter results.\"In March, a month after the peak of COVID-19 new cases, Baidu's traffic remained robust with Baidu App DAUs reaching 222 million, up 28% year over year, in-app search queries up 45% and feed time spent up 51%. With the pandemic coming under control in China, offline activities are rebounding and Baidu stands to benefit from a restart of the Chinese economy, \" said Robin Li, Co-founder, and CEO of Baidu. Adjusted earnings of $1.25 per ADS for the first quarter beat the average estimate of analysts polled by Thomson Reuters at $0.57.Revenues were RMB 22.5 billion ($3.18 billion), decreased 7% year over year. The consensus estimate was at $3.1 billion.END", "END", "Technology stocks were flat to higher premarket Tuesday as the SPDR S&P Semiconductor (XSD) was unchanged and the Technology Select Sector SPDR ETF (XLK) was 0.20% higher in recent trading.Baidu (BIDU) was climbing past 10% after posting Q1 non-GAAP earnings of RMB8.84 ($1.25) per ADS, up from RMB2.77 per ADS reported a year earlier. Analysts polled by Capital IQ had projected RMB3.98 per ADS.Sina (SINA) was advancing more than 6% as it reported Q1 non-GAAP EPS of $0.25 compared with $0.40 in the earlier-year period. Analysts surveyed by Capital IQ were expecting adjusted EPS of $0.14.iQIYI (IQ) was down more than 4% after it posted a Q1 loss of RMB3.92 ($0.55) per ADS, widening from RMB2.52 loss in the year-ago period. Revenue in the quarter increased to RMB7.65 billion from RMB6.99 billion. Analysts polled by Capital IQ had  expected a loss of RMB3.20 and revenue of RMB7.27 billion.END", "END", "END", "(RTTNews) - Below are the earnings highlights for Baidu.com Inc. (BIDU):-Earnings: RMB41 million in Q1 vs. -RMB327 million in the same period last year. \n-EPS: RMB0.02 in Q1 vs. -RMB0.98 in the same period last year. \n-Excluding items, Baidu.com Inc. reported adjusted earnings of RMB3082 million or RMB8.84 per share for the period. \n-Revenue: RMB22.45 billion in Q1 vs. RMB24.12 billion in the same period last year.\n The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsEquities surged at the open and trended higher for most of the day. Let’s look at a few top stock trades after the powerful move.END", "Adds details on forecast; sharesMay 18 (Reuters) - Chinese search engine giant Baidu Inc BIDU.O forecast second-quarter revenue above expectations after beating earnings estimates, as the world's second-largest economy reopens after lockdowns imposed to curb the spread of the coronavirus.The company's U.S.-listed shares were up 5% in extended trading on Monday.\"With the pandemic coming under control in China, offline activities are rebounding and Baidu stands to benefit from a restart of the Chinese economy,\" Chief Executive Officer Robin Li said in a statement.Baidu, whose search engine dominates the market in China,  forecast second-quarter revenue between 25.0 billion yuan and 27.3 billion yuan, while analysts on average had expected 25.55 billion yuan, according to IBES data from Refinitiv.END", "(RTTNews) - Baidu.com Inc. (BIDU) Monday reported first-quarter net income of RMB41 million or RMB0.02 per share, compared with net loss of RMB327 million or RMB0.98 per share in last year's first quarter.Excluding items, Baidu.com reported adjusted earnings of RMB3.08 billion or RMB8.84 per share for the period, compared with RMB967 million or RMB2.77 per share.The company's revenue for the quarter dropped 7% to RMB222.55 billion from RMB24.12 billion last year.\"Despite shelter-in-place in the first quarter, Baidu's total revenues declined just 7% year-over-year, resulting from our diversified revenue streams, including marketing services for wide-ranging industries, new AI businesses and iQIYI. With the pandemic coming under control in China, offline activities are rebounding and Baidu stands to benefit from a restart of the Chinese economy.\" said Robin Li, Co-founder and CEO of Baidu.END", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThU.S. stock index futures were trading flat on Tuesday, handing back some gains from the S&P 500's best day in six weeks in the previous session, as investors digested a mixed set of quarterly results from retailers including Home Depot and Walmart..NAt 9:01 ET, Dow e-minis 1YMc1 were down 0.06% at 24,493. S&P 500 e-minis ESc1 were down 0.20% at 2,942.25, while Nasdaq 100 e-minis NQc1 were up 0.09% at 9,333.5.   The top three NYSE percentage gainers premarket .PRPG.NQ:  ** Flotek Industries Inc <FTK.N>, up 24.3%  ** Armstrong Flooring Inc <AFI.N>, up 15.6%  ** PAR Technology Corp <PAR.N>, up 12.0%   The top three NYSE percentage losers premarket .PRPL.NQ:  ** Four Seasons Edu Inc <FEDU.N>, down 22.1%  ** Hexo Corp <HEXO.N>, down 14.2%  ** Crescent Point Energy Corp <CPG.N>, down 8.4%   The top three Nasdaq percentage gainers premarket .PRPG.O:  ** Immuron Equity Warrants <IMRNW.O>, up 113.1%  ** Nano Dimension Ltd <NNDM.O>, up 59.8%  ** Kirkland's Inc <KIRK.O>, up 47.2%   The top three Nasdaq percentage losers premarket .PRPL.O:  ** Gamida Cell Ltd <GMDA.O>, down 24.4%  ** Zions Bancorporation NA <ZIONW.O>, down 19.9%  ** Gossamer Bio Inc <GOSS.O>, down 15.8%    ** PBF Energy Inc PBF.N: down 1.8% premarket  BUZZ-Barclays cuts to 'underweight' on constrained FCF outlook, leverage    ** Dynavax Technologies Inc DVAX.O: up 40.5% premarket  BUZZ-Up after co says partners may begin COVID-19 vaccine trial in July   ** Home Depot Inc HD.N: down 1.2% premarket  BUZZ-Profit misses estimates; scraps FY outlook    ** Tilray Inc TLRY.O: up 2.9% premarket  BUZZ-Road to profitability a long haul for pot producer - brokerage   ** Arbutus Biopharama Corp ABUS.O: up 35.8% premarket  BUZZ-Jumps on positive data from hepatitis B treatment study    ** Moderna Inc MRNA.O: down 3.9% premarket  BUZZ-Slips after pricing upsized stock offering to fund COVID-19 vaccine    ** Aptiv Plc APTV.N: up 0.6% premarket  BUZZ- \"Longer pain but sharper recovery\" - UBS    ** Flotek Industries Inc FTK.N: up 24.3% premarket  BUZZ-Rises on acquisition of data and analytics firm    ** Bilibili Inc BILI.O: down 2% premarket  BUZZ-Falls on bigger-than-expected Q1 loss as marketing spend soars   ** Baidu Inc BIDU.O: up 11% premarket  BUZZ-Jefferies sees continued revenue growth in H2, raises PT    ** Advance Auto Parts Inc AAP.N: up 7.3% premarket  BUZZ-Surges as Q2 same store sales look promising    ** Walgreens Boots Alliance Inc WBA.O: up 0.6% premarket  BUZZ-Underperformance due to COVID-19 is overdone: Cowen    ** Tonix Pharmaceuticals Holding Corp TNXP.O: up 5.5% premarket  BUZZ-Up after appointing new exec to advance COVID-19 vaccine program    ** Oric Pharmaceuticals Inc ORIC.O: up 1.9% premarket  BUZZ-Guggenheim sees potential in trial cancer drug, starts with 'buy'    ** Southwest Airlines Co LUV.N: up 4% premarket  BUZZ-Rises on improving demand for air travel   ** Walmart Inc WMT.N: up 3.8% premarket  BUZZ-Set to open at 4-week high as stockpiling drives Q1 beat    ** Danaos Corp DAC.N: up 11.1% premarket  BUZZ-Rises on upbeat Q1, says no impact from COVID-19 yet    ** Moderna Inc MRNA.O: down 3.9% premarket  ** Bluebird Bio Inc BLUE.O: down 1% premarket  ** Turning Point Therapeutics Inc TPTX.O: down 6.5% premarket  ** Gossamer Bio Inc GOSS.O: down 15.8% premarket  ** Krystal Biotech Inc KRYS.O: down 3.2% premarket  ** Clovis Oncology Inc CLVS.O: down 6.6% premarket  ** Bellerophon Therapeutics Inc BLPH.O: down 14.2% premarket  BUZZ-Biotech blitz: Moderna, Bluebird lead $3 bln capital raise wave    ** KemPharm Inc KMPH.O: up 15.6% premarket  BUZZ-Rises as FDA agrees to review ADHD drug    ** Take-Two Interactive Software Inc TTWO.O: up 1.2% premarket  BUZZ-Gains as Benchmark raises PT, sees Q4 results beatEND", "Despite boasting a strong balance sheet and tons of cash flow generated each quarter, the market has not valued Baidu (BIDU) in the same realm of its American counterparts such as Google (GOOG , GOOGL). Baidu has had a rough few years with its shares falling 35% and 46% over the past one year and three years, respectively.But now might be a good time to bet on a recovery. The Chinese tech giant Baidu is set to report first quarter fiscal 2020 earning results after the closing bell Monday. Baidu shares have fallen about 5% over the past month, while the S&P 500 index has been roughly flat. But sentiment is beginning to shift. The company, at the end of March, offered some optimism, saying it expected its ad business would recover from late in Q2.The company generates over three-quarters of its revenue from Baidu Core, with revenues growing 3% sequentially and 6% year over year. The remaining revenue comes from video streaming platform iQIYI (IQ) in which Baidu owns a 48% stake. These growth catalysts are on top of Baidu’s increased investments in its core search business, cloud, artificial intelligence and autonomous driving. On Monday, the Street will want to know how the coronavirus has impacted these business.While the company has noticed some improvement in its business (quarter over quarter), it still expects revenue to decline year over year, per its late-February guidance. Following its Q4 top-and bottom-line beat, the company warned that virus-related slowdowns could impact revenue for the just-ended quarter. For opportunistic investors, the main question is whether the projected revenue and profits declines are already priced into the stock.END", "Adds context, investor commentsHONG KONG, May 18 (Reuters) - The Hang Seng Index .HSI made rule changes on Monday to allow it to incorporate Chinese internet giants Alibaba BABA.N, 9988.HK, Xiaomi 1810.HK and Meituan Dianping 3690.HK, a move set to shake up the composition of the 50-year-old index.The benchmark in the Asian financial hub is dominated by financial services institutions and conglomerates such as HSBC 0005.HK and CK Hutchison 0001.HK.\"There is a perception that local indices like Hang Seng aren't necessarily reflective of the opportunity set available out there,\" said Michael Lai, China equities portfolio manager at Franklin Templeton.\"(Inclusion) would be a reflection of how the Chinese markets, companies have developed.\"END", "Stocks ended Friday higher, despite downbeat economic data showing the level of devastation the coronavirus has unleashed on retailers and consumer confidence. It would seem the shrug of the market is based on the idea that the U.S. economy can't get any worse. But is that the right approach, given the number the Americans currently out of work?April retail sales plunged 16.4%, suffering their biggest decline on record. With much of the country shut down in April, not only did producer and consumer prices plunge, industrial production also declined. The dismal retail data is consistent with the dire unemployment we’ve seen which has steadily risen. Even amid the onslaught of negative data, the stock market has rallied some 30% from the March lows. This is notable as several retail heavyweights are due to report earnings results this coming week.On Friday the Dow Jones Industrial Average rose 61 points, or less than 0.3%, to close at 23,685.42. The S&P 500 index added 11.20 points, or 0.4% to end the session at 2,863.70, while the Nasdaq Composite Index closed at 9,014.56 after gaining 70.84 points. Earlier in the day, the averages had each fallen more than 1% after the Trump administration ratcheted up trade tensions with China by moving to block semiconductor shipments to China's Huawei from global chipmakers.China immediately responded with a Global Times report suggesting China would put U.S. companies including Apple (AAPL), Cisco (CSCO) and Qualcomm (QCOM) on an \"unreliable entity list.” The report also suggested China could suspend purchase of Boeing (BA) airplanes. Despite the slight bounce, stocks ended the week lower, with the Dow down 2.7%, the S&P 500 losing 2.3% and the Nasdaq 1.2% lower. Some analysts still think by year's end the markets will be higher.END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares Core MSCI Emerging Markets ETF (Symbol: IEMG) where we have detected an approximate $600.9 million dollar outflow -- that's a 1.3% decrease week over week (from 1,059,600,000 to 1,045,800,000).  Among the largest underlying components of IEMG, in trading today Baidu Inc (Symbol: BIDU) is up about 0.8%, NetEase, Inc (Symbol: NTES) is up about 3.9%, and TAL Education Group (Symbol: TAL) is up by about 1.4%. For a complete list of holdings, visit the IEMG Holdings page » \n\nThe chart below shows the one year price performance of IEMG, versus its 200 day moving average:\n   \n\nEND", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsOne of the fun parts about investing is finding companies that aren’t meeting their potential and seizing the opportunity for dramatic growth. Alibaba (NYSE:BABA) stock is one of those investments that fits the bill.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsStrong first-quarter earnings reports from multiple tech companies demonstrated the power of stay-at-home headwinds for online business. As the economy and markets face massive interruptions over the current pandemic, the gap between companies thriving during the pandemic and those feeling the pain will only get wider.So technology companies that grew their online business and developed cutting edge solutions will get more business. Retail firms relying on a physical presence, automotive showrooms and restaurants will have trouble adapting.Yet this generalized view excludes the businesses in the latter group that are embracing technology to get a competitive edge. For example, restaurants that use technology to handle online orders and food delivery will likely thrive. So it makes sense then, that technology investors will want to hone in on companies that are embracing megatrends like AI, 5G, and cybersecurity.END", "By Kane Wu and Yilei SunHONG KONG/BEIJING, May 12(Reuters) - Challenged by the arrival of Tesla in China last year, domestic electric vehicle (EV) start-ups were struggling even before the economic shock wrought by the coronavirus, but now for some it has become a battle for survival.New energy vehicle (NEVs) sales fell for a tenth straight month in April, plummeting 43% from a year earlier in a market that has now got 50-or-so established start-ups competing with domestic giants like Geely GEELY.UL, state-owned FAW Group SASACJ.UL, and foreign marques like Tesla Inc TSLA.O and Volkswagen AG VOWG_p.DE. \"The difficulties that EV start-ups have encountered, such as the auto sales decline, harsh fundraising environment and subsidies reduction, all started last year,\" said Brian Gu, president of Alibaba-backed BABA.N Xpeng Motors.\"The outbreak will aggravate these issues that already had existed,\" said Gu, whose firm delivered 16,000 vehicles in 2019.END", "May 18 (Reuters) - China's search engine giant Baidu Inc BIDU.O beat analysts' estimates for quarterly revenue on Monday, as its video streaming platform iQIYI IQ.O benefited from strong demand from people forced to stay at home to curb the spread of the coronavirus.Total revenue fell to 22.55 billion yuan ($3.17 billion) from 24.12 billion yuan a year earlier. Analysts on average had expected revenue of 21.93 billion yuan, according to IBES data from Refinitiv. The company in February estimated revenue between 21 billion yuan and 22.9 billion yuan. ($1 = 7.1086 Chinese yuan renminbi)(Reporting by Akanksha Rana in Bengaluru and Yingzhi Yang in Beijing; Editing by Krishna Chandra Eluri)END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares Core MSCI Total International Stock ETF (Symbol: IXUS) where we have detected an approximate $221.5 million dollar inflow -- that's a 1.3% increase week over week in outstanding units (from 334,700,000 to 339,200,000).  Among the largest underlying components of IXUS, in trading today Alibaba Group Holding Ltd (Symbol: BABA) is up about 2.1%, JD.com, Inc. (Symbol: JD) is up about 4.1%, and Baidu Inc (Symbol: BIDU) is up by about 1.4%. For a complete list of holdings, visit the IXUS Holdings page » \n\nThe chart below shows the one year price performance of IXUS, versus its 200 day moving average:\n   \n\nEND"]}