{"Title": ["iShares Nasdaq Biotechnology ETF Experiences Big Inflow", "Despite Recent Speed Bumps, Biogen's Stock Will Soon Grow Again", "Vir Biotechnology Is Bucking The Biotech COVID-19 Trends, And Stands To Win", "Got $3,000? Here Are 3 Great Biotech Stocks to Buy Right Now", "Better Buy: Biogen vs. Axsome Therapeutics", "Noteworthy ETF Outflows: IVE, IBM, FIS, BIIB", "7 Top-Rated Biotech Stocks to Buy on the Hunt for a Vaccine", "Nothing Will Stop Biogen Stock From Moving Higher", "iShares Nasdaq Biotechnology ETF Experiences Big Inflow", "Validea's Top Five Healthcare Stocks Based On Peter Lynch - 5/17/2020", "Validea's Top Five Healthcare Stocks Based On Warren Buffett - 5/17/2020", "Noteworthy ETF Outflows: MTUM, AMD, BIIB, HUM", "5 Stocks Buffett Probably Bought in the First Quarter", "The All-Important Question Buffett Will Answer This Week", "BUZZ-U.S. STOCKS ON THE MOVE-GM, Axcella, Beyond Meat, SmileDirect", "Apple Sells $8.5 Billion in Bonds to Fuel Share Buybacks", "Validea's Top Five Healthcare Stocks Based On Joel Greenblatt - 5/17/2020", "Health Care Sector Update for 05/04/2020: EGRX,VIR,RARE,TEVA,BIIB", "Health Care Sector Update for 05/04/2020: VIR,RARE,TEVA,BIIB", "Why Biogen Shares Fell 6.18% in April", "Has Biogen Found the Answer to Treating Alzheimer's?", "IBB, GILD, VRTX, BIIB: ETF Inflow Alert", "Better Buy: Cara Therapeutics vs. Sangamo Therapeutics", "At least 14 borrowers rush into US high-grade primary", "Apple borrows on the cheap to fund buybacks, dividends", "3 Big Stock Charts for Thursday: Snap, Biogen, and L Brands", "Japanese shares snap 3-day losing streak as battered stocks bought back", "Biogen Reports First-Quarter Results, Shares Plunge 9.4%", "Biogen Inc (BIIB) Q1 2020 Earnings Call Transcript", "Health Care Sector Update for 04/22/2020: BIIB,IMMU,PRTA,VBIV", "Noteworthy Wednesday Option Activity: CNNE, BIIB, SFNC", "Johnson & Johnson and AbbVie Earn a New FDA Approval for Imbruvica", "Analysts Forecast 13% Upside For The Holdings of TOK", "Why Biogen Stock Is Sinking Today", "Noteworthy ETF Inflows: IBB, VRTX, BIIB, REGN", "Nasdaq 100 Movers: BIIB, LRCX", "S&P 500 Movers: BIIB, EXPE", "Health Care Sector Update for 04/22/2020: BNTX, PFE, TMO, BIIB, XLV, IBB, VHT, IYH", "BUZZ-U.S. STOCKS ON THE MOVE-SAExploration Holdings, Unit Corp, Expedia Group", "Biogen delays Alzheimer's drug filing plans, shares fall", "BUZZ-U.S. STOCKS ON THE MOVE-Snap, Peck Company, VBI Vaccines", "Biogen posts marginal rise in first-quarter sales", "Biogen Q1 20 Earnings Conference Call At 8:00 AM ET", "BUZZ-U.S. STOCKS ON THE MOVE-Co-Diagnostics, Xeris Pharma, Cyclacel Pharma", "BUZZ-U.S. STOCKS ON THE MOVE-DuPont, Occidental Petroleum, Safe-T Group", "BUZZ-U.S. STOCKS ON THE MOVE-Safe-T Group, Ford Motor, Facebook", "Validea's Top Five Healthcare Stocks Based On Martin Zweig - 4/19/2020", "Validea's Top Five Healthcare Stocks Based On Peter Lynch - 4/19/2020", "Biogen Q1 Results Top Estimates - Quick Facts", "Biogen Reaches Analyst Target Price"], "Elapsed Time": ["1 HOUR AGO", "3 HOURS AGO", "3 DAYS AGO", "6 DAYS AGO", "MAY 23, 2020", "MAY 22, 2020", "MAY 22, 2020", "MAY 19, 2020", "1 HOUR AGO", "MAY 17, 2020", "MAY 17, 2020", "MAY 13, 2020", "MAY 12, 2020", "MAY 11, 2020", "MAY 6, 2020", "MAY 5, 2020", "MAY 17, 2020", "MAY 4, 2020", "MAY 4, 2020", "MAY 4, 2020", "MAY 1, 2020", "APR 30, 2020", "APR 29, 2020", "APR 27, 2020", "MAY 4, 2020", "APR 23, 2020", "APR 23, 2020", "APR 22, 2020", "APR 22, 2020", "APR 22, 2020", "APR 22, 2020", "APR 22, 2020", "APR 24, 2020", "APR 22, 2020", "APR 22, 2020", "APR 22, 2020", "APR 22, 2020", "APR 22, 2020", "APR 22, 2020", "APR 22, 2020", "APR 22, 2020", "APR 22, 2020", "APR 22, 2020", "APR 20, 2020", "APR 20, 2020", "APR 20, 2020", "APR 19, 2020", "APR 19, 2020", "APR 22, 2020", "APR 17, 2020"], "Published Date": ["Jun 4, 2020 10:51AM EDT", "Jun 4, 2020 9:11AM EDT", "Jun 1, 2020 12:23PM EDT", "May 29, 2020 7:03AM EDT", "May 23, 2020 7:36AM EDT", "May 22, 2020 10:50AM EDT", "May 22, 2020 9:05AM EDT", "May 19, 2020 12:44PM EDT", "Jun 4, 2020 10:51AM EDT", "May 17, 2020 11:00AM EDT", "May 17, 2020 11:00AM EDT", "May 13, 2020 10:52AM EDT", "May 12, 2020 6:06AM EDT", "May 11, 2020 6:06AM EDT", "May 6, 2020 1:46PM EDT", "May 5, 2020 12:22PM EDT", "May 17, 2020 11:00AM EDT", "May 4, 2020 4:02PM EDT", "May 4, 2020 1:58PM EDT", "May 4, 2020 10:38AM EDT", "May 1, 2020 6:55AM EDT", "Apr 30, 2020 11:00AM EDT", "Apr 29, 2020 7:14AM EDT", "Apr 27, 2020 9:52AM EDT", "May 4, 2020 7:57PM EDT", "Apr 23, 2020 7:47AM EDT", "Apr 23, 2020 3:02AM EDT", "Apr 22, 2020 4:42PM EDT", "Apr 22, 2020 4:30PM EDT", "Apr 22, 2020 3:51PM EDT", "Apr 22, 2020 3:20PM EDT", "Apr 22, 2020 2:48PM EDT", "Apr 24, 2020 9:19AM EDT", "Apr 22, 2020 11:18AM EDT", "Apr 22, 2020 10:57AM EDT", "Apr 22, 2020 10:20AM EDT", "Apr 22, 2020 10:19AM EDT", "Apr 22, 2020 9:16AM EDT", "Apr 22, 2020 8:22AM EDT", "Apr 22, 2020 7:46AM EDT", "Apr 22, 2020 11:24AM EDT", "Apr 22, 2020 7:13AM EDT", "Apr 22, 2020 7:00AM EDT", "Apr 20, 2020 1:14PM EDT", "Apr 20, 2020 11:36AM EDT", "Apr 20, 2020 8:35AM EDT", "Apr 19, 2020 11:00AM EDT", "Apr 19, 2020 11:00AM EDT", "Apr 22, 2020 7:39AM EDT", "Apr 17, 2020 8:31AM EDT"], "Link": ["https://www.nasdaq.com/articles/ishares-nasdaq-biotechnology-etf-experiences-big-inflow-2020-06-04", "https://www.nasdaq.com/articles/despite-recent-speed-bumps-biogens-stock-will-soon-grow-again-2020-06-04", "https://www.nasdaq.com/articles/vir-biotechnology-is-bucking-the-biotech-covid-19-trends-and-stands-to-win-2020-06-01", "https://www.nasdaq.com/articles/got-%243000-here-are-3-great-biotech-stocks-to-buy-right-now-2020-05-29", "https://www.nasdaq.com/articles/better-buy%3A-biogen-vs.-axsome-therapeutics-2020-05-23", "https://www.nasdaq.com/articles/noteworthy-etf-outflows%3A-ive-ibm-fis-biib-2020-05-22", "https://www.nasdaq.com/articles/7-top-rated-biotech-stocks-to-buy-on-the-hunt-for-a-vaccine-2020-05-22", "https://www.nasdaq.com/articles/nothing-will-stop-biogen-stock-from-moving-higher-2020-05-19", "https://www.nasdaq.com/articles/ishares-nasdaq-biotechnology-etf-experiences-big-inflow-2020-06-04", "https://www.nasdaq.com/articles/valideas-top-five-healthcare-stocks-based-on-peter-lynch-5-17-2020-2020-05-17", "https://www.nasdaq.com/articles/valideas-top-five-healthcare-stocks-based-on-warren-buffett-5-17-2020-2020-05-17", "https://www.nasdaq.com/articles/noteworthy-etf-outflows%3A-mtum-amd-biib-hum-2020-05-13", "https://www.nasdaq.com/articles/5-stocks-buffett-probably-bought-in-the-first-quarter-2020-05-12", "https://www.nasdaq.com/articles/the-all-important-question-buffett-will-answer-this-week-2020-05-11", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-gm-axcella-beyond-meat-smiledirect-2020-05-06", "https://www.nasdaq.com/articles/apple-sells-%248.5-billion-in-bonds-to-fuel-share-buybacks-2020-05-05", "https://www.nasdaq.com/articles/valideas-top-five-healthcare-stocks-based-on-joel-greenblatt-5-17-2020-2020-05-17", "https://www.nasdaq.com/articles/health-care-sector-update-for-05-04-2020%3A-egrxvirraretevabiib-2020-05-04", "https://www.nasdaq.com/articles/health-care-sector-update-for-05-04-2020%3A-virraretevabiib-2020-05-04", "https://www.nasdaq.com/articles/why-biogen-shares-fell-6.18-in-april-2020-05-04", "https://www.nasdaq.com/articles/has-biogen-found-the-answer-to-treating-alzheimers-2020-05-01", "https://www.nasdaq.com/articles/ibb-gild-vrtx-biib%3A-etf-inflow-alert-2020-04-30", "https://www.nasdaq.com/articles/better-buy%3A-cara-therapeutics-vs.-sangamo-therapeutics-2020-04-29", "https://www.nasdaq.com/articles/at-least-14-borrowers-rush-into-us-high-grade-primary-2020-04-27", "https://www.nasdaq.com/articles/apple-borrows-on-the-cheap-to-fund-buybacks-dividends-2020-05-04", "https://www.nasdaq.com/articles/3-big-stock-charts-for-thursday%3A-snap-biogen-and-l-brands-2020-04-23", "https://www.nasdaq.com/articles/japanese-shares-snap-3-day-losing-streak-as-battered-stocks-bought-back-2020-04-23", "https://www.nasdaq.com/articles/biogen-reports-first-quarter-results-shares-plunge-9.4-2020-04-22", "https://www.nasdaq.com/articles/biogen-inc-biib-q1-2020-earnings-call-transcript-2020-04-22", "https://www.nasdaq.com/articles/health-care-sector-update-for-04-22-2020%3A-biibimmuprtavbiv-2020-04-22", "https://www.nasdaq.com/articles/noteworthy-wednesday-option-activity%3A-cnne-biib-sfnc-2020-04-22", "https://www.nasdaq.com/articles/johnson-johnson-and-abbvie-earn-a-new-fda-approval-for-imbruvica-2020-04-22", "https://www.nasdaq.com/articles/analysts-forecast-13-upside-for-the-holdings-of-tok-2020-04-24", "https://www.nasdaq.com/articles/why-biogen-stock-is-sinking-today-2020-04-22", "https://www.nasdaq.com/articles/noteworthy-etf-inflows%3A-ibb-vrtx-biib-regn-2020-04-22", "https://www.nasdaq.com/articles/nasdaq-100-movers%3A-biib-lrcx-2020-04-22", "https://www.nasdaq.com/articles/sp-500-movers%3A-biib-expe-2020-04-22", "https://www.nasdaq.com/articles/health-care-sector-update-for-04-22-2020%3A-bntx-pfe-tmo-biib-xlv-ibb-vht-iyh-2020-04-22", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-saexploration-holdings-unit-corp-expedia-group-2020-04-22", "https://www.nasdaq.com/articles/biogen-delays-alzheimers-drug-filing-plans-shares-fall-2020-04-22", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-snap-peck-company-vbi-vaccines-2020-04-22", "https://www.nasdaq.com/articles/biogen-posts-marginal-rise-in-first-quarter-sales-2020-04-22", "https://www.nasdaq.com/articles/biogen-q1-20-earnings-conference-call-at-8%3A00-am-et-2020-04-22", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-co-diagnostics-xeris-pharma-cyclacel-pharma-2020-04-20", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-dupont-occidental-petroleum-safe-t-group-2020-04-20", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-safe-t-group-ford-motor-facebook-2020-04-20", "https://www.nasdaq.com/articles/valideas-top-five-healthcare-stocks-based-on-martin-zweig-4-19-2020-2020-04-19", "https://www.nasdaq.com/articles/valideas-top-five-healthcare-stocks-based-on-peter-lynch-4-19-2020-2020-04-19", "https://www.nasdaq.com/articles/biogen-q1-results-top-estimates-quick-facts-2020-04-22", "https://www.nasdaq.com/articles/biogen-reaches-analyst-target-price-2020-04-17"], "Content": ["Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares Nasdaq Biotechnology ETF (Symbol: IBB) where we have detected an approximate $185.7 million dollar inflow -- that's a 2.1% increase week over week in outstanding units (from 65,200,000 to 66,600,000).  Among the largest underlying components of IBB, in trading today Vertex Pharmaceuticals, Inc. (Symbol: VRTX) is up about 0.3%, Biogen Inc (Symbol: BIIB) is down about 0.3%, and Illumina Inc (Symbol: ILMN) is up by about 0.4%. For a complete list of holdings, visit the IBB Holdings page » \n\nThe chart below shows the one year price performance of IBB, versus its 200 day moving average:\n   \n\nEND", "Biogen (NASDAQ: BIIB) hasn't been the world's most reliable biotech stock over the past five years. Major setbacks in its Alzheimer's disease drug-development pipeline have crimped growth, and the withdrawal from the market of its multiple sclerosis drug Zinbryta caused potential investors to be skeptical. Indeed, investing in Biogen in 2016 and selling today would have meant a loss of 16.6%. The company offers no dividends, nor does it plan to. Unlike other biotech companies of a similar size, Biogen doesn't develop drugs in lucrative disease areas -- think oncology, hypertension, or arthritis. As a result, the company has few prospects of developing a blockbuster drug for a mass market.Is there a case to be made for a long-term investment in Biogen, given that its stock's recent performance has been decidedly poor? END", "Thanks to its newly announced COVID-19 antibody therapy candidates, Vir Biotechnology's (NASDAQ: VIR) stock is still up more than 10% from the beginning of May and more than 180% from the start of the year. On top of its recent gains, there's reason to believe that Vir is positioned perfectly for continued growth.While the company has a long way to go before it reaches profitability, between its low-risk pipeline programs for COVID-19 and a demonstrated competency for preclinical drug development for infectious disease, Vir's future seems bright. END", "In case you haven't noticed, biotech is a pretty hot area for investors right now. While the broader market indexes are still down year to date despite strong rebounds in recent weeks, the major biotech exchange-traded funds (ETFs) are in solid positive territory for the year.Granted, not all biotech stocks are doing well. But even some of the current laggards could be tremendous winners over the next five years. If you've got $3,000 to invest, here are three great biotech stocks to buy right now that have what it takes for long-term success.END", "If you've seen one biotech, you've seen... one biotech. They're all different, with unique opportunities and challenges. And beyond their core differences, their situations vary widely depending on what stage of their business lives they are in. Biogen (NASDAQ: BIIB), for example, is well established. It has made billions of dollars through the years from its multiple sclerosis (MS) franchise and has now expanded into new therapeutic categories. Axsome Therapeutics (NASDAQ: AXSM), on the other hand, is young enough that it doesn't have any approved products on the market yet, but its pipeline includes several highly promising candidates.Which of these two biotech stocks is the better pick for long-term investors? Here's how big Biogen stacks up against up-and-coming Axsome.END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares S&P 500 Value ETF (Symbol: IVE) where we have detected an approximate $231.6 million dollar outflow -- that's a 1.5% decrease week over week (from 145,000,000 to 142,800,000).  Among the largest underlying components of IVE, in trading today International Business Machines Corp (Symbol: IBM) is down about 0.7%, Fidelity National Information Services Inc (Symbol: FIS) is off about 0.4%, and Biogen Inc (Symbol: BIIB) is lower by about 0.4%. For a complete list of holdings, visit the IVE Holdings page » \n\nThe chart below shows the one year price performance of IVE, versus its 200 day moving average:\n   \n\nEND", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsThe novel coronavirus pandemic has wreaked havoc on markets, and just when stocks are into recovery mode, we have the specter of a recession to reckon with. If not an outright depression. That’s going to cause challenges for many sectors. However, if there’s a bright spot in all this, it’s biotech stocks.With the scramble for viral and antibody testing kits, and the ultimate goal of finding a vaccine for Covid-19, many biotech companies are suddenly in the spotlight. Even those that aren’t directly working on a Covid-related solution look more attractive. Besides the entire industry getting more attention than usual, investors know they’re less at risk of a consumer spending crunch that could hit tech companies like Apple (NASDAQ:AAPL).END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsFor the past several months, it seems like traders have focused all of their attention on companies looking for a vaccine for the novel coronavirus. One biotechnology investment that’s not strictly a “coronavirus play,” however, is Biogen (NASDAQ:BIIB) stock.END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares Nasdaq Biotechnology ETF (Symbol: IBB) where we have detected an approximate $185.7 million dollar inflow -- that's a 2.1% increase week over week in outstanding units (from 65,200,000 to 66,600,000).  Among the largest underlying components of IBB, in trading today Vertex Pharmaceuticals, Inc. (Symbol: VRTX) is up about 0.3%, Biogen Inc (Symbol: BIIB) is down about 0.3%, and Illumina Inc (Symbol: ILMN) is up by about 0.4%. For a complete list of holdings, visit the IBB Holdings page » \n\nThe chart below shows the one year price performance of IBB, versus its 200 day moving average:\n   \n\nEND", "The following are the top rated Healthcare stocks according to Validea's P/E/Growth Investor model based on the published strategy of Peter Lynch. This strategy looks for stocks trading at a reasonable price relative to earnings growth that also possess strong balance sheets.ALIGN TECHNOLOGY, INC. (ALGN) is a large-cap value stock in the Medical Equipment & Supplies industry. The rating according to our strategy based on Peter Lynch is 93% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.Company Description: Align Technology, Inc. designs, manufactures and markets a system of clear aligner therapy, intra-oral scanners and computer-aided design/computer-aided manufacturing (CAD/CAM) digital services used in dentistry, orthodontics and dental records storage. The Company operates through two segments: Clear Aligner segment and Scanner and Services (Scanner) segment. The Clear Aligner segment consists of its Invisalign System, which includes Invisalign Full, Teen and Assist (Comprehensive Products), Express/Lite (Non-Comprehensive Products) and Vivera Retainers, along with its training and ancillary products for treating malocclusion (Non-Case). The Scanner segment consists of intra-oral scanning systems and other services available with the intra-oral scanners that provide digital alternatives to the traditional cast models. The Scanner segment includes its iTero scanner and OrthoCAD services.The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.END", "The following are the top rated Healthcare stocks according to Validea's Patient Investor model based on the published strategy of Warren Buffett. This strategy seeks out firms with long-term, predictable profitability and low debt that trade at reasonable valuations.BIOGEN INC (BIIB) is a large-cap value stock in the Biotechnology & Drugs industry. The rating according to our strategy based on Warren Buffett is 86% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.Company Description: Biogen Inc. is a biopharmaceutical company. The Company focuses on discovering, developing, manufacturing and delivering therapies to people living with serious neurological, rare and autoimmune diseases. The Company markets products, including TECFIDERA, AVONEX, PLEGRIDY, TYSABRI, ZINBRYTA and FAMPYRA for multiple sclerosis (MS), FUMADERM for the treatment of severe plaque psoriasis and SPINRAZA for the treatment of spinal muscular atrophy (SMA). It also has a collaboration agreement with Genentech, Inc. (Genentech), a member of the Roche Group, with respect to RITUXAN for the treatment of non-Hodgkin's lymphoma, chronic lymphocytic leukemia (CLL) and other conditions, GAZYVA indicated for the treatment of CLL and follicular lymphoma, and other anti-CD20 therapies. The Company's product candidate includes OCREVUS; Biosimilar adalimumab; Aducanumab; E2609; BIIB074; BAN2401; Opicinumab; CIRARA; BIIB061; BIIB054; BIIB067, and BIIB068.The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares Edge MSCI USA Momentum Factor ETF (Symbol: MTUM) where we have detected an approximate $242.3 million dollar outflow -- that's a 2.6% decrease week over week (from 75,700,000 to 73,700,000).  Among the largest underlying components of MTUM, in trading today Advanced Micro Devices Inc (Symbol: AMD) is up about 2%, Biogen Inc (Symbol: BIIB) is up about 1.5%, and Humana Inc. (Symbol: HUM) is lower by about 1.5%. For a complete list of holdings, visit the MTUM Holdings page » \n\nThe chart below shows the one year price performance of MTUM, versus its 200 day moving average:\n   \n\nEND", "May is a big month for Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) investors and all-around fans of Warren Buffett.On May 2, Berkshire held its annual meeting, with Buffett providing his usual doses of insight on the economy and broader market. But later this week, we're going to get the release of Form 13Fs from money management firms with more than $100 million in assets under management -- that includes Berkshire Hathaway. In other words, we're going to get a firsthand look at what, exactly, the brightest minds on Wall Street were buying and selling during the fastest bear market descent in history.END", "For Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) shareholders and fans of Warren Buffett, the previous weekend was the most-anticipated event of the year. On Saturday, May 2, Buffett held his company's annual shareholder meeting (albeit virtually) and provided the usual dose of long-term wisdom that investors look for. His \"never bet against America\" thesis was especially needed with the coronavirus disease 2019 (COVID-19) leading to a record level of labor market and economic disruption.But what if I told you the Berkshire Hathaway shareholder meeting wasn't the most important event of the month for Warren Buffett?END", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThThe S&P 500 and Nasdaq rose on Wednesday on hopes of a pickup in business activity as U.S. states eased coronavirus-induced curbs, with investors also looking past a stunning 20 million plunge in U.S. private payrolls last month. .NAt 13:09 ET, the Dow Jones Industrial Average .DJI was down 0.09% at 23,861.94. The S&P 500 .SPX was up 0.04% at 2,869.57 and the Nasdaq Composite .IXIC was up 1.08% at 8,904.273.   The top three S&P 500 .PG.INX percentage gainers:  ** FLIR Systems Inc FLIR.O, up 9.9%  ** Davita Inc DVA.N, up 7.1%  ** Kla Corp KLAC.O, up 5.9%   The top three S&P 500 .PL.INX percentage losers:  ** Occidental Petroleum Corp OXY.N, down 9.2%  ** Simon Property Group Inc SPG.N, down 7.7%  ** Cincinnati Financial Corp CINF.O, down 7.7%   The top NYSE .PG.N percentage gainer:  ** Cars.Com Inc CARS.N, up 43.6%   The top two NYSE .PL.N percentage losers:  ** Nautilus Inc NLS.N, down 18.5%  ** Bluegreen Vacations Corp BXG.N, down 16.7%   The top three Nasdaq .PG.O percentage gainers:  ** Macrogenics MGNX.O, up 259.7%  ** Liveperson Inc LPSN.O, up 41.5%  ** Axcla Health Inc AXLA.O, up 26.8%   The top three Nasdaq .PL.O percentage losers:  ** Wealthbridge Acquisition Ltd HHHH.O, down 25.4%  ** Clensprk Inc CLSK.O, down 24.6%  ** Inogen Inc INGN.O, down 20.2%     ** Mesoblast Ltd MESO.O: up 7.3%END", "With the debt market near record lows amid the COVID-19 pandemic, Apple (NASDAQ: AAPL) became the latest company to issue debt, raising $8.5 billion. In a prospectus earlier this week, the iPhone maker announced an offering of four tranches of notes coming due in 2023, 2025, 2030, and 2050. Proceeds will be used for general corporate purposes, including buying back shares and supporting its dividend. Goldman Sachs, BofA Securities, JPMorgan, and Morgan Stanley handled the bond offering for the tech stock.  END", "The following are the top rated Healthcare stocks according to Validea's Earnings Yield Investor model based on the published strategy of Joel Greenblatt. This value model looks for companies with high return on capital and earnings yields.AMERISOURCEBERGEN CORP. (ABC) is a large-cap value stock in the Biotechnology & Drugs industry. The rating according to our strategy based on Joel Greenblatt is 100% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.Company Description: AmerisourceBergen Corporation is a pharmaceutical sourcing and distribution services company. The Company's segments include Pharmaceutical Distribution and Other. The Company provides services to healthcare providers, and pharmaceutical and biotech manufacturers. As of June 30, 2016, the Pharmaceutical Distribution segment consists of two operating segments, including the operations of AmerisourceBergen Drug Corporation (ABDC) and AmerisourceBergen Specialty Group (ABSG), which distributes specialty drugs to their customers. Servicing healthcare providers in the pharmaceutical supply channel, the Pharmaceutical Distribution segment's operations provide drug distribution and related services. The Other segment consists of the operations of various segments, including the AmerisourceBergen Consulting Services (ABCS), the World Courier Group, Inc. and the MWI Veterinary Supply, Inc. ABSG operates distribution facilities that focus primarily on complex disease treatment regimens.The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.END", "Health care stocks were edging higher this afternoon, with the NYSE Health Care Index climbing less than 0.1% while the SPDR Health Care Select Sector ETF was up over 0.1%.The Nasdaq Biotechnology index was rising 2.5% this afternoon.In company news, Eagle Pharmaceuticals (EGRX) gained 0.3%. CEO Scott Tarriff Monday said the company is expecting to advance its EA-144 product candidate in patients with advanced hormone-receptor positive breast cancer following two recent meetings with the US Food and Drug Administration. The company also plans to meet soon with the agency again to discuss additional pilot data.Ultragenyx Pharmaceutical (RARE) climbed 10% after the specialty drugmaker and GeneTx Biotherapeutics Monday said the US Food and Drug Administration has granted a fast-track designation for their GTX-102 drug candidate to treat Angelman syndrome. GTX-102 currently being evaluated in a phase I/II study expected to eventually enroll 20 pediatric patients with the rare, neurogenetic disorder causing developmental disabilities and other nerve-related symptoms.END", "Health care stocks were struggling this afternoon, with the NYSE Health Care Index declining 0.6% while the SPDR Health Care Select Sector ETF was down almost 0.7%.The Nasdaq Biotechnology index was climbing 1.1% this afternoon.In company news, Vir Biotechnology (VIR) climbed 8.9% after the immunology company and Alynylam Pharmaceuaticals Monday said they have selected VIR-2703 as their potential treatment for COVID-19. The companies plan on soon meeting with the US Food and Drug Administration and other regulatory authorities to discuss an accelerated filing process, with human clinical expected to begin by the end of 2020.Ultragenyx Pharmaceutical (RARE) climbed 6.3% after the specialty drugmaker and GeneTx Biotherapeutics Monday said the US Food and Drug Administration has granted a fast-track designation for their GTX-102 drug candidate to treat Angelman syndrome. GTX-102 currently being evaluated in a phase I/II study expected to eventually enroll 20 pediatric patients with the rare, neurogenetic disorder causing developmental disabilities and other nerve-related symptoms.END", "END", "For years, we've seen the failure of clinical trials targeting Alzheimer's disease based on a controversial hypothesis. Biogen's (NASDAQ: BIIB) aducanumab may become the newest addition to the list. Should shareholders be worried about a material decline in the stock price if the U.S. Food and Drug Administration (FDA) rejects the drug's Biological License Application (BLA) filing?END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares Nasdaq Biotechnology ETF (Symbol: IBB) where we have detected an approximate $75.5 million dollar inflow -- that's a 1.0% increase week over week in outstanding units (from 63,000,000 to 63,600,000).  Among the largest underlying components of IBB, in trading today Gilead Sciences Inc (Symbol: GILD) is up about 1.6%, Vertex Pharmaceuticals, Inc. (Symbol: VRTX) is down about 0.5%, and Biogen Inc (Symbol: BIIB) is lower by about 0.8%. For a complete list of holdings, visit the IBB Holdings page » \n\nThe chart below shows the one year price performance of IBB, versus its 200 day moving average:\n   \n\nEND", "You can't lump all clinical-stage biotechs together. Take Cara Therapeutics (NASDAQ: CARA) and Sangamo Therapeutics (NASDAQ: SGMO), for example. The two biotechs are about as different as night and day. One thing that both Cara and Sangamo have in common, though, are promising pipeline candidates. Investors have placed a greater value on Sangamo's pipeline based on the company's higher market cap. But which of these biotech stocks is the better pick for long-term investors? Here's how Cara and Sangamo stack up against each other.END", "By William HoffmanNEW YORK, April 27 (IFR) - At least 14 corporate borrowers are in the US high-grade primary on Monday with new deals.Some of the blue chip names include financials such as Charles Schwab, BlackRock, Citizens Bank NA and Citizens Financial as well as department store Kohl's.Nationwide Mutual is back in the market after postponing its deal last week because of a failure to build adequate investor demand.Initial price thoughts for the Nationwide 30-year bullet offering start at 325bp over Treasuries up from the starting point of 285bp over from last week.END", "By Kate Duguid and Joshua FranklinNEW YORK, May 4 (Reuters) - Apple Inc AAPL.O on Monday capitalized on the Federal Reserve's emergency measures in response to the coronavirus outbreak to issue its cheapest bonds in years, making it the latest blue-chip company to do so to fund stock buybacks and dividends.Apple's offering illustrates how companies with the best credit ratings are boosting shareholder returns by tapping cheap debt made available through the Fed's backstopping of the credit markets. Apple shares are virtually flat year-to-date, compared with a 12% drop in the S&P 500 Index .SPX.The technology company raised $8.5 billion by selling four different bonds with maturities ranging from three years to 30 years. It sold a $2 billion three-year bond and a five-year $2.25 billion with coupons of 0.75% and 1.125% respectively, the lowest rates the company has paid on bonds with such durations since 2013, according to Refinitiv IFR data.The coupons on Apple's 10-year and 30-year bonds were also the lowest the company has paid in the past years, according to the Refinitiv data.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsEvery trading session tells a different story. The story being told on Wednesday was that the market is quite relieved to see oil starting to bounce back.END", "Nikkei up 1.52%, Topix gains 1.36%Battered value shares bought back, Topix value up 2%CyberAgent, Zozo up after earningsEisai drops after Alzheimer's drug delayTOKYO, April 23 (Reuters) - Japanese stocks rose on Thursday, as sellers covered their positions after Wall Street rebounded overnight on the promise of more U.S. government aid to ease the economic damage inflicted by the coronavirus health crisis.The Nikkei share average .N225 rose 1.52% to 19,429.44 after three straight sessions of losses. The broader Topix .TOPX gained 1.36% to 1,425.98.\"We have seen a bit of short-covering after U.S. stocks rebounded and oil prices stabilised for now. For now, the Nikkei may stay range-bound between 19,000 and 19,500 ahead of Japanese earnings,\" said Masahiro Ichikawa, senior strategist at Sumitomo Mitsui DS Asset Management.END", "Biogen (NASDAQ: BIIB) released its first-quarter earnings report before the market opened on Wednesday, reporting $3.5 billion in revenue, a 1% year-over-year increase. Sales of the multiple sclerosis drug Tecfidera, which is the biotech company's best-selling product, grew 10% to $1.1 billion. And Spinraza, its treatment for spinal muscular atrophy, recorded revenue of $565 million, up 9% compared to the prior-year quarter. Biogen's revenue got a $100 million boost as a result of accelerated sales propelled by the COVID-19 pandemic. The company's GAAP net income was $1.4 billion, or $8.08 per share basis. Its net income decreased by less than 1% compared to the year-ago period, while its earnings per share increased by 13%.END", "END", "Health care stocks still were adding to their afternoon gains, with the NYSE Health Care Index climbing 2% while the SPDR Health Care Select Sector ETF was up 1.8%.The Nasdaq Biotechnology index was recording a 1% advance in late trade.In company news, Biogen (BIIB) fell 8.9% after Wednesday saying it does not expect to file the biological license application for its experimental aducanumab treatment for Alzheimer's disease until the quarter ending Sept. 30, upstaging better-than-expected Q1 results. The company has been preparing for a pre-filing meeting with the US Food and Drug Administration scheduled for later this summer and said it has been submitting portions of the BLA filing for the anti-amyloid beta candidate in collaboration with Eisai Co.Immunomedics (IMMU) rose about 1.2% after the US Food and Drug Administration Wednesday approved its trodelvy product candidate for the treatment of adults with metastatic triple-negative breast cancer who have been treated at least twice for the disease in the past. Trodelvy is the first FDA-approved antibody-drug conjugate indicated for metastatic triple-negative breast cancer, according to the company.END", "Looking at options trading activity among components of the Russell 3000 index, there is noteworthy activity today in Cannae Holdings Inc (Symbol: CNNE), where a total volume of 5,008 contracts has been traded thus far today, a contract volume which is representative of approximately 500,800 underlying shares (given that every 1 contract represents 100 underlying shares).  That number works out to 103.2% of CNNE's average daily trading volume over the past month, of 485,210 shares.  Particularly high volume was seen for the $35 strike call option expiring May 15, 2020, with 2,500 contracts trading so far today, representing approximately 250,000 underlying shares of CNNE.  Below is a chart showing CNNE's trailing twelve month trading history, with the $35 strike highlighted in orange:\n\nEND", "Imbruvica, a blockbuster cancer drug marketed by Johnson & Johnson (NYSE: JNJ) and AbbVie (NYSE: ABBV), recently secured its 11th approval. On Tuesday, the Food and Drug Administration approved the combination of Imbruvica and Rituximab as a treatment for patients with previously untreated chronic lymphocytic leukemia (CLL) or small lymphocytic lymphoma (SLL); Rituximab is a cancer drug marketed by Biogen (NASDAQ: BIIB). This approval was based on positive results from a phase 3 clinical trial. During the trial, CLL patients under age 70 who were treated with a combination of Imbruvica and Rituximab achieved a progression-free survival (PFS) rate -- the amount of time during and after treatment the patient lives with cancer without experiencing worsening symptoms -- of 88% after 37 months. By contrast, patients on chemotherapy drugs and Rituximab achieved a PFS rate of 75%.END", "Looking at the underlying holdings of the ETFs in our coverage universe at ETF Channel, we have compared the trading price of each holding against the average analyst 12-month forward target price, and computed the weighted average implied analyst target price for the ETF itself. \tFor the iShares MSCI Kokusai ETF (Symbol: TOK), we found that the implied analyst target price for the ETF based upon its underlying holdings is $69.42 per unit.\n\n\nWith TOK trading at a recent price near $61.57 per unit, that means that analysts see 12.75% upside for this ETF looking through to the average analyst targets of the underlying holdings.   Three of TOK's underlying holdings with notable upside to their analyst target prices are Coca-Cola European Partners plc (Symbol: CCEP), Teva Pharmaceutical Industries Ltd (Symbol: TEVA), and Biogen Inc (Symbol: BIIB). Although CCEP has traded at a recent price of $39.28/share, the average analyst target is 23.05% higher at $48.33/share. Similarly, TEVA has 15.15% upside from the recent share price of $10.18 if the average analyst target price of $11.72/share is reached, and analysts on average are expecting BIIB to reach a target price of $336.09/share, which is 15.00% above the recent price of $292.25. Below is a twelve month price history chart comparing the stock performance of CCEP, TEVA, and BIIB:  \n\n END", "END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares Nasdaq Biotechnology ETF (Symbol: IBB) where we have detected an approximate $226.5 million dollar inflow -- that's a 3.0% increase week over week in outstanding units (from 61,150,000 to 63,000,000).  Among the largest underlying components of IBB, in trading today Vertex Pharmaceuticals, Inc. (Symbol: VRTX) is up about 1.4%, Biogen Inc (Symbol: BIIB) is down about 11.7%, and Regeneron Pharmaceuticals, Inc. (Symbol: REGN) is lower by about 0.6%. For a complete list of holdings, visit the IBB Holdings page » \n\nThe chart below shows the one year price performance of IBB, versus its 200 day moving average:\n   \n\nEND", "In early trading on Wednesday, shares of Lam Research topped the list of the day's best performing components of the Nasdaq 100 index, trading up 7.7%.  Year to date, Lam Research has lost about 10.3% of its value.\n\nAnd the worst performing Nasdaq 100 component thus far on the day is Biogen, trading down 9.7%.  Biogen is showing a gain of 0.1% looking at the year to date performance.\n\nTwo other components making moves today are United Airlines Holdings, trading down 3.5%, and Expedia Group, trading up 7.3% on the day.\n\n \n\n\n\n\n\n\n\nVIDEO: Nasdaq 100 Movers: BIIB, LRCX\nEND", "In early trading on Wednesday, shares of Expedia Group topped the list of the day's best performing components of the S&P 500 index, trading up 8.0%.  Year to date, Expedia Group has lost about 42.8% of its value.\n\nAnd the worst performing S&P 500 component thus far on the day is Biogen, trading down 9.4%.  Biogen is showing a gain of 0.4% looking at the year to date performance.\n\nTwo other components making moves today are Macy's, trading down 6.3%, and Concho Resources, trading up 7.7% on the day.\n\n \n\n\n\n\n\n\n\nVIDEO: S&P 500 Movers: BIIB, EXPE\nEND", "Health care stocks were flat to higher pre-market Wednesday. The Health Care SPDR (XLV) and iShares NASDAQ Biotechnology Index (IBB) were advancing by more than 1%, while the Vanguard Health Care ETF (VHT) and iShares Dow Jones US Healthcare (IYH) were unchanged.BioNTech (BNTX) was surging above 32% after the company and its partner Pfizer (PFE) said the German regulatory authority, the Paul-Ehrlich-Institut, has approved the phase 1/2 clinical trial for BioNTech's BNT162 vaccine program to combat the COVID-19 disease. Pfizer was recently up more than 3%.Thermo Fisher Scientific (TMO) was advancing by more than 2% as it reported a fiscal Q1 adjusted EPS of $2.94, up from $2.81 reported last year. Analysts surveyed by Capital IQ had projected $2.82.Biogen (BIIB) was declining by more than 6% even after it reported a Q1 non-GAAP EPS of $9.14, up from $6.98 in the 2019 quarter and significantly higher than the consensus estimate of $7.69 from analysts surveyed by Capital IQ.END", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThU.S. stock index futures rebounded on Wednesday as upbeat quarterly earnings reports lifted investor sentiment following a two-day selloff due to a record crash in oil prices, although companies warned of more pain in the coming months..NAt 08:07 ET, Dow e-minis 1YMc1 were up 1.20% at 23,205. S&P 500 e-minis ESc1 were up 1.30% at 2,767.5, while Nasdaq 100 e-minis NQc1 were up 1.25% at 8,536.75.   The top three NYSE percentage gainers premarket .PRPG.NQ:  ** Global Ship Lease Inc GSL.N, up 43.9%  ** Delek Logistics Partners <DKL.N>, up 28.3%  ** NVR Inc <NVR.N>, up 27.8%   The top three NYSE percentage losers premarket .PRPL.NQ:  ** SEACOR Marine Holdings Inc <SMHI.K>, down 25.6%  ** Unit Corp <UNT.N>, down 23%   ** Borr Drilling Ltd <BORR.K>, down 16.4%   The top three Nasdaq percentage gainers premarket .PRPG.O:  ** SAExploration Holdings Inc <SAEX.O>, up 151.9%-   ** Kaixin Auto Holdings <KXIN.O>, up 64.8%  ** Immunic Inc <IMUX.O>, up 58.9%   The top three Nasdaq percentage losers premarket .PRPL.O:  ** VBI Vaccines Inc <VBIV.O>, down 29.5%  ** Company name not found <ITRM.O>, down 26.6%  ** TORM Plc <TRMD.O>, down 23.6%    ** Coca-Cola Co KO.N: up 1.1% premarket  BUZZ-Street View: Coca-Cola unlikely to lose fizz in the long run    ** Netflix Inc NFLX.O: down 2.0% premarket  BUZZ-Netflix: Drops as co warns quarantine boost may prove to be short-lived    ** Emerson Electric Co EMR.N: up 1.2% premarket  BUZZ-Street View: Emerson Electric not pulling forecast is a good sign    ** Lockheed Martin Corp LMT.N: up 1.5% premarket  BUZZ-Street View: Lockheed Martin results affirm defense sector as safe haven    ** Intel Corp INTC.O: up 2.0% premarket  BUZZ-Intel Corp: Jefferies raises PT on data center growth    ** Texas Instruments Inc TXN.O: up 2.8% premarket  BUZZ-Street View: Texas Instruments' long-term growth trends intact     ** Expedia Group Inc EXPE.O: up 6.6% premarket  BUZZ- Expedia Group: Rises on report of stake sale to private equity firms    ** United Airlines Holdings Inc UAL.O: down 3.0% premarket  BUZZ-United Airlines down after $1 bln-plus equity haul    ** Chipotle Mexican Grill Inc CMG.N: up 6.3% premarket  BUZZ-Chipotle Mexican Grill: Red hot as online sales help during pandemic    ** Delta Air Lines Inc DAL.N: up 2.9% premarket  BUZZ-Delta Air jumps as cheap fuel, cost cuts likely to reduce Q2 expenses by half    ** Biogen Inc BIIB.O: down 6.4% premarket  BUZZ-Biogen: Down as co pushes Alzheimer's drug filing to Q3    ** Unit Corp UNT.N: down 23.0% premarket  BUZZ-Unit Corp shares hover near record lows    ** SAExploration Holdings SAEX.O: up 151.9% premarket  BUZZ-SAExploration Holdings: Surges three-fold on new project announcement    ** Kimberly-Clark Corp KMB.N: up 1.8% premarket  BUZZ-Kimberly-Clark: Rises as strong tissue sales drive quarterly beatEND", "Adds details on aducanumab filing, compares with estimates, adds sharesApril 22 (Reuters) - Biogen Inc BIIB.O said on Wednesday it would delay filing for marketing approval of its much-awaited experimental Alzheimer's disease drug to the third quarter, sending its shares down 7%.Biogen had scrapped two clinical studies of the drug, aducanumab, in March 2019 after initial analysis showed the trials would not succeed.It later reversed course, saying analysis of the discontinued clinical studies showed some patients benefited from taking higher doses over an extended period of time.END", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThWall Street's main indexes rose on Wednesday on signs of more stimulus to aid small businesses ride out the coronavirus-induced economic slump and a recovery in oil prices. .NAt 15:59 ET, the Dow Jones Industrial Average .DJI was up 1.43% at 23,348.35. The S&P 500 .SPX was up 1.79% at 2,785.6 and the Nasdaq Composite .IXIC was up 2.01% at 8,429.131.   The top three S&P 500 .PG.INX percentage gainers:  ** Halliburton Company <HAL.N>, up 10.5%  ** Expedia Group Inc <EXPE.O>, up 9.2%-   ** Chipotle Mexican Grill Inc <CMG.N>, up 8.8%-    The top three S&P 500 .PL.INX percentage losers:  ** L Brands Inc <LB.N>, down 15.1%  ** Biogen Inc <BIIB.O>, down 10.5%-   ** United Airlines Holdings Inc <UAL.O>, down 6.5%-    The top three NYSE .PG.N percentage gainers:  ** UBS ETRACS S&P GSCI Crude Oil Total Return Index ETN <OILX.N>, up 48.5%  ** Delek Logistics Partners <DKL.N>, up 45.7%  ** SilverBow Resources Inc <SBOW.N>, up 36.1%   The top three NYSE .PL.N percentage losers:  ** DB Crude Oil Double Short ETN <DTO.N>, down 19%  ** American Eagle Outfitters Inc <AEO.N>, down 15.9%   ** L Brands Inc <LB.N>, down 15.1%   The top three Nasdaq .PG.O percentage gainers:  ** SAExploration Holdings Inc <SAEX.O>, up 115.9%   ** Peck Company Holdings Inc <PECK.O>, up 101.4%  ** Kewaunee Scientific Corp <KEQU.O>, up 29.9 %   The top three Nasdaq .PL.O percentage losers:  ** TORM Plc  <TRMD.O>, down 28.1%  ** Energous Corp <WATT.O>, down 17.8%  ** Euroseas Ltd <ESEA.O>, down 15.8%     ** Exxon Mobil Corp XOM.N: up 3.0%  ** Chevron Corp CVX.N: up 2.7%  ** Occidental Petroleum Corp OXY.N: up 6.8%END", "April 22 (Reuters) - Biogen Inc BIIB.O posted a 1.3% rise in first-quarter sales on Wednesday, helped by demand for its spinal muscular atrophy drug as well as its multiple sclerosis treatment, Tecfidera.Biogen also said it now expects to complete the U.S. filing of a much-awaited marketing application for its experimental Alzheimer's disease drug, aducanumab, in the third quarter.Biogen reported net income attributable to the company of $1.40 billion, or $8.08 per share, in the quarter, compared with $1.41 billion, or $7.15 per share, a year earlier.Total revenue rose to $3.53 billion from $3.49 billion.END", "(RTTNews) - Biogen Inc. (BIIB) will host a conference call at 8:00 AM ET on April 22, 2020, to discuss Q1 20 earnings results.To access the live webcast, log on to https://www.investornetwork.com/event/presentation/61397 The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.END", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThThe S&P 500 and the Dow Jones headed lower on Monday following a strong two-week rally as oil prices crashed and investors grew cautious at the start of a week that is likely to bring more dismal quarterly earnings reports and economic data..NAt 17:55 ET, the Dow Jones Industrial Average .DJI was down 0.92% at 24,020.4. The S&P 500 .SPX was down 0.33% at 2,865.2 and the Nasdaq Composite .IXIC was up 0.30% at 8,676.165.   The top three S&P 500 .PG.INX percentage gainers:  ** FLIR Systems Inc <FLIR.O>, up 14.7%  ** Carrier Global Corp <CARR.N>, up 6.6%  ** Howmet Aerospace Inc <HWM.N>, up 6.4%   The top three S&P 500 .PL.INX percentage losers:  ** L Brands Inc <LB.N>, down 7.5%  ** Vornado Realty Trust <VNO.N>, down 6.3%  ** Occidental Petroleum Corp <OXY.N>, down 6%   The top three NYSE .PG.N percentage gainers:  ** Regional Health Properties Inc <RHE.N>, up 36.5%  ** Pacer Developed Markets International Cash CWS <ICOW.N>, up 23.2%  ** Montage Resources Corp <MR.N>, up 23%   The top three NYSE .PL.N percentage losers:  ** Invesco Mortgage Capital Inc <IVR.N>, down 22.5%  ** Direxion Daily S&P Biotech Bear 3X Shares <LABD.N>, down 16.5%  ** Independence Contract Drilling Inc <ICD.N>, down 11.9%   The top three Nasdaq .PG.O percentage gainers:  ** Benitec Biopharma Limited <BNTC.O>, up 107.4%  ** Cyclacel Pharmaceuticals Inc <CYCC.O>, up 103.8%  ** Novavax Inc <NVAX.O>, up 32.9%   The top three Nasdaq .PL.O percentage losers:  ** Vericity Inc <VERY.O>, down 19.5%  ** Akazoo SA <SONG.O>, down 19%  ** Liberty TripAdvisor Holdings Inc <LTRPB.O>, down 17.9%    ** Aytu BioScience Inc AYTU.O: up 3.6%END", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThA slide in energy stocks weighed on Wall Street on Monday as crude prices crashed at the start of a week packed with quarterly earnings reports and economic data likely to underline the damage from the coronavirus outbreak..NAt 16:05 ET, the Dow Jones Industrial Average .DJI was down 0.94% at 24,014.95. The S&P 500 .SPX was down 0.65% at 2,855.74 and the Nasdaq Composite .IXIC was up 0.13% at 8,661.651.   The top three S&P 500 .PG.INX percentage gainers:  ** FLIR Systems Inc <FLIR.O>, up 14.1%  ** Carrier Global Corp <CARR.N>, up 6.6%  ** DuPont de Nemours Inc<DD.N>, up 5%   The top three S&P 500 .PL.INX percentage losers:  ** Vornado Realty Trust <VNO.N>, down 4.9%  ** Lennar Corporation <LEN.N>, down 4.7%  ** Occidental Petroleum Corp <OXY.N>, down 4.7%   The top three NYSE .PG.N percentage gainers:  ** Regional Health Properties Inc <RHE.N>, up 41.6%  ** Montage Resources Corp <MR.N>, up 26.8%  ** Build-A-Bear Workshop Inc <BBW.N>, up 26.2%   The top three NYSE .PL.N percentage losers:  ** Invesco Mortgage Capital Inc <IVR.N>, down 19.5%  ** Direxion Daily S&P Biotech Bear 3X Shares <LABD.N>, down 13%  ** Manning & Napier Inc <MN.N>, down 12.7%   The top three Nasdaq .PG.O percentage gainers:  ** Cyclacel Pharmaceuticals Inc <CYCC.O>, up 89.5%  ** American Virtual Cloud Technologies Inc <AVCT.O>, up 43.8%  ** Benitec Biopharma Limited <BNTC.O>, up 42.9%   The top three Nasdaq .PL.O percentage losers:  ** Liberty TripAdvisor Holdings Inc <LTRPB.O>, down 18.4%  ** BiondVax Pharmaceuticals Equity Warrants <BVXVW.O>, down 15%  ** Green Plains Partners LP <GPP.O>, down 14%     ** Avalon GloboCare Corp AVCO.O: up 12.9%END", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThU.S. stock index futures fell on Monday as a slump in oil prices pounded energy stocks, with investors also bracing for another batch of dour first-quarter earnings reports and economic data..NAt 13:08 ET, Dow e-minis 1YMc1 were down 2.21% at 23,626. S&P 500 e-minis ESc1 were down 1.90% at 2,815.5, while Nasdaq 100 e-minis NQc1 were down 0.90% at 8,729.75.   The top three NYSE percentage gainers premarket .PRPG.NQ:  ** Eros International Plc <EROS.K>, up 42.0%  ** Renren Inc <RENN.K>, up 21.2%  ** FGL Holdings Inc <FG.N>, up 17.6%   The top three NYSE percentage losers premarket .PRPL.NQ:  ** Invesco Mortgage Capital Inc <IVR.N>, down 31.2%  ** Par Pacific Holdings Inc <PARR.K>, down 30.7%  ** Cedar Realty Trust Inc <CDR.N>, down 26.7%   The top three Nasdaq percentage gainers premarket .PRPG.O:  ** American Virtual Cloud Technologies Inc <AVCT.O>, up 75.2%  ** Safe-T Group Ltd <SFET.O>, up 44.6%   ** Cyclacel Pharmaceuticals Inc <CYCC.O>, up 32.4%   The top three Nasdaq percentage losers premarket .PRPL.O:  ** Allegro Merger Corp <ALGRR.O>, down 40.3%  ** HL Acquisitions Corp <HCCHR.O>, down 30.1%  ** Allegro Merger Equity Warrants <ALGRW.O>, down 30%    ** Exxon Mobil Corp XOM.N: down 5.5% premarket  ** Chevron Corp CVX.N: down 4.5% premarket  ** Devon Energy Corp DVN.N: down 8.8% premarket  ** Callon Petroleum Co CPE.N: down 9.6% premarket  ** Chesapeake Energy Corp CHK.N: down 13.5% premarket  ** Occidental Petroleum Corp OXY.N: down 9.4% premarket  ** Schlumberger NV SLB.N: down 6.7% premarket  ** Halliburton Co HAL.N: down 8.3% premarket  ** TechnipFMC Plc FTI.N: down 6.4% premarket   BUZZ-Oil stocks drop as concerns over rising crude storage weigh on prices  BUZZ-Street View: Schlumberger's dividend cut the first step on road to recovery   BUZZ-Halliburton: Falls on $1.1 bln impairment charges    ** Safe-T Group SFET.O: up 44.6% premarket  BUZZ-Safe-T Group: Jumps on upbeat Q1 revenue forecast     ** Facebook Inc FB.O: down 1.0% premarket  BUZZ-Facebook: Credit Suisse cuts PT as coronavirus impacts ad revenue   ** Biogen Inc BIIB.O: down 1.3% premarket  BUZZ-Biogen Inc: Alzheimer's drug in focus ahead of Q1, not earnings    ** DuPont de Nemours Inc DD.N: up 4.0% premarket  BUZZ-DuPont: Rises on expectations of stronger Q1 from coronavirus-driven demand    ** Co-Diagnostics Inc CODX.O: up 11.4% premarket  BUZZ-Co-Diagnostics: Rises on increased U.S. sales of COVID-19 testing kits   ** General Motors Co GM.N: down 2.7% premarket  ** Ford Motor Co F.N: down 3.3% premarket  BUZZ-CS cuts PT on Ford, GM on heavy cash burn in H1 2020   ** Royal Caribbean Cruises Ltd RCL.N: down 4.6% premarket  ** Norwegian Cruise Line Holdings Ltd NCLH.N: down 5.0% premarket  ** Carnival Corp CCL.N: down 4.6% premarket  BUZZ-J.P. Morgan slashes cruise operators' PT on virus impact END", "The following are the top rated Healthcare stocks according to Validea's Growth Investor model based on the published strategy of Martin Zweig. This strategy looks for growth stocks with persistent accelerating earnings and sales growth, reasonable valuations and low debt.ALIGN TECHNOLOGY, INC. (ALGN) is a large-cap growth stock in the Medical Equipment & Supplies industry. The rating according to our strategy based on Martin Zweig is 77% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.Company Description: Align Technology, Inc. designs, manufactures and markets a system of clear aligner therapy, intra-oral scanners and computer-aided design/computer-aided manufacturing (CAD/CAM) digital services used in dentistry, orthodontics and dental records storage. The Company operates through two segments: Clear Aligner segment and Scanner and Services (Scanner) segment. The Clear Aligner segment consists of its Invisalign System, which includes Invisalign Full, Teen and Assist (Comprehensive Products), Express/Lite (Non-Comprehensive Products) and Vivera Retainers, along with its training and ancillary products for treating malocclusion (Non-Case). The Scanner segment consists of intra-oral scanning systems and other services available with the intra-oral scanners that provide digital alternatives to the traditional cast models. The Scanner segment includes its iTero scanner and OrthoCAD services.The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.END", "The following are the top rated Healthcare stocks according to Validea's P/E/Growth Investor model based on the published strategy of Peter Lynch. This strategy looks for stocks trading at a reasonable price relative to earnings growth that also possess strong balance sheets.JAZZ PHARMACEUTICALS PLC (JAZZ) is a mid-cap value stock in the Biotechnology & Drugs industry. The rating according to our strategy based on Peter Lynch is 93% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.Company Description: Jazz Pharmaceuticals Public Limited Company is a biopharmaceutical company. The Company is focused on developing and commercializing products that address unmet medical needs. The Company has a diverse portfolio of products and product candidates with a focus in the areas of sleep and hematology/oncology. The Company's lead marketed products include Xyrem (sodium oxybate oral solution) for the treatment of both cataplexy and excessive daytime sleepiness in patients with narcolepsy; Erwinaze for the treatment of acute lymphoblastic leukemia (ALL), and Defitelio (defibrotide) for the treatment of severe hepatic veno-occlusive disease (VOD). The Company also commercializes Prialt, an intrathecally administered infusion of ziconotide, approved by the FDA for the management of severe chronic pain in patients for whom intrathecal therapy is warranted, and who are intolerant of or refractory to other treatment, such as systemic analgesics, adjunctive therapies or intrathecal morphine.The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.END", "(RTTNews) - Biogen Inc. (BIIB) on Wednesday reported net income attributable to the company for the first quarter of $1.40 billion or $8.08 per share, up from $1.41 billion or $7.15 per share in the prior-year quarter.Excluding items, adjusted earnings for the quarter were $9.14 per share, compared to $6.98 per share in the year-ago quarter.Total revenue for the quarter grew 1 percent to $3.53 billion from $3.49 billion in the same quarter last year.On average, analysts polled by Thomson Reuters expected the company to report earnings of $7.73 per share for the quarter on revenues of $3.41 billion. Analysts' estimates typically exclude special items.END", "\nThere are 23 different analyst targets contributing to that average for Biogen Inc, but the average is just that — a mathematical average.  There are analysts with lower targets than the average, including one looking for a price of $245.00.  And then on the other side of the spectrum one analyst has a target as high as $420.00.  The standard deviation is $45.323.\n\n\nBut the whole reason to look at the average BIIB price target in the first place is to tap into a \"wisdom of crowds\" effort, putting together the contributions of all the individual minds who contributed to the ultimate number, as opposed to what just one particular expert believes.  And so with BIIB crossing above that average target price of $336.09/share, investors in BIIB have been given a good signal to spend fresh time assessing the company and deciding for themselves: is $336.09 just one stop on the way to an even higher target, or has the valuation gotten stretched to the point where it is time to think about taking some chips off the table?  Below is a table showing the current thinking of the analysts that cover Biogen Inc:\n\n\nEND"]}