{"Title": ["Why Shares of Booking Holdings Gained 10% in May", "Notable Tuesday Option Activity: UNIT, WEX, BKNG", "3 Niche Travel Stocks That Will Come Back Stronger Than Before", "Why TripAdvisor's Stock Is Up 10% Today", "How to Be a Better Investor", "BKNG Crosses Above Average Analyst Target", "Nasdaq Today: Booking Holdings, United Lead Travel Stocks Higher", "Is Booking Holdings Stock in for a Bumpy Landing in June?", "Why Shares of Booking Holdings Gained 10% in May", "Trivago Sees Big Changes Ahead in the Travel Industry", "Nasdaq Today: Strong Quarter Lifts Baidu Stock; Expedia Gets a Downgrade", "Booking Holding's Agoda cuts 1,500 jobs", "Why Booking Holdings, Expedia, and Sabre Corporation Stocks All Popped 10% (Or More) Today", "Nasdaq Today: United Airlines Stock Rockets Higher; Reopening Hopes Help Marriott", "Is Booking Holdings Stock a Buy?", "Why Companies Don't Tie Dividends to Profits", "TQQQ, QCOM, BKNG, MELI: Large Outflows Detected at ETF", "Booking Holdings Slumps on Q1 Results", "Noteworthy Friday Option Activity: BKNG, TSLA, AMZN", "What We Learned From Berkshire Hathaway's Annual Meeting", "Why the Stock Market Is Taking Off Despite 20 Million Jobs Lost in April", "BUZZ-U.S. STOCKS ON THE MOVE-Banks, Boeing, Uber, Disney", "BUZZ-U.S. STOCKS ON THE MOVE-Banks, Uber, Roku, Sorrento Therapeutics", "Nasdaq 100 Movers: CTSH, UAL", "PNQI, SHOP, UBER, BKNG: ETF Outflow Alert", "BUZZ-U.S. STOCKS ON THE MOVE-Roku, Spirit Airlines, Uber, Shopify", "Booking Holdings Inc. (BKNG) Q1 2020 Earnings Call Transcript", "Booking Holdings Inc. Q1 adjusted earnings Miss Estimates", "Booking.com operator misses profit estimates on travel demand slump", "7 Stocks to Buy Benefiting From Millennial Money", "Validea John Neff Strategy Daily Upgrade Report - 5/5/2020", "Why Travel Stocks Were Falling Today", "S&P 500 Movers: MSI, NWSA", "Fractional Shares Investing", "PNQI, EBAY, MELI, BKNG: Large Inflows Detected at ETF", "3 Stocks That Could Set You Up for Life", "Is Booking Holdings Stock a Buy?", "Hungary fines Booking.com operator $7.6 mln for unfair practices", "Validea Joel Greenblatt Strategy Daily Upgrade Report - 4/23/2020", "Why Short-Term Investing Is Impossible", "Noteworthy Friday Option Activity: BKNG, GOOGL, CMG", "BUZZ-U.S. STOCKS ON THE MOVE-Bed Bath & Beyond, TSMC, Calithera Biosciences, Soligenix", "Breakingviews - Corona Capital: Airbnb", "Will Chesapeake Energy's Last Stand Work?", "Could Booking Holdings Really Run Out of Cash?", "Booking Holdings Floats $750 Million in Convertible Debt", "How to Create Stock Baskets", "Validea Joel Greenblatt Strategy Daily Upgrade Report - 4/9/2020", "Notable Thursday Option Activity: BA, BKNG, ISRG", "Why Expedia Group, Booking Holdings, and TripAdvisor Stocks Are All Up Today"], "Elapsed Time": ["15 HOURS AGO", "1 DAY AGO", "2 DAYS AGO", "3 DAYS AGO", "5 DAYS AGO", "MAY 27, 2020", "MAY 26, 2020", "MAY 26, 2020", "15 HOURS AGO", "MAY 20, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 18, 2020", "MAY 18, 2020", "MAY 13, 2020", "MAY 11, 2020", "MAY 22, 2020", "MAY 8, 2020", "MAY 8, 2020", "MAY 8, 2020", "MAY 8, 2020", "MAY 8, 2020", "MAY 8, 2020", "MAY 8, 2020", "MAY 11, 2020", "MAY 8, 2020", "MAY 7, 2020", "MAY 7, 2020", "MAY 7, 2020", "MAY 6, 2020", "MAY 5, 2020", "MAY 1, 2020", "MAY 8, 2020", "MAY 1, 2020", "MAY 1, 2020", "MAY 1, 2020", "APR 29, 2020", "APR 28, 2020", "APR 23, 2020", "APR 22, 2020", "MAY 1, 2020", "APR 16, 2020", "APR 15, 2020", "APR 15, 2020", "APR 13, 2020", "APR 10, 2020", "APR 9, 2020", "APR 9, 2020", "APR 16, 2020", "APR 7, 2020"], "Published Date": ["Jun 3, 2020 8:47PM EDT", "Jun 2, 2020 3:37PM EDT", "Jun 1, 2020 2:23PM EDT", "Jun 1, 2020 12:07PM EDT", "May 30, 2020 12:25PM EDT", "May 27, 2020 9:12AM EDT", "May 26, 2020 12:22PM EDT", "May 26, 2020 8:30AM EDT", "Jun 3, 2020 8:47PM EDT", "May 20, 2020 10:24AM EDT", "May 19, 2020 12:28PM EDT", "May 19, 2020 6:54AM EDT", "May 18, 2020 2:06PM EDT", "May 18, 2020 12:25PM EDT", "May 13, 2020 8:22AM EDT", "May 11, 2020 4:25PM EDT", "May 22, 2020 10:50AM EDT", "May 8, 2020 8:15PM EDT", "May 8, 2020 3:24PM EDT", "May 8, 2020 2:08PM EDT", "May 8, 2020 1:54PM EDT", "May 8, 2020 11:49AM EDT", "May 8, 2020 10:45AM EDT", "May 8, 2020 10:25AM EDT", "May 11, 2020 10:57AM EDT", "May 8, 2020 9:23AM EDT", "May 7, 2020 10:00PM EDT", "May 7, 2020 5:45PM EDT", "May 7, 2020 5:06PM EDT", "May 6, 2020 6:33AM EDT", "May 5, 2020 11:00AM EDT", "May 1, 2020 3:13PM EDT", "May 8, 2020 10:24AM EDT", "May 1, 2020 11:56AM EDT", "May 1, 2020 10:49AM EDT", "May 1, 2020 9:30AM EDT", "Apr 29, 2020 10:16AM EDT", "Apr 28, 2020 12:08PM EDT", "Apr 23, 2020 11:00AM EDT", "Apr 22, 2020 12:12PM EDT", "May 1, 2020 1:17PM EDT", "Apr 16, 2020 8:49AM EDT", "Apr 15, 2020 4:42PM EDT", "Apr 15, 2020 7:37AM EDT", "Apr 13, 2020 2:00PM EDT", "Apr 10, 2020 10:29AM EDT", "Apr 9, 2020 11:04AM EDT", "Apr 9, 2020 11:00AM EDT", "Apr 16, 2020 1:26PM EDT", "Apr 7, 2020 2:37PM EDT"], "Link": ["https://www.nasdaq.com/articles/why-shares-of-booking-holdings-gained-10-in-may-2020-06-04", "https://www.nasdaq.com/articles/notable-tuesday-option-activity%3A-unit-wex-bkng-2020-06-02", "https://www.nasdaq.com/articles/3-niche-travel-stocks-that-will-come-back-stronger-than-before-2020-06-01", "https://www.nasdaq.com/articles/why-tripadvisors-stock-is-up-10-today-2020-06-01", "https://www.nasdaq.com/articles/how-to-be-a-better-investor-2020-05-30", "https://www.nasdaq.com/articles/bkng-crosses-above-average-analyst-target-2020-05-27", "https://www.nasdaq.com/articles/nasdaq-today%3A-booking-holdings-united-lead-travel-stocks-higher-2020-05-26", "https://www.nasdaq.com/articles/is-booking-holdings-stock-in-for-a-bumpy-landing-in-june-2020-05-26", "https://www.nasdaq.com/articles/why-shares-of-booking-holdings-gained-10-in-may-2020-06-04", "https://www.nasdaq.com/articles/trivago-sees-big-changes-ahead-in-the-travel-industry-2020-05-20", "https://www.nasdaq.com/articles/nasdaq-today%3A-strong-quarter-lifts-baidu-stock-expedia-gets-a-downgrade-2020-05-19", "https://www.nasdaq.com/articles/booking-holdings-agoda-cuts-1500-jobs-2020-05-19", "https://www.nasdaq.com/articles/why-booking-holdings-expedia-and-sabre-corporation-stocks-all-popped-10-or-more-today-2020", "https://www.nasdaq.com/articles/nasdaq-today%3A-united-airlines-stock-rockets-higher-reopening-hopes-help-marriott-2020-05", "https://www.nasdaq.com/articles/is-booking-holdings-stock-a-buy-2020-05-13", "https://www.nasdaq.com/articles/why-companies-dont-tie-dividends-to-profits-2020-05-11", "https://www.nasdaq.com/articles/tqqq-qcom-bkng-meli%3A-large-outflows-detected-at-etf-2020-05-22", "https://www.nasdaq.com/articles/booking-holdings-slumps-on-q1-results-2020-05-09", "https://www.nasdaq.com/articles/noteworthy-friday-option-activity%3A-bkng-tsla-amzn-2020-05-08", "https://www.nasdaq.com/articles/what-we-learned-from-berkshire-hathaways-annual-meeting-2020-05-08", "https://www.nasdaq.com/articles/why-the-stock-market-is-taking-off-despite-20-million-jobs-lost-in-april-2020-05-08", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-banks-boeing-uber-disney-2020-05-08", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-banks-uber-roku-sorrento-therapeutics-2020-05-08", "https://www.nasdaq.com/articles/nasdaq-100-movers%3A-ctsh-ual-2020-05-08", "https://www.nasdaq.com/articles/pnqi-shop-uber-bkng%3A-etf-outflow-alert-2020-05-11", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-roku-spirit-airlines-uber-shopify-2020-05-08", "https://www.nasdaq.com/articles/booking-holdings-inc.-bkng-q1-2020-earnings-call-transcript-2020-05-08", "https://www.nasdaq.com/articles/booking-holdings-inc.-q1-adjusted-earnings-miss-estimates-2020-05-07", "https://www.nasdaq.com/articles/booking.com-operator-misses-profit-estimates-on-travel-demand-slump-2020-05-07", "https://www.nasdaq.com/articles/7-stocks-to-buy-benefiting-from-millennial-money-2020-05-06", "https://www.nasdaq.com/articles/validea-john-neff-strategy-daily-upgrade-report-5-5-2020-2020-05-05", "https://www.nasdaq.com/articles/why-travel-stocks-were-falling-today-2020-05-01", "https://www.nasdaq.com/articles/sp-500-movers%3A-msi-nwsa-2020-05-08", "https://www.nasdaq.com/articles/fractional-shares-investing-2020-05-01", "https://www.nasdaq.com/articles/pnqi-ebay-meli-bkng%3A-large-inflows-detected-at-etf-2020-05-01", "https://www.nasdaq.com/articles/3-stocks-that-could-set-you-up-for-life-2020-05-01", "https://www.nasdaq.com/articles/is-booking-holdings-stock-a-buy-2020-04-29", "https://www.nasdaq.com/articles/hungary-fines-booking.com-operator-%247.6-mln-for-unfair-practices-2020-04-28", "https://www.nasdaq.com/articles/validea-joel-greenblatt-strategy-daily-upgrade-report-4-23-2020-2020-04-23", "https://www.nasdaq.com/articles/why-short-term-investing-is-impossible-2020-04-22", "https://www.nasdaq.com/articles/noteworthy-friday-option-activity%3A-bkng-googl-cmg-2020-05-01", "https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-bed-bath-beyond-tsmc-calithera-biosciences-soligenix-2020-04", "https://www.nasdaq.com/articles/breakingviews-corona-capital%3A-airbnb-2020-04-15", "https://www.nasdaq.com/articles/will-chesapeake-energys-last-stand-work-2020-04-15", "https://www.nasdaq.com/articles/could-booking-holdings-really-run-out-of-cash-2020-04-13", "https://www.nasdaq.com/articles/booking-holdings-floats-%24750-million-in-convertible-debt-2020-04-10", "https://www.nasdaq.com/articles/how-to-create-stock-baskets-2020-04-09", "https://www.nasdaq.com/articles/validea-joel-greenblatt-strategy-daily-upgrade-report-4-9-2020-2020-04-09", "https://www.nasdaq.com/articles/notable-thursday-option-activity%3A-ba-bkng-isrg-2020-04-16", "https://www.nasdaq.com/articles/why-expedia-group-booking-holdings-and-tripadvisor-stocks-are-all-up-today-2020-04-07"], "Content": ["END", "Among the underlying components of the Russell 3000 index, we saw noteworthy options trading volume today in Uniti Group Inc (Symbol: UNIT), where a total of 15,451 contracts have traded so far, representing approximately 1.5 million underlying shares.  That amounts to about 67.6% of UNIT's average daily trading volume over the past month of 2.3 million shares.  Particularly high volume was seen for the $15 strike call option expiring January 21, 2022, with 10,006 contracts trading so far today, representing approximately 1.0 million underlying shares of UNIT.  Below is a chart showing UNIT's trailing twelve month trading history, with the $15 strike highlighted in orange:\n\nEND", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsSome analysts predict that the economy is in for a bumpy landing, and they might have a fair point. Businesses are still trying to recover from the damage caused by the novel coronavirus. This makes travel stocks, and particularly companies involved in booking trips, a not-so-obvious trade.If you have a taste for the not-so-obvious, though, then travel stocks might be right up your alley. Indeed, the recovery phase of the economic cycle could propel the trip-booking niche to new heights.END", "END", "In this episode of Rule Breaker Investing, listeners of the podcast share what they have learned from The Motley Fool co-founder David Gardner.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Walmart wasn't one of them! That's right -- they think these 10 stocks are even better buys.END", "\nThere are 18 different analyst targets contributing to that average for Booking Holdings Inc, but the average is just that — a mathematical average.  There are analysts with lower targets than the average, including one looking for a price of $1030.00.  And then on the other side of the spectrum one analyst has a target as high as $2090.00.  The standard deviation is $284.98.\n\n\nBut the whole reason to look at the average BKNG price target in the first place is to tap into a \"wisdom of crowds\" effort, putting together the contributions of all the individual minds who contributed to the ultimate number, as opposed to what just one particular expert believes.  And so with BKNG crossing above that average target price of $1643.44/share, investors in BKNG have been given a good signal to spend fresh time assessing the company and deciding for themselves: is $1643.44 just one stop on the way to an even higher target, or has the valuation gotten stretched to the point where it is time to think about taking some chips off the table?  Below is a table showing the current thinking of the analysts that cover Booking Holdings Inc:\n\n\nEND", "Tuesday morning brought a big upward move to the stock market, largely in response to growing optimism about the reopening of the U.S. economy as fears about the coronavirus pandemic seem to be subsiding. The Nasdaq Composite (NASDAQINDEX: ^IXIC) lagged somewhat behind broader market benchmarks, but it was still up 0.7% shortly before noon EDT. The Nasdaq 100 Index of larger Nasdaq-listed stocks was up a more modest 0.4%.Many of the industries that have taken the biggest lumps during the coronavirus bear market were among today's best performers, and that was especially true among travel stocks. United Airlines Holdings (NASDAQ: UAL) led the way higher with a 13% gain, the biggest of any Nasdaq 100 stock Tuesday morning. Booking Holdings (NASDAQ: BKNG) managed a gain of 5%, with some smaller online travel portals seeing even larger gains on a percentage basis.END", "Investors with skin in the travel industry game are hurting this year. The best performing of the three cruise line stocks is trading 68% below its January highs. The top airline stock has shed more than half of its peak value. A car rental bellwether just filed for bankruptcy protection over the weekend. Online travel specialists aren't tethered to a single brand or even industry niche, but those models are naturally taking it on the chin. Expedia (NASDAQ: EXPE) -- the world's second-largest online travel portal with $11.7 billion in trailing-12-month revenue -- entered the holiday weekend trading 46% below its previous high. Smaller players have been faring even worse since the COVID-19 pandemic slammed the brakes on most travel plans. Travel reviews leader TripAdivsor (NASDAQ: TRIP) and hotel aggregator Trivago (NASDAQ: TRVG) are down 61% and 66%, respectively, from their peak levels. Industry leader Booking Holdings (NASDAQ: BKNG) seems to be defying gravity here. The stock has already clawed back through most of its pandemic-related sell-off. Booking heads into the abridged trading week just 22% below its January highs. With its near-term prospects severely challenged, it doesn't make sense for Booking to be bucking the trend. END", "END", "Like the rest of the travel sector, Trivago (NASDAQ: TRVG) saw sales tumble in the first quarter as the coronavirus pandemic swept across the world, impacting markets in Asia, Europe and the Americas.Revenue in the quarter fell 33% to 139.8 million euros, and the company dialed down its marketing expenses by a similar percentage as travel demand collapsed. Overhead costs including salaries still ate into profits, and its Adjusted EBITDA results swung from a 21.4 million euro profit a year ago to a 0.6 million euro loss. It also recorded a 20.7.6 million goodwill impairment charge, leading to an unadjusted net loss of 214.3 million euros. The company warned that second-quarter results would be significantly worse than the first quarter's, and said that revenue loss bottomed out at 95% year-over-year in the last week of March and remained that way through April, though it has seen a modest recovery since then as European countries have begun to reopen.The company is making a number of significant changes to adapt to the crisis, and it was frank about what it expected in the near future -- which holds implications for Booking Holdings (NASDAQ: BKNG) and Expedia (NASDAQ: EXPE), Trivago's two biggest bidding partners, as well as other players in the industry.END", "On a mixed day for the broader stock market, the tech stocks that make up a disproportionately large part of the Nasdaq fared better than most. As of just before noon EDT, the Nasdaq Composite (NASDAQINDEX: ^IXIC) was up more than half a percentage point, outperforming the breakeven performance from the S&P 500. The Nasdaq 100 Index saw similar gains of about 0.6%.Making news among Nasdaq 100 stocks was Baidu (NASDAQ: BIDU), which released earnings results for the first quarter that gave investors greater confidence in the broader Chinese stock market. Expedia Group (NASDAQ: EXPE) wasn't so lucky, however, with ongoing strains on the travel industry hitting the online-booking specialist and leading one stock analyst to downgrade its stock.END", "BANGKOK, May 19 (Reuters) - Bookings Holdings Inc BKNG.O's Asian online travel agency Agoda cut 1,500 jobs and reduces expense as global travel slowed amid the coronavirus outbreak.\"We need to resize and reshape teams to adapt to what travel will look like in the future, and this means that we have taken the very difficult decision to reduce our existing team by 1,500 employees,\" chief executive John Brown said in an e-mailed statement to Reuters on Tuesday.The company was also freezing hires, cutting marketing spending and cutting executive pay because the impact of the pandemic will be longer than expected.More than 4.81 million people have been reported to have been infected by the coronavirus and over 317,000 have died, according to a Reuters tally. END", "END", "Stock market investors were pleased on Monday at the prospect of businesses starting to reopen in many states, lifting major market benchmarks. The Nasdaq Composite (NASDAQINDEX: ^IXIC) didn't see quite the same level of gains as broader measures like the S&P 500, but it was still higher by about 2.4% as of noon EDT today. The Nasdaq 100 Index was higher by just under 2%.Good news from the healthcare front in the fight toward developing a coronavirus vaccine helped lift several pharmaceutical and biotech companies within the Nasdaq. But some of the best performers were those hit hardest by the economic fallout from the pandemic. United Airlines Holdings (NASDAQ: UAL) led the Nasdaq 100 with a rise of 18%, while Marriott (NASDAQ: MAR) wasn't far behind with its 14% gain.END", "In just two months, Booking Holdings (NASDAQ: BKNG) has experienced one of the toughest challenges in the history of the company. The COVID-19 pandemic has upended life as we know it, causing unprecedented border closures, curbs on traveling, and the shutdown of shopping malls, factories, and food outlets. Many countries are still struggling to contain the coronavirus, and the tragedy is both a human one and an economic one.Booking's share price has plunged 33% year to date, and it seems the fall was justified. The company's first-quarter 2020 earnings report showed gross travel bookings plunged 51% year over year, while room nights booked (for hotels) declined by 43% over the same period. Leisure travel is a discretionary expense for many. The question now is whether Booking Holdings stock remains a buy despite the strong headwinds and lingering uncertainty.END", "In this episode of Rule Breaker Investing, Motley Fool co-founder David Gardner answers questions about investing and shares some inspirational stories from listeners. Discover why dividends and profits aren't tied to each other. Learn about dividend yields. David fields questions on investing in expensive stocks and much more.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Walmart wasn't one of them! That's right -- they think these 10 stocks are even better buys.END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the ProShares ProShares UltraPro QQQ (Symbol: TQQQ) where we have detected an approximate $164.9 million dollar outflow -- that's a 2.9% decrease week over week (from 72,900,000 to 70,800,000).  Among the largest underlying components of TQQQ, in trading today Qualcomm Inc (Symbol: QCOM) is down about 0.6%, Booking Holdings Inc (Symbol: BKNG) is off about 0.1%, and MercadoLibre Inc (Symbol: MELI) is up by about 1.3%. For a complete list of holdings, visit the TQQQ Holdings page » \n\nThe chart below shows the one year price performance of TQQQ, versus its 200 day moving average:\n   \n\nEND", "To no one's surprise, online travel agency Booking Holdings (NASDAQ: BKNG) reported serious downturns in its financials for its Q1 of fiscal 2020.In its earnings release, Booking Holdings revealed that its total revenue came in at just under $2.29 billion, representing a 19% year-over-year decline. Non-GAAP (adjusted) net income fell at a much steeper rate, landing at $156 million ($3.77 per diluted share), versus the Q1 2019 result of $508 million.END", "Looking at options trading activity among components of the Russell 3000 index, there is noteworthy activity today in Booking Holdings Inc (Symbol: BKNG), where a total volume of 19,159 contracts has been traded thus far today, a contract volume which is representative of approximately 1.9 million underlying shares (given that every 1 contract represents 100 underlying shares).  That number works out to 362% of BKNG's average daily trading volume over the past month, of 529,295 shares.  Especially high volume was seen for the $1900 strike call option expiring January 21, 2022, with 1,394 contracts trading so far today, representing approximately 139,400 underlying shares of BKNG.  Below is a chart showing BKNG's trailing twelve month trading history, with the $1900 strike highlighted in orange:\n\nEND", "Warren Buffett and Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) Vice Chairman Greg Abel held the company's first-ever virtual annual meeting on Saturday, where we also got a look at Berkshire's first-quarter earnings report. In this episode of Industry Focus: Financials, host Jason Moser and Fool.com contributor Matt Frankel, CFP cover the key takeaways from the meeting and earnings, and give their take on Buffett's decision to sell all of Berkshire's airline stocks. Then, Matt's got his eye on Southwest Airlines (NYSE: LUV) despite Buffett's airline sales, while Jason's watching PayPal (NASDAQ: PYPL) ahead of the company's earnings report.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Walmart wasn't one of them! That's right -- they think these 10 stocks are even better buys.END", "\n                Looking ahead. The stock market continues to rally in the face of grim economic news. On Friday, data showed the U.S. unemployment rate soared to 14.7% in April as employers cut 20.5 million jobs during the month. Recent surveys of manufacturing, services, and business investment activity all showed tumbling figures. But U.S. stock indexes all closed the week with solid gains. As always, investors are looking to the future, and the economic data reflects conditions as they were last week, last month, or last quarter.Those focused on the recovery believe that the worst is already behind us and are moving to price in better data ahead. And trillions of dollars of monetary and fiscal policy stimulus have provided powerful tailwinds to both that recovery and risk assets, such as stocks.Regardless of the jobs data, the Dow Jones Industrial Average closed up 455 points, or 1.9%, on Friday. The S&P 500 rose 1.7% and the Nasdaq Composite gained 1.6%. The small-cap Russell 2000 index, more sensitive to upturns and plunges in the economy, added 3.5%.END", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThU.S. stock markets gained on Friday after data showed the economy lost fewer jobs in April than feared due to the coronavirus crisis, adding to optimism from an easing in tensions between Washington and Beijing. .NAt 11:29 ET, the Dow Jones Industrial Average .DJI was up 1.43% at 24,217.73. The S&P 500 .SPX was up 1.22% at 2,916.36 and the Nasdaq Composite .IXIC was up 1.19% at 9,086.758.   The top three S&P 500 .PG.INX percentage gainers:  ** News Corp Class A NWSA.O, up 12.5%  ** News Corp Class B NWS.O, up 12%  ** Noble Energy Inc NBL.O, up 9.6%   The top three S&P 500 .PL.INX percentage losers:  ** Cognizant Technology Solutions Corp CTSH.O, down 3.7%  ** Motorola Solutions Inc MSI.N, down 3.3%  ** Digital Realty DLR.N, down 2.7%   The top three NYSE .PG.N percentage gainers:  ** American Axle & Manufacturing Holdings Inc AXL.N, up 33.3%  ** Camping World Holdings Inc CWH.N, up 30.1%  ** Peabody Energy Corp BTU.N, up 25.6%   The top three NYSE .PL.N percentage losers:  ** AG Mortgage Investment Trust Inc MITT.N, down 27.6%  ** ProAssurance Corp PRA.N, down 18.1%  ** GTT Communications Inc GTT.N, down 16.2%   The top three Nasdaq .PG.O percentage gainers:  ** Protagonist Therapeutics Inc PTGX.O, up 104.8%  ** Everspin Technologies Inc MRAM.O, up 56.6%  ** Pra Group Inc PRAA.O, up 38%   The top three Nasdaq .PL.O percentage losers:  ** Catasys Inc CATS.O, down 15.8 %  ** Luminex Corp LMNX.O, down 14 %  ** Turtle Beach Corp HEAR.O, down 13.5 %     ** Goldman Sachs Group Inc GS.N: up 1.1%  ** JPMorgan Chase & Co JPM.N: up 2.2%  ** Citigroup Inc C.N: up 2.2%  ** Wells Fargo WFC.N: up 1.3%  ** Bank of America BAC.N: up 2.7%  ** Morgan Stanley MS.N: up 3.1%  BUZZ-U.S. big banks rise as yields gain on better-than-feared jobs data    ** Boeing Co BA.N: up 3.5%  BUZZ-Boeing jumps as 737 MAX nears production restart    ** Uber Technologies Inc UBER.N: up 4.3%  BUZZ-Street View: Uber set to speed past rivals as lockdowns ease    ** Qorvo Inc QRVO.O: up 2.3%  BUZZ-Rises on Q4 beat, raised outlook    ** Booking Holdings Inc BKNG.O: down 2.5%  BUZZ-Street View: Booking Holdings road to recovery remains uncertain END", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThU.S. stock markets gained on Friday after data showed the economy lost fewer jobs in April than feared due to the coronavirus crisis, adding to optimism from an easing in friction between Washington and Beijing. .NAt 10:27 a.m. ET, the Dow Jones Industrial Average .DJI was up 1.35% at 24,197.15. The S&P 500 .SPX was up 1.18% at 2,915.19 and the Nasdaq Composite .IXIC was up 1.09% at 9,077.9.   The top three S&P 500 .PG.INX percentage gainers:  ** News Corp Class A NWSA.O, up 11.1%  ** News Corp Class B NWS.O, up 10.1%  ** Noble Energy Inc NBL.O, up 10%   The top three S&P 500 .PL.INX percentage losers:  ** Motorola Solutions Inc MSI.N, down 6.7%  ** Fortinet Inc FTNT.O, down 3.8%  ** Cognizant Technology Solutions Corp CTSH.O, down 3.3%   The top three NYSE .PG.N percentage gainers:  ** Camping World Holdings Inc CWH.N, up 30.1%  ** American Axle & Manufacturing Holdings Inc AXL.N, up 26.5%  ** Timkensteel Corp TMST.N, up 23.3%   The top two NYSE .PL.N percentage losers:  ** AG Mortgage Investment Trust Inc MITT.N, down 27.6%  ** GTT Communications Inc GTT.N, down 15.3%   The top three Nasdaq .PG.O percentage gainers:  ** Protagonist Therapeutics Inc PTGX.O, up 73.4%  ** Everspin Technologies Inc MRAM.O, up 49.1%  ** Wisekey International Holding AG WKEY.O, up 30.1%   The top three Nasdaq .PL.O percentage losers:  ** Turtle Beach Corp HEAR.O, down 14%  ** Catasys Inc CATS.O, down 13.4%  ** Applied Optoelectronics Inc AAOI.O, down 13.5%     ** Consolidated Edison Inc ED.N: down 1.4%  BUZZ-Credit Suisse trims PT on COVID-19 impact, outlook cut    ** Uber Technologies Inc UBER.N: up 4.4%  BUZZ-Street View: Uber set to speed past rivals as lockdowns ease    ** Qorvo Inc QRVO.O: up 1.4%  BUZZ-Rises on Q4 beat, raised outlook    ** Booking Holdings Inc BKNG.O: down 1.5%  BUZZ-Street View: Booking Holdings road to recovery remains uncertain END", "In early trading on Friday, shares of United Airlines Holdings topped the list of the day's best performing components of the Nasdaq 100 index, trading up 6.7%.  Year to date, United Airlines Holdings Inc has lost about 72.4% of its value.\n\nAnd the worst performing Nasdaq 100 component thus far on the day is Cognizant Technology Solutions, trading down 4.5%.  Cognizant Technology Solutions is lower by about 9.6% looking at the year to date performance.\n\nTwo other components making moves today are Booking Holdings, trading down 3.9%, and Lam Research, trading up 5.0% on the day.\n\n \n\n\n\n\n\n\n\nVIDEO: Nasdaq 100 Movers: CTSH, UAL\nEND", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the  (Symbol: PNQI) where we have detected an approximate $130.6 million dollar outflow -- that's a 18.3% decrease week over week (from 4,650,000 to 3,800,000).  Among the largest underlying components of PNQI, in trading today Shopify Inc (Symbol: SHOP) is up about 2.9%, Uber Technologies Inc (Symbol: UBER) is down about 3.8%, and Booking Holdings Inc (Symbol: BKNG) is lower by about 1.3%. For a complete list of holdings, visit the PNQI Holdings page » \n\nThe chart below shows the one year price performance of PNQI, versus its 200 day moving average:\n   \n\nEND", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThWall Street was set to jump at the open on Friday as an easing in U.S.-China friction added to optimism from data showing the U.S. economy lost fewer jobs in April than feared due to the coronavirus crisis..NAt 9:13 ET, Dow e-minis 1YMc1 were up 1.19% at 24,126. S&P 500 e-minis ESc1 were up 1.18% at 2,914, while Nasdaq 100 e-minis NQc1 were up 0.96% at 9,195.5.   The top three NYSE percentage gainers premarket .PRPG.NQ:  ** Par Technology Corp PAR.N, up 35.6%  ** Camping World Holdings Inc CWH.N, up 27.8%  ** Ocwen Financial Corp OCN.N, up 26.5%   The top three NYSE percentage losers premarket .PRPL.NQ:  ** AG Mortgage Investment Trust Inc MITT.N, down 35.8%  ** Donnelley Financial Solutions Inc DFIN.N, down 22.2%  ** GTT Communications Inc GTT.N, down 13.6%   The top two Nasdaq percentage gainers premarket .PRPG.O:  ** Fuel Tech Inc FTEK.O, up 121.5%  ** Everspin Technologies Inc MRAM.O, up 37.2%   The top three Nasdaq percentage losers premarket .PRPL.O:  ** Microvision Inc MVIS.O, down 30.5%  ** Nanthealth Inc NH.O, down 21.3%  ** Hudson Capital Inc HUSN.O, down 16.9%    ** Uber Technologies Inc UBER.N: up 5.5% premarket  BUZZ-Street View: Uber set to speed past rivals as lockdowns ease    ** Qorvo Inc QRVO.O: up 8.2% premarket  BUZZ-Rises on Q4 beat, raised outlook    ** Booking Holdings Inc BKNG.O: down 1.3% premarket  BUZZ-Street View: Booking Holdings road to recovery remains uncertain    ** Roku Inc ROKU.O: down 8.0% premarket  BUZZ-Falls on declining advertising sales    ** Pluristem Therapeutics Inc PSTI.O: up 17.9% premarket  BUZZ-Rises on FDA nod for mid-stage COVID-19 treatment study    ** Spirit Airlines Inc SAVE.N: down 2.5% premarket  BUZZ-Spirit Airlines prices upsized stock, convertible debt deals    ** SunPower Corp SPWR.O: up 14.9% premarket  BUZZ-Rises on lower-than-expected Q1 loss, revenue beat    ** Walt Disney Co DIS.N: up 2.9% premarket  BUZZ-Rises as tickets for Shanghai park sell out like hot cakes    ** RedHill Biopharma Ltd RDHL.O: up 10.1% premarket  BUZZ-Rises on FDA approval for COVID-19 drug study    ** Fortress Biotech Inc FBIO.O: up 17.7% premarket  BUZZ-Fortress Biotech surges; co's potential platform being explored as COVID-19 treatment    ** Fluor Corp FLR.N: down 2.7% premarket  BUZZ-Falls after being subpoenaed by U.S. DOJ    ** Tenneco Inc TEN.N: up 9.3% premarket  BUZZ-Rises on smaller-than-expected sales decline    ** AG Mortgage Investment Trust Inc MITT.N: down 35.8% premarket  BUZZ-AG Mortgage plummets on bleak portfolio update    ** Meridian Bioscience VIVO.O: up 10.7% premarket  BUZZ-Jumps on higher 2020 outlook    ** Hostess Brands TWNK.O: up 4.7% premarket  BUZZ-Rises after posting upbeat earnings, reaffirming organic growth target    ** Camping World Holdings Inc CWH.N: up 27.8% premarket  BUZZ-RV maker Camping World surges after upbeat Q1    ** Cognizant Technology Solutions Corp CTSH.O: down 7.2% premarket  BUZZ-Cognizant falls as pandemic clouds 2020    ** Shopify SHOP.N: down 2.3% premarket  BUZZ-Shopify slips on $1.3 bln stock offering END", "END", "(RTTNews) - Below are the earnings highlights for Booking Holdings Inc. (BKNG):-Earnings: -$699 million in Q1 vs. $765 million in the same period last year. \n-EPS: -$17.01 in Q1 vs. $16.85 in the same period last year. \n-Excluding items, Booking Holdings Inc. reported adjusted earnings of $156 million or $3.77 per share for the period. \n-Analysts projected $6.10 per share \n-Revenue: $2.29 billion in Q1 vs. $2.89 billion in the same period last year.\n The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.END", "May 7 (Reuters) - Online travel agency Booking Holdings Inc's BKNG.O quarterly adjusted profit plunged 69% on Thursday, widely missing Wall Street estimates as travel demand took a severe hit from the COVID-19 pandemic.Countries around the world shut have borders and imposed lockdowns to check the spread of the novel coronavirus hitting travel demand.First-quarter revenue of the company, which operates Booking.com, fell 19% to $2.29 billion, from a year earlier.\"The COVID-19 pandemic has profoundly impacted our company and the entire travel industry,\" Chief Executive Officer Glenn Fogel said in a statement. END", "InvestorPlace - Stock Market News, Stock Advice & Trading Tips[Editor’s note: “7 Stocks to Buy Benefiting From Millennial Money” was previously published in January 2020. It has since been updated to include the most relevant information available.]Millennials are one of the largest generations in history, and yet they continue to get a bad rap for either being fiscally irresponsible or for failing to keep certain industries alive as their parents did. However, according to CB Insights, Generation Y is expected to receive $30 trillion in wealth over the next couple of decades, and this transfer of wealth is going to transform many industries that will benefit from their increased spending power. END", "The following are today's upgrades for Validea's Low PE Investor model based on the published strategy of John Neff. This strategy looks for firms with persistent earnings growth that trade at a discount relative to their earnings growth and dividend yield.NORTHERN TRUST CORPORATION (NTRS) is a large-cap value stock in the Investment Services industry. The rating according to our strategy based on John Neff changed from 62% to 81% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.Company Description: Northern Trust Corporation is a financial holding company. The Company provides asset servicing, fund administration, asset management, fiduciary and banking solutions for corporations, institutions, families and individuals across the world. Its segments include Corporate & Institutional Services (C&IS), Wealth Management, and Treasury and Other. The C&IS segment is a provider of asset servicing and related services to corporate and public retirement funds, foundations, endowments, fund managers, insurance companies, sovereign wealth funds and other institutional investors around the globe. The Wealth Management segment provides trust, investment management, custody and philanthropic services; financial consulting; guardianship and estate administration; family business consulting; family financial education; brokerage services, and private and business banking. It conducts its business through various subsidiaries.The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.END", "END", "In early trading on Friday, shares of NWSA topped the list of the day's best performing components of the S&P 500 index, trading up 11.9%.  Year to date, News has lost about 23.6% of its value.\n\nAnd the worst performing S&P 500 component thus far on the day is Motorola Solutions, trading down 8.3%.  Motorola Solutions is lower by about 22.5% looking at the year to date performance.\n\nOne other component making moves today is Booking Holdings, trading down 5.4% on the day.\n\n \n\n\n\n\n\n\n\nVIDEO: S&P 500 Movers: MSI, NWSA\nEND", "In this episode of Motley Fool Answers, Alison Southwick is joined by Motley Fool Senior Advisor and Certified Financial Planner Robert Brokamp and Motley Fool contributor Asit Sharma. They answer listeners' questions on the CARES Act, Dividend Aristocrats, backdoor Roth IRAs, retirement investing, and much more.Finally, they look at some suggestions sent in by listeners and suggest a few ways to pass the time while physical distancing.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the Invesco NASDAQ Internet ETF (Symbol: PNQI) where we have detected an approximate $132.0 million dollar inflow -- that's a 24.0% increase week over week in outstanding units (from 3,750,000 to 4,650,000).  Among the largest underlying components of PNQI, in trading today eBay Inc. (Symbol: EBAY) is off about 1.7%, MercadoLibre Inc (Symbol: MELI) is up about 3.1%, and Booking Holdings Inc (Symbol: BKNG) is lower by about 3.8%. For a complete list of holdings, visit the PNQI Holdings page » \n\nThe chart below shows the one year price performance of PNQI, versus its 200 day moving average:\n   \n\nEND", "Do you feel dizzy?I know I do.U.S. stocks just made their fastest move from bull market to bear market territory in recorded history -- then they reversed course, rocketed back, and recovered half of their COVID-19 losses. The net effect of all these gyrations, though, is that two months after the market first melt down, the S&P 500 still sits 16% below its high.  And if you want to, there's still time to buy.END", "The coronavirus pandemic has hit the entire global economy hard, but the travel industry has seen some of the biggest impacts. With air travel at a near-standstill, most people are staying home, and hotels just aren't getting booked. That's bad news for online travel specialist Booking Holdings (NASDAQ: BKNG), especially given its emphasis on international destinations. The company's stock is down more than 30% year to date, badly underperforming the broader stock market.This isn't the first time that Booking Holdings has had to recover from an existential crisis. During the dot-com bust, the company then known as Priceline.com found itself having to struggle to survive. But survive it did, and in the years that followed, Booking Holdings became one of the most successful stocks of the 21st century. Now, Booking Holdings once again will have to prove how resilient it can be in the face of adversity.BKNG data by YCharts.END", "BUDAPEST, April 28 (Reuters) - Hungarian competition watchdog GVH has fined online reservation operator Booking.com BKNG.O 2.5 billion forints ($7.58 million) for unfair business practices, including misleading advertisements and psychological pressure on consumers.The watchdog said in setting the fine it had taken into account the Netherlands-based company's fee income from the Hungarian market following a probe into the website launched in 2018.\"Booking.com B.V. has led unfair business practices by misleading advertisements claiming free cancellation for some accommodation as well as by exerting aggressive psychological pressure to facilitate faster bookings,\" the GVH said.Booking.com did not immediately respond to emailed questions for comment.END", "The following are today's upgrades for Validea's Earnings Yield Investor model based on the published strategy of Joel Greenblatt. This value model looks for companies with high return on capital and earnings yields.HEWLETT PACKARD ENTERPRISE CO (HPE) is a large-cap value stock in the Computer Hardware industry. The rating according to our strategy based on Joel Greenblatt changed from 80% to 90% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.Company Description: Hewlett Packard Enterprise Company is a provider of technology solutions. The Company's segments include: Enterprise Group, Software, Financial Services and Corporate Investments. The Enterprise Group segment provides its customers with the technology infrastructure they need to optimize traditional information technology (IT). The Software segment allows its customers to automate IT operations to simplify, accelerate and secure business processes and drives the analytics that turn raw data into actionable knowledge. The Financial Services segment enables flexible IT consumption models, financial architectures and customized investment solutions for its customers. The Corporate Investments segment includes Hewlett Packard Labs and certain business incubation projects, among others.The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.END", "In this episode of Motley Fool Answers, Alison Southwick, personal finance expert Robert Brokamp, and Motley Fool contributor Brian Feroldi take on some listeners' questions. Learn which companies investors are most curious about, why you should keep your lizard brain out of the investing process, and when it will be \"safe\" to invest. Finally, some recommendations to keep on your watch list.Our hosts also share some recommendations to keep you busy while you're maintaining physical distancing. Find out what they are and much more.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*END", "Among the underlying components of the S&P 500 index, we saw noteworthy options trading volume today in Booking Holdings Inc (Symbol: BKNG), where a total of 4,124 contracts have traded so far, representing approximately 412,400 underlying shares.  That amounts to about 72.5% of BKNG's average daily trading volume over the past month of 569,030 shares.  Especially high volume was seen for the $1450 strike call option expiring May 01, 2020, with 181 contracts trading so far today, representing approximately 18,100 underlying shares of BKNG.  Below is a chart showing BKNG's trailing twelve month trading history, with the $1450 strike highlighted in orange:\n\nEND", "Eikon search string for individual stock moves: STXBZThe Day Ahead newsletter: http://tmsnrt.rs/2ggOmBiThe Morning News Call newsletter: http://tmsnrt.rs/2fwPLThU.S. stock index futures edged higher on Thursday, buoyed by hopes that President Donald Trump would ease strict stay-at-home restrictions even as investors braced for another staggering jobless claims figure..NAt 8:26 ET, Dow e-minis 1YMc1 were up 0.02% at 23,395. S&P 500 e-minis ESc1 were up 0.13% at 2,778.5, while Nasdaq 100 e-minis NQc1 were up 0.50% at 8,636.75.   The top three NYSE percentage gainers premarket .PRPG.NQ:  ** Arcus Biosciences Inc RCUS.K, up 51.7%  ** Luby's Inc LUB.N, up 19.4%  ** Antero Midstream Corp AM.N, up 20.4%   The top three NYSE percentage losers premarket .PRPL.NQ:  ** Oi SA em Recuperacao Judicial OIBRc.K, down 31.4%  ** Diamond Offshore Drilling DO.N, down 22.6%  ** Natuzzi S.p.A.NTZ.N, down 14.6%   The top three Nasdaq percentage gainers premarket .PRPG.O:  ** Edison Nation Inc EDNT.O, up 176.6%  ** Atos SE ATOS.O, up 110.5%  ** Liberty TripAdvisor Holdings Inc LTRPB.O, up 70.1%   The top three Nasdaq percentage losers premarket .PRPL.O:  ** Allegro Merger Equity Warrants ALGRW.O, down 50%  ** Athersys Inc ATHX.O, down 25.5%  ** MICT Inc MICT.O, down 25.5%    ** Calithera Biosciences  CALA.O: down 15.9% premarket Calithera Biosciences slides on equity raise    ** Athersys Inc ATHX.O: down 25.5% premarket  BUZZ-Athersys drops on $50 mln equity raise to fund COVID-19 trial    ** Co-Diagnostics CODX.O: up 8.3% premarket  BUZZ-Co-Diagnostics: Jumps as COVID-19 test on saliva samples uses co's tech      ** UroGen Pharma URGN.O: up 12.2% premarket  BUZZ-UroGen Pharma: Jumps after cancer drug gets FDA nod    ** Netflix Inc NFLX.O: up 2.1% premarket  BUZZ-Netflix: Evercore ISI raises PT on favorable trends amid virus outbreak   ** Taiwan Semiconductor Manufacturing Co TSM.N: up 4.2% premarket  BUZZ-Taiwan Semiconductor Manufacturing rises as profit nearly doubles    ** Bed Bath & Beyond BBBY.O: up 16.4% premarket BUZZ-Bed Bath & Beyond: Rises after escaping Q4 with a profit beat amid pandemic    ** Arcus Biosciences RCUS.N: up 51.7% premarket  BUZZ-Arcus Biosciences: Surges on report of Gilead in talks for picking stake   ** Micron Technology MU.O: up 1.1% premarketEND", "END", "The energy industry has gone through a lot of turmoil in recent years. Oil and natural gas prices have fallen dramatically from much higher levels in the early 2010s, with crude in particular having fallen from triple-digit levels to just over $20 per barrel. That's had a huge impact on many exploration and production companies, pushing some of them to the brink of failure.Chesapeake Energy (NYSE: CHK) has been one of the hardest hit stocks in the energy sector, with shares down more than 99.5% since late 2014. With the stock trading at just $0.14 per share recently, Chesapeake has decided to resort to what for many companies proves to be a last-gasp effort to stay financially viable: doing a reverse stock split. The move should ensure that Chesapeake stock will keep trading on the New York Stock Exchange for now, but it raises the more important question of whether it'll actually help the company regain its former stature as a leader in the industry.END", "This hasn't been the greatest month for travel-related stocks. Certainly, cruises, airlines, and oil companies have all been mauled by the global COVID-19 pandemic, as people are ordered to stay at home and not travel. In addition, even when quarantines are lifted in the intermediate future, it's unclear how quickly travel volumes can come back to full pre-crisis strength.Yet even the most capital-light, digitally based travel companies are now feeling the pinch. The largest and arguably strongest travel-related company in the world is the world's leading online travel agent (OTA) Booking Holdings (NASDAQ: BKNG). Yet even Booking, the class of the industry, just released some downbeat forecasts for cash burn through the crisis, and it has quickly moved to raise cash and issue debt.END", "Online travel agency Booking Holdings (NASDAQ: BKNG) is booking a large new issue of debt. The company announced Wednesday that it is floating $750 million worth of convertible senior notes. They will be issued in a private placement that should close on Tuesday, April 14.These 0.75% notes mature on May 1, 2025, and are payable on May 1 and Nov. 1 of every year; the first payment will take place this November. Holders can convert them into either cash up to their principal amount, or Booking Holdings common stock.END", "In this episode of Motley Fool Answers, Alison Southwick is joined by Motley Fool personal finance expert Robert Brokamp and Motley Fool analyst Jason Moser to go through the mailbag to answer listeners' questions. They start with a discussion of the stimulus package. Then they answer listeners' questions about refinancing, why index funds make a great foundation, diversifying your portfolio through multiple accounts, using cash to invest versus paying off a mortgage, and many more interesting questions.They also make some great suggestions on how to spend time if you're locked down at home.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*END", "The following are today's upgrades for Validea's Earnings Yield Investor model based on the published strategy of Joel Greenblatt. This value model looks for companies with high return on capital and earnings yields.CORPORACION AMERICA AIRPORTS SA (CAAP) is a small-cap growth stock in the Misc. Transportation industry. The rating according to our strategy based on Joel Greenblatt changed from 0% to 100% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.Company Description: Corporacion America Airports SA is a focused on acquiring, developing and operating airport concessions. It operates approximately 52 airports globally in Latin America, Europe and Eurasia. The Company's airports are located in Argentina, Italy, Brazil, Uruguay, Ecuador, Armenia, and Peru. The Company's Argentine provinces serves metropolitan areas in several Argentine provinces, such as Buenos Aires, Cordoba and Mendoza and the city of Buenos Aires, tourist destinations, such as Bariloche, Mar del Plata and Iguazu, regional centers, such as Cordoba, Santa Rosa, San Luis, San Juan, La Rioja, Santiago del Estero and Catamarca and border province cities, such as Mendoza, Iguazu, Salta and Bariloche.The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.END", "Among the underlying components of the S&P 500 index, we saw noteworthy options trading volume today in Boeing Co.  (Symbol: BA), where a total of 222,759 contracts have traded so far, representing approximately 22.3 million underlying shares.  That amounts to about 48.9% of BA's average daily trading volume over the past month of 45.6 million shares.  Especially high volume was seen for the $145 strike call option expiring April 17, 2020, with 29,829 contracts trading so far today, representing approximately 3.0 million underlying shares of BA.  Below is a chart showing BA's trailing twelve month trading history, with the $145 strike highlighted in orange:\n\nEND", "END"]}