{"Title": ["Italy court restores content restrictions on Sky over pay-TV deal with Mediaset", "Iliad prepares launch of fixed-line services in Italy - sources", "Why Discount Retailers' Stocks Are Up", "7 AI Stocks That Are Looking to the Future", "Surprising Analyst 12-Month Target For IWX", "3 Dates for Disney Investors to Circle in June", "Jaws returns, as Universal Studios Japan to reopen this month", "EXCLUSIVE-Mexican broadcaster Televisa to launch mobile phone service, challenging Slim", "Italy court restores content restrictions on Sky over pay-TV deal with Mediaset", "Comcast, Charter Communications, ViacomCBS Partner On Blockgraph - Quick Facts", "3 No-Brainer Tech Stocks to Buy Right Now", "The Glaring Hole in HBO Max: It's Missing From Both Roku and Fire TV. Here's Why.", "AT&T launches HBO Max, vying with Netflix, others for quarantine viewing", "Who Stands to Gain From the PGA's Return?", "10 Value Stocks to Buy From the Vanguard U.S. Value Factor ETF", "Disney World Finally Has a Plan to Reopen", "There’s Still Time to Buy the Disney Stock Dip", "Why The Rubicon Project Stock Skyrocketed on Tuesday", "California Held Back the Promised Reopening Guidelines for Movie Production This Week", "Will You Wear a Face Mask to Visit Disney World?", "3 Big Missing Pieces From AT&T's HBO Max Launch", "Disney World Won't Match Universal Orlando's June 5 Reopening", "California Governor Wants to Restart Movie and TV Production, but Hollywood Players Aren't Ready Yet", "7 Out of 10 People Would Rather Be Home Than at a Multiplex", "AT&T launches HBO Max, vying with Netflix, others for quarantine viewing", "Disney World and Universal Florida Are Going to Open Faster (and Bigger) Than You Think.", "Soccer-Some English Premier League could be free-to-air when it returns - minister", "Walmart Stock Won’t Shine as Bright After Coronavirus Woes Fade", "HBO Max announces more launch partners; no deals yet with Amazon, Comcast, Roku", "Can Comcast's Flex Offset Its Video Subscriber Losses?", "Notable ETF Outflow Detected - DGRO, CMCSA, TXN, GILD", "Here's How Charter and Comcast Can Curb the Cord-Cutting Movement", "Disney World's Top Rival Has a Reopening Plan", "Why Shares of SmileDirectClub Trounced the Market on Tuesday", "Apple Is Making Another Massive Pivot With Apple TV+", "When Will Disney World, Universal, and SeaWorld Reopen?", "How to Invest in the Return of Professional Sports", "Friday's ETF with Unusual Volume: IXP", "How \"Trolls 2\" Skipping Theaters Could Change Streaming", "Will Disney World and Universal Orlando Ever Be the Same?", "It’s Tough To Bet Against Netflix, But Tread Carefully", "Shares in Britain's BT jump on report it could sell a stake in Openreach", "Soccer-Bundesliga to lure global TV audiences as soccer-starved fans tune in", "NBCUniversal Unveils Originals Available at Launch of Peacock", "Daily Dividend Report: MTRN,TRU,CMCSA,MDLZ,PPL", "Universal Studios Orlando Will Open Some CityWalk Stores This Week", "Will Disney World's Top Rival Reopen First?", "Comcast: Buy The Cable Business, Get Everything Else For - Almost - Free", "Soccer-Bundesliga boosts profile as soccer-starved fans tune in", "Noteworthy ETF Outflows: TQQQ, CMCSA, TSLA, COST"], "Elapsed Time": ["3 HOURS AGO", "1 DAY AGO", "2 DAYS AGO", "2 DAYS AGO", "3 DAYS AGO", "3 DAYS AGO", "3 DAYS AGO", "3 DAYS AGO", "3 HOURS AGO", "6 DAYS AGO", "MAY 28, 2020", "MAY 27, 2020", "MAY 27, 2020", "MAY 27, 2020", "MAY 27, 2020", "MAY 27, 2020", "5 DAYS AGO", "MAY 26, 2020", "MAY 26, 2020", "MAY 24, 2020", "MAY 22, 2020", "MAY 22, 2020", "MAY 21, 2020", "MAY 21, 2020", "MAY 27, 2020", "MAY 21, 2020", "MAY 20, 2020", "MAY 20, 2020", "MAY 20, 2020", "MAY 20, 2020", "MAY 20, 2020", "MAY 20, 2020", "MAY 21, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 15, 2020", "MAY 15, 2020", "MAY 15, 2020", "MAY 15, 2020", "MAY 20, 2020", "MAY 15, 2020", "MAY 15, 2020", "MAY 14, 2020", "MAY 14, 2020", "MAY 13, 2020", "MAY 13, 2020", "MAY 12, 2020", "MAY 15, 2020", "MAY 12, 2020"], "Published Date": ["Jun 4, 2020 9:08AM EDT", "Jun 3, 2020 8:01AM EDT", "Jun 2, 2020 7:22AM EDT", "Jun 1, 2020 2:24PM EDT", "Jun 1, 2020 9:00AM EDT", "Jun 1, 2020 8:30AM EDT", "Jun 1, 2020 3:56AM EDT", "May 31, 2020 1:00PM EDT", "Jun 4, 2020 9:08AM EDT", "May 29, 2020 8:19AM EDT", "May 28, 2020 9:00AM EDT", "May 27, 2020 6:48PM EDT", "May 27, 2020 1:30PM EDT", "May 27, 2020 12:41PM EDT", "May 27, 2020 11:36AM EDT", "May 27, 2020 8:10AM EDT", "May 29, 2020 2:49PM EDT", "May 26, 2020 2:58PM EDT", "May 26, 2020 9:19AM EDT", "May 24, 2020 2:00PM EDT", "May 22, 2020 3:00PM EDT", "May 22, 2020 8:15AM EDT", "May 21, 2020 11:30AM EDT", "May 21, 2020 9:14AM EDT", "May 27, 2020 6:00AM EDT", "May 21, 2020 7:09AM EDT", "May 20, 2020 1:24PM EDT", "May 20, 2020 1:02PM EDT", "May 20, 2020 12:00PM EDT", "May 20, 2020 11:24AM EDT", "May 20, 2020 10:53AM EDT", "May 20, 2020 8:40AM EDT", "May 21, 2020 8:00AM EDT", "May 19, 2020 7:59PM EDT", "May 19, 2020 4:20PM EDT", "May 19, 2020 11:55AM EDT", "May 15, 2020 4:18PM EDT", "May 15, 2020 12:02PM EDT", "May 15, 2020 11:59AM EDT", "May 15, 2020 11:55AM EDT", "May 20, 2020 6:40AM EDT", "May 15, 2020 6:52AM EDT", "May 15, 2020 6:06AM EDT", "May 14, 2020 7:49PM EDT", "May 14, 2020 11:59AM EDT", "May 13, 2020 11:40AM EDT", "May 13, 2020 8:22AM EDT", "May 12, 2020 12:39PM EDT", "May 15, 2020 9:34AM EDT", "May 12, 2020 10:51AM EDT"], "Link": ["https://www.nasdaq.com/articles/italy-court-restores-content-restrictions-on-sky-over-pay-tv-deal-with-mediaset-2020-06-04", "https://www.nasdaq.com/articles/iliad-prepares-launch-of-fixed-line-services-in-italy-sources-2020-06-03", "https://www.nasdaq.com/articles/why-discount-retailers-stocks-are-up-2020-06-02", "https://www.nasdaq.com/articles/7-ai-stocks-that-are-looking-to-the-future-2020-06-01", "https://www.nasdaq.com/articles/surprising-analyst-12-month-target-for-iwx-2020-06-01", "https://www.nasdaq.com/articles/3-dates-for-disney-investors-to-circle-in-june-2020-06-01", "https://www.nasdaq.com/articles/jaws-returns-as-universal-studios-japan-to-reopen-this-month-2020-06-01", "https://www.nasdaq.com/articles/exclusive-mexican-broadcaster-televisa-to-launch-mobile-phone-service-challenging-slim", "https://www.nasdaq.com/articles/italy-court-restores-content-restrictions-on-sky-over-pay-tv-deal-with-mediaset-2020-06-04", "https://www.nasdaq.com/articles/comcast-charter-communications-viacomcbs-partner-on-blockgraph-quick-facts-2020-05-29", "https://www.nasdaq.com/articles/3-no-brainer-tech-stocks-to-buy-right-now-2020-05-28", "https://www.nasdaq.com/articles/the-glaring-hole-in-hbo-max%3A-its-missing-from-both-roku-and-fire-tv.-heres-why.-2020-05-27", "https://www.nasdaq.com/articles/att-launches-hbo-max-vying-with-netflix-others-for-quarantine-viewing-2020-05-27-0", "https://www.nasdaq.com/articles/who-stands-to-gain-from-the-pgas-return-2020-05-27", "https://www.nasdaq.com/articles/10-value-stocks-to-buy-from-the-vanguard-u.s.-value-factor-etf-2020-05-27", "https://www.nasdaq.com/articles/disney-world-finally-has-a-plan-to-reopen-2020-05-27", "https://www.nasdaq.com/articles/theres-still-time-to-buy-the-disney-stock-dip-2020-05-29", "https://www.nasdaq.com/articles/why-the-rubicon-project-stock-skyrocketed-on-tuesday-2020-05-26", "https://www.nasdaq.com/articles/california-held-back-the-promised-reopening-guidelines-for-movie-production-this-week-2020", "https://www.nasdaq.com/articles/will-you-wear-a-face-mask-to-visit-disney-world-2020-05-24", "https://www.nasdaq.com/articles/3-big-missing-pieces-from-atts-hbo-max-launch-2020-05-22", "https://www.nasdaq.com/articles/disney-world-wont-match-universal-orlandos-june-5-reopening-2020-05-22", "https://www.nasdaq.com/articles/california-governor-wants-to-restart-movie-and-tv-production-but-hollywood-players-arent", "https://www.nasdaq.com/articles/7-out-of-10-people-would-rather-be-home-than-at-a-multiplex-2020-05-21", "https://www.nasdaq.com/articles/att-launches-hbo-max-vying-with-netflix-others-for-quarantine-viewing-2020-05-27", "https://www.nasdaq.com/articles/disney-world-and-universal-florida-are-going-to-open-faster-and-bigger-than-you-think.", "https://www.nasdaq.com/articles/soccer-some-english-premier-league-could-be-free-to-air-when-it-returns-minister-2020-05", "https://www.nasdaq.com/articles/walmart-stock-wont-shine-as-bright-after-coronavirus-woes-fade-2020-05-20", "https://www.nasdaq.com/articles/hbo-max-announces-more-launch-partners-no-deals-yet-with-amazon-comcast-roku-2020-05-20", "https://www.nasdaq.com/articles/can-comcasts-flex-offset-its-video-subscriber-losses-2020-05-20", "https://www.nasdaq.com/articles/notable-etf-outflow-detected-dgro-cmcsa-txn-gild-2020-05-20", "https://www.nasdaq.com/articles/heres-how-charter-and-comcast-can-curb-the-cord-cutting-movement-2020-05-20", "https://www.nasdaq.com/articles/disney-worlds-top-rival-has-a-reopening-plan-2020-05-21", "https://www.nasdaq.com/articles/why-shares-of-smiledirectclub-trounced-the-market-on-tuesday-2020-05-19", "https://www.nasdaq.com/articles/apple-is-making-another-massive-pivot-with-apple-tv-2020-05-19", "https://www.nasdaq.com/articles/when-will-disney-world-universal-and-seaworld-reopen-2020-05-19", "https://www.nasdaq.com/articles/how-to-invest-in-the-return-of-professional-sports-2020-05-15", "https://www.nasdaq.com/articles/fridays-etf-with-unusual-volume%3A-ixp-2020-05-15", "https://www.nasdaq.com/articles/how-trolls-2-skipping-theaters-could-change-streaming-2020-05-15", "https://www.nasdaq.com/articles/will-disney-world-and-universal-orlando-ever-be-the-same-2020-05-15", "https://www.nasdaq.com/articles/its-tough-to-bet-against-netflix-but-tread-carefully-2020-05-20", "https://www.nasdaq.com/articles/shares-in-britains-bt-jump-on-report-it-could-sell-a-stake-in-openreach-2020-05-15", "https://www.nasdaq.com/articles/soccer-bundesliga-to-lure-global-tv-audiences-as-soccer-starved-fans-tune-in-2020-05-15", "https://www.nasdaq.com/articles/nbcuniversal-unveils-originals-available-at-launch-of-peacock-2020-05-14", "https://www.nasdaq.com/articles/daily-dividend-report%3A-mtrntrucmcsamdlzppl-2020-05-14", "https://www.nasdaq.com/articles/universal-studios-orlando-will-open-some-citywalk-stores-this-week-2020-05-13", "https://www.nasdaq.com/articles/will-disney-worlds-top-rival-reopen-first-2020-05-13", "https://www.nasdaq.com/articles/comcast%3A-buy-the-cable-business-get-everything-else-for-almost-free-2020-05-12", "https://www.nasdaq.com/articles/soccer-bundesliga-boosts-profile-as-soccer-starved-fans-tune-in-2020-05-15", "https://www.nasdaq.com/articles/noteworthy-etf-outflows%3A-tqqq-cmcsa-tsla-cost-2020-05-12"], "Content": ["ROME, June 4 (Reuters) - Italy's top administrative court restored content restrictions on Comcast's unit Sky Italia, the country's top pay-TV player, a court document showed on Thursday.Last year, Italy's competition watchdog imposed a three-year ban preventing Sky's Italian business from distributing exclusive content on its online video-streaming service platform, including lucrative soccer broadcasting rights.The antitrust decision came after a pay-TV deal between Sky Italia and Italy's biggest commercial broadcaster Mediaset MS.MI, which the regulator said would limit competition in a market where Sky was already a dominant player.But In March an Italian administrative court lifted the restrictions, a decision which the Italian watchdog appealed.END", "MILAN, June 3 (Reuters) - French mobile operator Iliad ILD.PA is close to signing a deal with broadband network company Open Fiber to offer fixed-line data services in Italy, sources said on Wednesday.The move comes as COVID-19 underlines the importance for businesses of fast fiber connections to streamline operations.Over the past few years, fixed-line telephony has been under pressure in Italy but the pandemic has changed perspectives as companies embrace smartworking and look set to enhance their use of digital networks.\"Open Fiber and Iliad have been talking for several months and an agreement now looks close\", one of the sources said.END", "The stock market was underwhelmed despite strong results from major retailers. In this episode of Motley Fool Money, Chris Hill is joined by Motley Fool analysts Jason Moser and Ron Gross to go through the latest headlines from Wall Street, employment figures, the change in people's spending habits, and corporate debt. They also share results from the CRM, discount retailers, and cosmetics spaces, as well as news that an iconic brand has filed for bankruptcy. Finally, they answer listener questions and share some stocks to put on your watchlist and much more.Later in the show, Rick Munarriz and Mac Greer chat about the reopening of theme parks and the entertainment industry in general.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsDespite the adverse impact of the novel coronavirus, AI stocks have fared relatively well. Consider the Global X Robotics & Artificial Intelligence (NASDAQ:BOTZ) ETF. For 2020, the fund has returned about 6%.The interesting thing is that until about 10 years ago or so, AI was mostly a backwater. Let’s face it, investors were more interested in areas like cloud computing.But there would emerge some major catalysts that would make AI a must-have. There were the breakthroughs in the underlying algorithms, such as deep learning. They would lead to vast improvements in accuracy — making it possible for much better image and facial recognition systems.END", "Looking at the underlying holdings of the ETFs in our coverage universe at ETF Channel, we have compared the trading price of each holding against the average analyst 12-month forward target price, and computed the weighted average implied analyst target price for the ETF itself. \tFor the iShares Russell Top 200 Value ETF (Symbol: IWX), we found that the implied analyst target price for the ETF based upon its underlying holdings is $55.40 per unit.\n\n\nWith IWX trading at a recent price near $50.00 per unit, that means that analysts see 10.80% upside for this ETF looking through to the average analyst targets of the underlying holdings.   Three of IWX's underlying holdings with notable upside to their analyst target prices are General Electric Co (Symbol: GE), Exelon Corp (Symbol: EXC), and Comcast Corp (Symbol: CMCSA). Although GE has traded at a recent price of $6.57/share, the average analyst target is 25.37% higher at $8.24/share. Similarly, EXC has 20.07% upside from the recent share price of $38.31 if the average analyst target price of $46.00/share is reached, and analysts on average are expecting CMCSA to reach a target price of $46.89/share, which is 18.40% above the recent price of $39.60. Below is a twelve month price history chart comparing the stock performance of GE, EXC, and CMCSA:  \n\n END", "May wasn't too bad for Disney (NYSE: DIS) shareholders. The stock moved 8.5% higher for the month, nearly doubling the general market's return. A mixed quarterly report, the reopening of Shanghai Disneyland, and setting a July 11 date to start greeting theme park visitors at Disney World have set the tone for the media giant. June promises to be just as exciting. Between rivals that are opening up their gated attractions, another theatrical release going the Disney+ route instead, and a high-profile series launching on the premium streaming service, there will be a few dates for Disney investors to watch out for this month.END", "TOKYO, June 1 (Reuters) - Jaws is back. So are the herd of Hippogriffs from Hogwarts, and the T.Rex from Jurassic Park as Universal Studios Japan said on Monday its theme park in Osaka would open later this month for the first time since closing in March due to the coronavirus.The Japanese theme park operator owned by U.S. cable and media company Comcast Corp CMCSA.O said it would reopen on June 8 to residents of Osaka Prefecture, and to residents of nearby regions from June 19.Universal Studios Japan's (USJ) reopening comes after the Asian nation lifted its state of emergency on Osaka Prefecture and surrounding regions on May 21 following a sustained fall in the number of coronavirus infections in the area.On its website, USJ said visitors will be required to wear face masks on park grounds at all times. They will have their temperature checked before entry, and will be required to follow social distancing rules on rides and other attractions, it added.END", "By Julia LoveMEXICO CITY, May 31 (Reuters) - Mexican broadcaster Televisa said on Sunday it will start offering mobile phone service, a bid to challenge billionaire Carlos Slim's America Movil, which has long dominated the country's telecommunications market.Rather than building infrastructure, Televisa TLVACPO.MX will operate as a mobile virtual network operator, or MVNO, and begin by offering service to existing customers of its cable and home internet packages, sold under its Izzi brand. The broadcaster will rent space on Mexico's wholesale telecom network, operated by Altan Redes.Televisa originally planned to roll out the service in September, Izzi Chief Executive Salvi Folch said in an interview. But as cases of the coronavirus began climbing, executives sensed the economic turmoil stemming from the virus would create more demand for low-price phone packages and will now launch the service on Monday.\"The pandemic made us accelerate our plans,\" Folch said. \"People will have to spend less on some services. ... We view it as an opportunity.\"END", "ROME, June 4 (Reuters) - Italy's top administrative court restored content restrictions on Comcast's unit Sky Italia, the country's top pay-TV player, a court document showed on Thursday.Last year, Italy's competition watchdog imposed a three-year ban preventing Sky's Italian business from distributing exclusive content on its online video-streaming service platform, including lucrative soccer broadcasting rights.The antitrust decision came after a pay-TV deal between Sky Italia and Italy's biggest commercial broadcaster Mediaset MS.MI, which the regulator said would limit competition in a market where Sky was already a dominant player.But In March an Italian administrative court lifted the restrictions, a decision which the Italian watchdog appealed.END", "(RTTNews) - Comcast Corp. (CMCSA), Charter Communications, Inc. (CHTR) and ViacomCBS (VIAC; VIACA) have entered into an agreement to take equal ownership of Blockgraph, a software platform designed to create a more secure way to use aggregated and anonymized data and share information. The joint venture is focused on ushering in a new way of using audience data for advanced TV and premium video advertising. Blockgraph was launched in 2017 and incubated to date within Comcast Advertising's technology unit, FreeWheel. Jason Manningham, previously general manager of Blockgraph under FreeWheel, will now lead the new joint venture as chief executive officer. The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.END", "No-brainer stocks may be hard to come by in today's market. After all, the S&P 500 has rebounded more than 36% from the low it hit on March 23 and is within breathing distance of the all-time high it set on February 19, just a little more than 10% off its peak.At the same time, the economy has gotten whacked by the COVID-19 pandemic, and most major economic indicators point to a deep recession. Traditional market metrics generally say stocks are overvalued. Despite the challenges and the uncertainty for investors in the current market environment, there are still some good deals for high growth stocks that should do well regardless of what happens with the COVID-19 pandemic. Keep reading to see why Roku (NASDAQ: ROKU), JD.com (NASDAQ: JD), and Livongo Health (NASDAQ: LVGO) should be on your buy list.END", "HBO Max, the streaming service launched by AT&T's (NYSE: T) WarnerMedia, made its debut on Wednesday. The service, which is anchored by content from its namesake HBO, went live packing a $14.99 monthly price tag and a host of flagship programming.Unfortunately, even with more than a dozen distribution deals in place, there was a glaring hole in its launch strategy that put a damper on the festivities: Viewers using Amazon.com's (NASDAQ: AMZN) Fire TV or a Roku (NASDAQ: ROKU) device are unable to access the service. END", "By Helen CosterMay 27 (Reuters) - AT&T’s WarnerMedia division launches its HBO Max streaming service on Wednesday, taking on Netflix, Disney and Amazon at a time when coronavirus lockdowns have boosted demand for streaming even as rising unemployment has cut disposable incomes.HBO Max launches to a captive audience stuck at home without access to theater, live music, shopping excursions or live or televised sporting events. That situation helped Netflix Inc NFLX.O sign up 15.8 million new paying customers in the first three months of the year, more than double what it expected to attract.But with film and TV productions halted across the globe, HBO Max has postponed dozens of releases - most notably a “Friends” reunion special originally planned for launch. If HBO Max does not resume production by this fall, the service could start to see a shortage of original content as early as January, according to a source familiar with the company. At $15 per month, the service is more expensive than both the $7 per month Disney+ streaming service and the $13 per month standard Netflix plan. Still, WarnerMedia hopes to reach about 80 million global HBO Max subscribers by 2025.END", "Professional golf is set to return on June 11 this year. While the sport will look different, sports fans will be likely be delighted to see live sports once more.How will the PGA ensure player safety? League officials will test players and all other tournament attendees daily. Rapid testing will be used to limit delays and uncertainty.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsGoldman Sachs’ chief U.S. equity strategist, David Kostin, recently stated that the gap between cheap stocks and expensive stocks, except for the tech bubble of 1999, has never been wider. He believes there are value stocks to buy once the economy regains its footing. Value stocks have gone out of fashion; it’s hard to remember when these stocks outperformed growth stocks. According to MarketWatch contributor Brett Arends, the last time was between 2000 and 2006, when value stocks delivered a total return of 15% compared to a 40% decline for growth stocks. However, you have to go back even farther, to the period of 1975 to 1988 to get a period where stocks with the value profile gave growth stocks a real smackdown. In those 13 years, value stocks had a total return of 300%, more than double the 115% total return for growth stocks.END", "Some of the smaller regional amusement park attractions in Central Florida have been reopening after pandemic-related closures, and now we will hear from the Big Cheese itself. Walt Disney (NYSE: DIS) will be presenting plans to reopen Disney World before the county's economic recovery task force on Wednesday morning. SeaWorld Entertainment (NYSE: SEAS) will also be making its presentation before the committee.All reopening plans have to include the dates when they expect to get back to business, and that will be the biggest takeaway from the presentation. The mayor's committee and governor's office have to approve the proposals, but there haven't been any rejections yet. Comcast's (NASDAQ: CMCSA) Universal Orlando had its plans approved last week. It will open to select annual pass holders on June 3 and all day guests come June 5, so it's fair to say that just about any date in June that SeaWorld Orlando and Disney World offer up at this point will fly given the state's aggressive pro-business reopening stance.  END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsThere’s a lot I don’t understand about science and virology. But I understand marketing and the power of a great brand. So even in the midst of a global selloff in equities, I remained bullish on Disney (NYSE:DIS). And since my last article, DIS stock is up 20%.END", "END", "The State of California updated its stay-at-home orders on Monday, May 25. The new framework includes guidelines for opening shopping centers and places of worship, but Gov. Gavin Newsom's office did not provide a roadmap for restarting the production of movies and TV shows.END", "If you thought that nothing stirs up unrest at family reunions better than talking about politics, sports, or religion, try face masks on for size.Nothing seems to get theme park buffs on social media more worked up than debating on gated attractions requiring guests to wear a face covering during their visits as they gear up to reopen in the new normal. It's the policy that Walt Disney (NYSE: DIS) rolled out when it opened Shanghai Disneyland two weeks ago, and it's one that rival Comcast (NASDAQ: CMCSA) is instituting at Universal Orlando when that resort reopens on June 5. Disney's CEO recently said it's \"likely\" that Disney World and Disneyland will also require face coverings to help contain the spread of COVID-19.Shanghai Disneyland and Universal Orlando aren't just requiring that all guests wear masks to enter and remain in their parks. They are both performing temperature checks on the way in, flagging anyone running with a fever. Social distancing measures including floor markings are being implemented to keep parties reasonably apart from others. The parks are also working with lower capacity ceilings to keep crowds in check. END", "AT&T (NYSE: T) is set to launch HBO Max next week, and it's lined up a lot of distribution partners. It announced partnerships with a host of pay-TV providers and connected-TV platforms, but there are a three big omissions from its current lineup: Comcast (NASDAQ: CMCSA), Amazon (NASDAQ: AMZN), and Roku (NASDAQ: ROKU). Soon-to-be CEO John Stankey told investors earlier this month that HBO Max probably won't be available on Amazon's Fire devices at launch. He was confident the company would get deals done with everyone else ahead of the service's debut on May 27.It's not a huge surprise AT&T has been unable to strike deals with the largest pay-TV provider in the country, and pushback from Amazon and Roku was to be expected. AT&T's strategy with HBO Max seemed to be to leverage its nationwide distribution for its pay-TV and wireless services in order to squeeze the margins on its smaller competitors in cable TV. But launching without these three platforms will put a significant damper on HBO Max's ability to sign up new subscribers.END", "Theme parks in Central Florida will start opening sooner than you probably think. Comcast's (NASDAQ: CMCSA) Universal Orlando was the first of the area's three major attractions to present reopening plans before the county's task force, and the resort's detailed blueprint to start welcoming guests again on June 5 was overwhelmingly approved by the committee. Universal Orlando's reawakening has one more hurdle to clear. The governor's office will need to approve the plan, and that could happen as soon as Friday.No one expects Comcast's larger rival to follow the same aggressive timeline. Walt Disney (NYSE: DIS) may have just opened its shopping and dining complex on Wednesday, but the stakes are higher when it comes to high-volume theme parks with queues to manage, attractions to perpetually sanitize, and crowd flows to regulate. Disney probably intentionally let its top rival submit its reopening plan first. The House of Mouse is going to watch -- and learn. END", "California Gov. Gavin Newsom wants to roll out a framework for restarting movie and TV production in the Golden State, planning to publish the rules on Monday, May 25. Newsom made the announcement on a public video conference with eight representatives from the production side on Thursday morning. None of the panelists were excited about the prospect of a quick restart, often pushing back with COVID-19 safety concerns and calls for continued patience.END", "Multiplex operators see better days ahead. AMC Entertainment Holdings (NYSE: AMC) dreams about a future in which it can fire up its projectors again, and patrons will come rushing back to the creature comforts of big-screen entertainment. But what if AMC threw a screening party and nobody came? What if instead of running to the corner multiplex after the shelter-in-place phase of the pandemic passes, movie buffs decide that they would rather just stay home? Cabin fever morphing into cabin theater could be a thing. In a Variety exclusive on Wednesday, a survey by sports and events analytics firm Performance Research, in partnership with Full Circle Research, asked participants if they would rather see a first-run feature film at a movie theater or as a digital rental at home. A jaw-dropping 70% of those surveyed said that they would prefer to watch the new theatrical release at home. And it's even worse than you think. END", "By Helen CosterMay 27 (Reuters) - AT&T’s WarnerMedia division launches its HBO Max streaming service on Wednesday, taking on Netflix, Disney and Amazon at a time when coronavirus lockdowns have boosted demand for streaming even as rising unemployment has cut disposable incomes.HBO Max launches to a captive audience stuck at home without access to theater, live music, shopping excursions or live or televised sporting events. That situation helped Netflix Inc NFLX.O sign up 15.8 million new paying customers in the first three months of the year, more than double what it expected to attract.But with film and TV productions halted across the globe, HBO has postponed dozens of releases - most notably a “Friends” reunion special originally planned for launch. If HBO Max does not resume production by this fall, the service could start to see a shortage of original content as early as January, according to a source familiar with the company. At $15 per month, the service is more expensive than both the $7 per month Disney+ streaming service and the $13 per month standard Netflix plan. Still, WarnerMedia hopes to reach about 80 million global HBO Max subscribers by 2025.END", "Walt Disney (NYSE: DIS) has already opened its Disney Springs shopping area at Walt Disney World. Comcast (NASDAQ: CMCSA) has done the same with its CityWalk shopping area that essentially serves as the entrance to its two Florida theme parks. Both companies have taken significant safety steps to ensure social distancing. That includes limiting capacity, marking out where people should (and shouldn't stand), making employees as well as vistors wear masks, and increasing how often surfaces are cleaned. Restaurants also have limited seating, and visitors are encouraged to wear a facial covering.Many consider these openings as the first step toward throwing open the doors to the Disney and Universal theme parks. Now, Florida Gov. Ron DeSantis has provided direct details as to what the two companies need to do in order to make that happen.END", "Adds quotes, detailLONDON, May 20 (Reuters) - Some English Premier League games could be shown on a free-to-air basis when soccer returns after pausing due to coronavirus, culture minister Oliver Dowden said on Wednesday.Dowden said current rights-holders had to be respected but that there was flexibility because rules restricting Saturday afternoon broadcastsof matches would not apply.\"The idea was that people would be able to watch them in the stadium, so they didn't want to compete. Clearly that won't be possible if we compete behind closed doors,\" Dowden told reporters.\"I think that creates an opportunity for us to be able to get some sport, some Premier League, free-to-air.\"END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsWhen does a huge, slow-growing retailer become a hot stock? In the middle of a pandemic. Walmart (NYSE:WMT) stock is up 5% in 2020, while the average stock in the S&P 500 is down almost 10%, because it delivers earnings through the novel coronavirus lockdown.END", "By Helen CosterMay 20 (Reuters) - HBO Max, the forthcoming streaming service from AT&T Inc T.N-owned WarnerMedia, announced on Wednesday several new partners will carry its content, but it has not yet announced deals with Comcast Corp CMCSA.O, Amazon.com Inc AMZN.O or Roku Inc ROKU.O.HBO Max will be available on Altice USA Inc ATUS.N, Cox Communications, Microsoft Corp MSFT.O, National Cable Television Cooperative (NCTC), Samsung, Sony Interactive Entertainment and Verizon Communications Inc VZ.N when it launches on May 27, the company said.The company had previously announced distribution deals with Apple Inc AAPL.O, Charter Communications Inc CHTR.O, Hulu and Alphabet Inc's GOOGL.O Google and YouTube TV.HBO Max is launching at a time when demand for new content is high - as more people are staying home due to the coronavirus - but consumers' income may have taken a hit as a result of the pandemic. The service will cost $15 per month for non-AT&T customers; WarnerMedia is also offering lower-cost promotional deals and has said HBO Max will be free to some AT&T customers at launch.END", "The head of Comcast's (NASDAQ: CMCSA) cable segment, Dave Watson, faces a tough challenge this year. The company was already forecasting an increase in video subscriber losses for 2020, then the novel coronavirus came to town. The impact of COVID-19 is likely to accelerate cord-cutting this year as content starts to dry up without sports or new productions and many consumers face economic hardships.At an investor conference earlier this month, Watson noted the number of new broadband-only subscribers using its Flex streaming box product offset its video subscriber losses over the last two months.Roku (NASDAQ: ROKU) -- the U.S. leader in connected TV devices -- has previously compared itself to Comcast and other pay-TV distributors. But its average revenue per user and gross profits are far lower than even Comcast's lowest-priced skinny bundles. And Comcast still has a long way to go before it's even close to monetizing Flex on the same level as Roku, let alone the low end of its live TV packages.END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares Core Dividend Growth ETF (Symbol: DGRO) where we have detected an approximate $152.2 million dollar outflow -- that's a 1.7% decrease week over week (from 256,950,000 to 252,700,000).  Among the largest underlying components of DGRO, in trading today Comcast Corp (Symbol: CMCSA) is up about 1.7%, Texas Instruments Inc. (Symbol: TXN) is up about 5.1%, and Gilead Sciences Inc (Symbol: GILD) is higher by about 1.2%. For a complete list of holdings, visit the DGRO Holdings page » \n\nThe chart below shows the one year price performance of DGRO, versus its 200 day moving average:\n   \n\nEND", "Since 2014's peak in the total number of U.S. cable television customers, streaming alternatives like Netflix (NASDAQ: NFLX) have served as the scapegoat for falling subscriptions. And for good reason -- Netflix's subscriber headcount has grown from just under 38 million then to nearly 70 million U.S. and Canadian subscribers now. Digital market research house eMarketer estimates the country's cable industry has slimmed down from 100.5 million paying households to somewhere around 85 million customers now. Streaming may lack live broadcasts, but fewer and fewer consumers seem to care.What if, however, the video entertainment market wasn't as either/or as it's been made out to be? That is to say, what if the two options weren't as mutually exclusive of one another as we've been led to believe is inevitable?That may actually be the case, given some curious data from The Diffusion Group. The consumer research outfit says a sizable swath of traditional cable television customers used their cable provider's streaming services -- the ones that provide them anyway -- quite a bit more than they normally did before the coronavirus trapped much of the nation at home.END", "The economy has been reawakening in Central Florida after two months of shelter-in-place slumber, and it's time for the country's largest theme-park operators to step up with their reopening plans. Comcast's (NASDAQ: CMCSA) Universal Orlando will be the first of the area's major players to submit plans to its county's Economic Recovery Task Force. It will present its plan on Thursday, and the proposal will come with a projected opening date.Some news outlets initially claimed that Walt Disney (NYSE: DIS) and SeaWorld Entertainment (NYSE: SEAS) would also be presenting their plans today, but those reports have now been revised to clarify that the companies aim to make their presentations in the coming days.All eyes will be on Universal Orlando, of course. If the fast-growing resort receives the green light to unlock the turnstiles at its gated attractions. it starts the clock for everybody else to fall in line. As awkward and inconvenient as the initial reopening process will be, no one wants to be left behind at this point.END", "END", "For a company known for having cohesive long-term visions, Apple (NASDAQ: AAPL) has spent years fumbling its video-streaming strategy. You might recall that Apple originally bundled original content with Apple Music, a music-streaming service. One of the early projects was a show that would be based on Dr. Dre, who briefly served as an Apple executive after the company bought Beats. Once upon a time, services chief Eddy Cue even explicitly said that Apple was not interested in creating TV shows or competing with Netflix (NASDAQ: NFLX).Not only has Apple proceeded to do precisely those things, the company may be preparing to make yet another massive pivot in video streaming.END", "This is a big week for Disney (NYSE: DIS), Universal parent Comcast (NASDAQ: CMCSA), and SeaWorld Entertainment (NYSE: SEAS) in Florida. The state began accepting submissions for reopening plans from theme park operators on Monday, and with the Sunshine State gradually advancing through its phased recovery efforts, it's just a matter of time before turnstiles start clicking again.The groundwork is literally being laid out in preparation for the inevitable restart. Comcast's Universal Orlando is already placing social distancing stickers on the floor of its theme park entrances to keep families apart when it is allowed to reopen. Disney World came to terms with its unions late last week on the conditions for their return to work. SeaWorld Orlando hasn't been tipping its hand as to when it will reopen, but with the stock up 133% since bottoming out two months ago, the expectations are starting to surface.END", "Societal habits have changed dramatically in the last two months. No longer are restaurants filled with folks connecting over a meal or a beer. No longer are classrooms filled with students being educated. No longer are malls bustling with consumers hunting for the perfect purchase.While I am excited for my state's eventual safe reopening, I am not as eager for chores like depositing a check or filling a script. The pandemic pushed many, including myself, into learning how so many things can be done more quickly and easily from home. Life will return to some kind of normal, but some experiences and activities will be structurally changed forever.END", "The iShares Global Comm Services ETF is seeing unusually high volume in afternoon trading Friday, with over 352,000 shares traded versus three month average volume of about 55,000.  Shares of IXP were down about 0.8% on the day.\n\nComponents of that ETF with the highest volume on Friday were AT&T, trading off about 1.7% with over 12.4 million shares changing hands so far this session, and Comcast, down about 1.9% on volume of over 7.5 million shares. Electronic Arts is the component faring the best Friday, higher by about 0.8% on the day. \n\n \n\n\n\n\n\n\n\nVIDEO: Friday's ETF with Unusual Volume: IXP\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.END", "When Comcast's (NASDAQ: CMCSA) NBCUniversal announced in April that its majority-owned Fandango service would be acquiring a similar platform called Vudu from Walmart (NYSE: WMT), I categorized it as a last chance for transactional video to prove itself. The transactional video-on-demand (or TVOD) market's growth has been lethargic at best, but Comcast, NBC, and Universal are television and movie powerhouses, respectively. If it can be done well, they can do it.The jury is still out on the true potential of TVOD, but the business model just bought itself some time. With millions of people trapped at home thanks to the coronavirus contagion last quarter, transactional video did surprisingly well.It didn't do as well as subscription streaming, mind you. That race is still being led by the likes of Netflix (NASDAQ: NFLX), and by a country mile. But, there's a glimmer of hope. The quarter currently underway will serve as the proverbial litmus test for the idea. COVID-19 still has millions of people stuck at home, and in the meantime, a handful of major movie titles have been released in a direct-to-consumer format. More are on the way. Chief among those titles is Universal's controversial Trolls 2, which Universal's chief touted as evidence the film industry doesn't necessarily need movie theaters anymore.In other words, these unusual circumstances could finally gel TVOD's place -- and growth -- within the streaming arena.END", "Thursday afternoon wasn't business as usual for Comcast's (NASDAQ: CMCSA) Universal Orlando Resort. The Central Florida theme park resort has been closed for two months, but it did reopen parts of CityWalk, the shopping, dining, and entertainment complex that connects its parking garages to its still-shuttered gated attractions. The handful of establishments will continue to open from 4 p.m. to 9 p.m. daily. The Walt Disney Company (NYSE: DIS) will reopen Disney Springs at Disney World -- also in phases -- starting next week.The first day of business since mid-March wasn't ideal at CityWalk. Field reports have most visitors abiding by social distancing and face mask requirements, but the first wave of guests consisted mostly of bloggers and cabin fever-saddled locals who seemed more interested in planting the flag than spending money. There were lines to get into the few stores open, but mostly for folks recording walkthroughs, rather than hitting the register with items to buy. There were more people taking selfies than eating at the restaurants or bellying up to the bar. In short, there were more shots taken than shots purchased.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsIt’s no surprise that Netflix (NASDAQ:NFLX) stock is a top performer so far this year. The novel coronavirus has been a tailwind for the streaming giant. With millions stuck at home, U.S. subscriber numbers have skyrocketed as of late.END", "Adds analysts reaction, banking sourceLONDON, May 15 (Reuters) - Shares in BT BT.L rose as much 9% on Friday from decade lows after the Financial Times said Britain's biggest broadband operator was in talks to sell a stake in its Openreach networks unit.The report said potential buyers had held talks with BT in the last three weeks and that the talks were in an early stage and the structure of any investment remained under discussion. Openreach, a wholly owned subsidiary of BT, operates Britain's nationwide broadband network. BT and rivals such as Sky CMCSA.O TalkTalk TALK.L use its lines to provide broadband to their customers.The FT said potential buyers of a stake included Australian investment firm Macquarie and an unnamed sovereign wealth fund. However, a source close to Macquarie told Reuters the investment firm had not expressed an interest in buying a stake and was not in talks with BT.END", "By Alexander HübnerMUNICH, May 15 (Reuters) - Germany's Bundesliga will attract legions of new armchair fans around the world this weekend when it becomes the first of Europe’s major soccer leagues to resume after a two-month shutdown due to the coronavirus.In normal circumstances, the German game, dominated in recent seasons by Bayern Munich, lacks the marketing pull of England's Premier League or Spain’s La Liga, which boasts the world’s two biggest clubs in terms of revenue - Barcelona and Real Madrid.Yet even with a subdued atmosphere given the absence of passionate fans, with all games being played behind closed doors to prevent the spread of the coronavirus, the Bundesliga can use the spotlight to show its worth to devotees missing live action around the globe.\"With the Bundesliga as the only league to be broadcast on TV, I expect we will have an audience of a billion,\" Bayern CEO Karl-Heinz Rummenigge told SportBild magazine on Wednesday. END", "On Thursday, NBCUniversal, the studio arm of Comcast (NASDAQ: CMCSA), announced its slate of original programming that will be available to users of streaming service Peacock when it launches on July 15. Viewers will be treated to nine original series or movies, with content ranging from kid-friendly to conspiracy thrillers.Peacock superficially looks a lot like Netflix or Tubi, offering watchers a variety of televised entertainment. There are differences between Peacock and other streaming services, however. Chiefly, Peacock is the first such service from a major network and studio that will be offered in an ad-supported, free-to-use format. NBCUniversal will include some of its conventional programming in Peacock's library but has opted to create originals to steer consumers toward the streaming option.END", "\nMaterion announced today that its Board of Directors declared a second quarter 2020 dividend of $0.115 per share of common stock, an increase of $0.005 per share, or approximately 5%. The dividend is payable on June 10, 2020 to shareholders of record at the close of business on May 29, 2020.  Jugal Vijayvargiya, President and CEO, stated, \"The dividend increase reflects our eighth consecutive annual increase and continuing confidence in the strength of our business, its prospects for long-term growth and our ability to generate cash sufficient to continue to grow the business organically as well as through acquisitions while returning cash to shareholders.\"On an annualized basis, the amount of the dividend is $0.46 per share and equates to a yield of approximately 1% based on the Materion common stock price at the close of trading on May 13, 2020.\n\nTransUnion today announced that its Board of Directors declared a cash dividend of $0.075 per share for the first quarter 2020. The dividend will be payable on June 12, 2020 to shareholders of record on May 28, 2020. \n\nComcast announced that its Board of Directors declared a quarterly dividend of $0.23 a share on the company's common stock. The quarterly dividend is payable on July 22, 2020 to shareholders of record as of the close of business on July 1, 2020. \n\nThe Board of Directors of Mondelez International today declared a regular quarterly dividend of $0.285 per share of Class A common stock. This dividend is payable on July 14, 2020, to shareholders of record as of the close of business on June 30, 2020.\nEND", "Universal Studios Orlando will open up on Thursday, May 14, but you won't be able to enjoy the actual theme parks yet. The Comcast (NASDAQ: CMCSA) resort will start slowly with limited operating hours and several COVID-19 security precautions, and only the CityWalk shopping and dining area will be open.END", "Central Florida's defining theme parks aren't allowed to open just yet in the current phase of the state's recovery efforts, but The Walt Disney Company (NYSE: DIS) and Universal Orlando parent Comcast (NASDAQ: CMCSA) are making the most of the short leash that they have been given for now. With the state's restaurants and retail outlets able to reopen with social-distancing safeguards and pared-back capacity, Disney World and Universal Orlando are ready to start generating revenue for the first time since mid-March.Disney World announced last week that it would reopen Disney Springs, the massive resort's shopping, dining, and entertainment complex, in phases, starting with letting third-party retailers and restaurants crack open their registers again on May 20.Comcast waited until Tuesday afternoon of this week to make a similar announcement for Universal Orlando's CityWalk entertainment complex, but it's making sure that it grabs the first wave of theme park fans with cabin fever by opening select eateries and stores on Thursday. If this is the way that the two theme park rivals are approaching their mini-malls, one can only imagine how the race to reopen their actual theme parks will play out. END", "By Andrew Walker, CFA:I spend a lot of time looking at and thinking about the cable/telecom/media sectors, and you can’t spend any time on either of those without thinking about/looking at Comcast (CMCSA) given their ownership of Xfinity (the largest cable company in the U.S.) and NBC (one of the largest media companies in the U.S.).It’s easy to paint a bullish or bearish picture on Comcast. On the bullish side, they’re probably the best-run cable company in the world, and cable is a great business. Their NBC assets, while currently in more than a bit of flux, obviously have significant value, the stock is quite cheap, and Brian Roberts (their CEO/semi-control shareholder) has a track record of value creation. On the bearish side, the Sky acquisition is looking like a disaster (and plenty of people thought it was a disaster from the moment it started getting floated!), almost all of the NBC assets are undergoing some form of extreme secular headwind and/or Corona disruption, and there are more than a few red flags related to corporate governance that I think bulls tend to overlook.My personal opinion? Comcast is too cheap, but the levered returns from a pure-play cable company pursuing a buyback model (like Charter, my largest position) are likely to be significantly better than Comcast’s.Still, if you were asking me for the proverbial “one stock I can have my sister put her kid’s college fund in and not touch for 20 years” stock (and for some reason we couldn’t just do an index fund), that stock would undoubtedly be Comcast. And I think the stock today offers a better value than it ever has.END", "By Alexander HübnerMUNICH, May 15 (Reuters) - Germany's Bundesliga will attract legions of new armchair fans around the world this weekend when it becomes the first of Europe's major soccer leagues to resume after a two-month shutdown due to the coronavirus.In normal circumstances, the German game, dominated in recent seasons by Bayern Munich, lacks the marketing pull of England's Premier League or Spain's La Liga, which boasts the world's two biggest clubs in terms of revenue - Barcelona and Real Madrid.Yet even with a subdued atmosphere given the absence of passionate fans, with all games being played behind closed doors to prevent the spread of the coronavirus, the Bundesliga can use the spotlight to show its worth to devotees missing live action around the globe.\"With the Bundesliga as the only league to be broadcast on TV, I expect we will have an audience of a billion,\" Bayern CEO Karl-Heinz Rummenigge told SportBild magazine on Wednesday. END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the ProShares ProShares UltraPro QQQ (Symbol: TQQQ) where we have detected an approximate $379.4 million dollar outflow -- that's a 6.4% decrease week over week (from 77,350,000 to 72,400,000).  Among the largest underlying components of TQQQ, in trading today Comcast Corp (Symbol: CMCSA) is off about 1.8%, Tesla Inc (Symbol: TSLA) is up about 2.4%, and Costco Wholesale Corp (Symbol: COST) is lower by about 0.1%. For a complete list of holdings, visit the TQQQ Holdings page » \n\nThe chart below shows the one year price performance of TQQQ, versus its 200 day moving average:\n   \n\nEND"]}