{"Title": ["How to Invest in What You Know", "Is Now the Right Time to Join Costco?", "Why BJ’s Warehouse Club Stock Jumped 37% in May", "Why Discount Retailers' Stocks Are Up", "9 of the Best Food Stocks to Buy Right Now", "Why Almost No One Is Canceling Their Costco Membership", "Why Costco Could Be a Loser in the E-Commerce Boom", "Cannabis Player EnWave's Earnings Hurt by Pandemic, but Not Too Badly", "How to Invest in What You Know", "Noteworthy Friday Option Activity: ZS, COST, APY", "Stock Market News: Canopy Growth Bums Investors Out; Coronavirus Costs Sink Costco", "Costco Reports Revenue Beat Despite First Monthly Sales Drop in a Decade", "Costco To Resume Free Samples In June", "Daily Markets: Stocks Slip as Investors Brace for Trump's U.S.-China News Conference", "Consumer Sector Update for 05/29/2020: BIG, WSM, COST, XLP, XLY", "Earn Monthly Dividend Income By Investing in These 3 Stocks", "Cannabis Player EnWave's Earnings Hurt by Pandemic, but Not Too Badly", "Costco beats revenue estimates as consumer stockpile essentials", "Costco Wholesale Corporation Reports Fall In Q3 Earnings", "Costco Wholesale revenue rises 7.3% on coronavirus-induced stockpiling", "IWF, CSCO, NFLX, COST: ETF Outflow Alert", "How Retail Bankruptcies Affect Other Retailers", "Costco (COST) 3rd Quarter Earnings: What to Expect", "Costco Wholesale Q3 20 Earnings Conference Call At 5:00 PM ET", "Costco Wholesale Corp (COST) Q3 2020 Earnings Call Transcript", "Is Target Stock a Buy?", "5 Stocks to Start Investing in 2020", "9 of the Best Food Stocks to Buy Right Now", "Better Buy: Costco vs. Kimberly-Clark", "If You're Retired, Consider Buying These 3 Stocks", "What Investors Should Look For in Costco's Q3 Report This Week", "3 Things to Watch in the Stock Market This Week", "5 Top Stock Trades for Thursday: TWTR, ZM, TSCO, COST, JWN", "3 Stocks I Bought This Week, and 1 Stock I Sold", "Why Retailers Are Spending More", "3 Recession-Proof Stocks to Buy Now", "Notable Friday Option Activity: ULTA, COST, MA", "Retail Tournament: Motley Fool-Style", "Why Walmart Is Winning in the Retail Space", "The 4 Stages of Pandemic Shopping as Illustrated by Walmart's Earnings", "Weekly Preview: Stocks To Watch (BOX, COST, CRM, WDAY, ZS)", "Breakingviews - Corona Capital: Perpetual WFH, Macy’s", "Why Chapter 11 Is Not the End of Line", "What Results From BJ’s Wholesale Could Mean for Costco’s Earnings", "Breakingviews - Corona Capital: Vaccines, Italy’s patriotic bonds", "Better Buy: Costco vs. Constellation Brands", "Dollar General Stock Should Continue to Climb Higher Post-Pandemic", "Breakingviews - Corona Capital: Walmart, Insurers, Whitbread", "Teladoc Health Is the Amazon of Online Healthcare", "Walmart Stock Won’t Shine as Bright After Coronavirus Woes Fade"], "Elapsed Time": ["3 HOURS AGO", "1 DAY AGO", "1 DAY AGO", "2 DAYS AGO", "2 DAYS AGO", "2 DAYS AGO", "3 DAYS AGO", "3 DAYS AGO", "3 HOURS AGO", "5 DAYS AGO", "6 DAYS AGO", "6 DAYS AGO", "6 DAYS AGO", "6 DAYS AGO", "6 DAYS AGO", "6 DAYS AGO", "3 DAYS AGO", "6 DAYS AGO", "6 DAYS AGO", "6 DAYS AGO", "MAY 28, 2020", "MAY 28, 2020", "MAY 28, 2020", "MAY 28, 2020", "6 DAYS AGO", "MAY 27, 2020", "MAY 27, 2020", "MAY 26, 2020", "MAY 26, 2020", "MAY 24, 2020", "MAY 24, 2020", "MAY 24, 2020", "MAY 27, 2020", "MAY 23, 2020", "MAY 23, 2020", "MAY 23, 2020", "MAY 22, 2020", "MAY 22, 2020", "MAY 22, 2020", "MAY 22, 2020", "MAY 24, 2020", "MAY 21, 2020", "MAY 21, 2020", "MAY 21, 2020", "MAY 21, 2020", "MAY 21, 2020", "MAY 21, 2020", "MAY 21, 2020", "MAY 22, 2020", "MAY 20, 2020"], "Published Date": ["Jun 4, 2020 8:00AM EDT", "Jun 3, 2020 9:42AM EDT", "Jun 3, 2020 8:36AM EDT", "Jun 2, 2020 7:22AM EDT", "Jun 1, 2020 10:25PM EDT", "Jun 1, 2020 3:07PM EDT", "Jun 1, 2020 7:46AM EDT", "Jun 1, 2020 7:00AM EDT", "Jun 4, 2020 8:00AM EDT", "May 29, 2020 3:24PM EDT", "May 29, 2020 12:12PM EDT", "May 29, 2020 10:16AM EDT", "May 29, 2020 9:30AM EDT", "May 29, 2020 9:10AM EDT", "May 29, 2020 9:06AM EDT", "May 29, 2020 6:55AM EDT", "Jun 1, 2020 7:00AM EDT", "May 28, 2020 4:50PM EDT", "May 28, 2020 4:27PM EDT", "May 28, 2020 4:22PM EDT", "May 28, 2020 10:49AM EDT", "May 28, 2020 9:17AM EDT", "May 28, 2020 7:55AM EDT", "May 28, 2020 6:00AM EDT", "May 29, 2020 3:00AM EDT", "May 27, 2020 10:02AM EDT", "May 27, 2020 7:30AM EDT", "May 26, 2020 9:48AM EDT", "May 26, 2020 7:30AM EDT", "May 24, 2020 4:30PM EDT", "May 24, 2020 10:23AM EDT", "May 24, 2020 8:18AM EDT", "May 27, 2020 4:49PM EDT", "May 23, 2020 2:00PM EDT", "May 23, 2020 1:19PM EDT", "May 23, 2020 9:43AM EDT", "May 22, 2020 1:23PM EDT", "May 22, 2020 11:53AM EDT", "May 22, 2020 10:12AM EDT", "May 22, 2020 9:00AM EDT", "May 24, 2020 6:45AM EDT", "May 21, 2020 4:45PM EDT", "May 21, 2020 12:45PM EDT", "May 21, 2020 11:13AM EDT", "May 21, 2020 11:08AM EDT", "May 21, 2020 9:30AM EDT", "May 21, 2020 7:10AM EDT", "May 21, 2020 6:36AM EDT", "May 22, 2020 6:32AM EDT", "May 20, 2020 1:02PM EDT"], "Link": ["https://www.nasdaq.com/articles/how-to-invest-in-what-you-know-2020-06-04", "https://www.nasdaq.com/articles/is-now-the-right-time-to-join-costco-2020-06-03", "https://www.nasdaq.com/articles/why-bjs-warehouse-club-stock-jumped-37-in-may-2020-06-03", "https://www.nasdaq.com/articles/why-discount-retailers-stocks-are-up-2020-06-02", "https://www.nasdaq.com/articles/9-of-the-best-food-stocks-to-buy-right-now-2020-06-02", "https://www.nasdaq.com/articles/why-almost-no-one-is-canceling-their-costco-membership-2020-06-01", "https://www.nasdaq.com/articles/why-costco-could-be-a-loser-in-the-e-commerce-boom-2020-06-01", "https://www.nasdaq.com/articles/cannabis-player-enwaves-earnings-hurt-by-pandemic-but-not-too-badly-2020-06-01", "https://www.nasdaq.com/articles/how-to-invest-in-what-you-know-2020-06-04", "https://www.nasdaq.com/articles/noteworthy-friday-option-activity%3A-zs-cost-apy-2020-05-29", "https://www.nasdaq.com/articles/stock-market-news%3A-canopy-growth-bums-investors-out-coronavirus-costs-sink-costco-2020-05", "https://www.nasdaq.com/articles/costco-reports-revenue-beat-despite-first-monthly-sales-drop-in-a-decade-2020-05-29", "https://www.nasdaq.com/articles/costco-to-resume-free-samples-in-june-2020-05-29", "https://www.nasdaq.com/articles/daily-markets%3A-stocks-slip-as-investors-brace-for-trumps-u.s.-china-news-conference-2020", "https://www.nasdaq.com/articles/consumer-sector-update-for-05-29-2020%3A-big-wsm-cost-xlp-xly-2020-05-29", "https://www.nasdaq.com/articles/earn-monthly-dividend-income-by-investing-in-these-3-stocks-2020-05-29", "https://www.nasdaq.com/articles/cannabis-player-enwaves-earnings-hurt-by-pandemic-but-not-too-badly-2020-06-01", "https://www.nasdaq.com/articles/costco-beats-revenue-estimates-as-consumer-stockpile-essentials-2020-05-28", "https://www.nasdaq.com/articles/costco-wholesale-corporation-reports-fall-in-q3-earnings-2020-05-28", "https://www.nasdaq.com/articles/costco-wholesale-revenue-rises-7.3-on-coronavirus-induced-stockpiling-2020-05-28", "https://www.nasdaq.com/articles/iwf-csco-nflx-cost%3A-etf-outflow-alert-2020-05-28", "https://www.nasdaq.com/articles/how-retail-bankruptcies-affect-other-retailers-2020-05-28", "https://www.nasdaq.com/articles/costco-cost-3rd-quarter-earnings%3A-what-to-expect-2020-05-28", "https://www.nasdaq.com/articles/costco-wholesale-q3-20-earnings-conference-call-at-5%3A00-pm-et-2020-05-28", "https://www.nasdaq.com/articles/costco-wholesale-corp-cost-q3-2020-earnings-call-transcript-2020-05-29", "https://www.nasdaq.com/articles/is-target-stock-a-buy-2020-05-27", "https://www.nasdaq.com/articles/5-stocks-to-start-investing-in-2020-2020-05-27", "https://www.nasdaq.com/articles/9-of-the-best-food-stocks-to-buy-right-now-2020-05-26", "https://www.nasdaq.com/articles/better-buy%3A-costco-vs.-kimberly-clark-2020-05-26", "https://www.nasdaq.com/articles/if-youre-retired-consider-buying-these-3-stocks-2020-05-24", "https://www.nasdaq.com/articles/what-investors-should-look-for-in-costcos-q3-report-this-week-2020-05-24", "https://www.nasdaq.com/articles/3-things-to-watch-in-the-stock-market-this-week-2020-05-24", "https://www.nasdaq.com/articles/5-top-stock-trades-for-thursday%3A-twtr-zm-tsco-cost-jwn-2020-05-27", "https://www.nasdaq.com/articles/3-stocks-i-bought-this-week-and-1-stock-i-sold-2020-05-23", "https://www.nasdaq.com/articles/why-retailers-are-spending-more-2020-05-23", "https://www.nasdaq.com/articles/3-recession-proof-stocks-to-buy-now-2020-05-23", "https://www.nasdaq.com/articles/notable-friday-option-activity%3A-ulta-cost-ma-2020-05-22", "https://www.nasdaq.com/articles/retail-tournament%3A-motley-fool-style-2020-05-22", "https://www.nasdaq.com/articles/why-walmart-is-winning-in-the-retail-space-2020-05-22", "https://www.nasdaq.com/articles/the-4-stages-of-pandemic-shopping-as-illustrated-by-walmarts-earnings-2020-05-22", "https://www.nasdaq.com/articles/weekly-preview%3A-stocks-to-watch-box-cost-crm-wday-zs-2020-05-24", "https://www.nasdaq.com/articles/breakingviews-corona-capital%3A-perpetual-wfh-macys-2020-05-21", "https://www.nasdaq.com/articles/why-chapter-11-is-not-the-end-of-line-2020-05-21", "https://www.nasdaq.com/articles/what-results-from-bjs-wholesale-could-mean-for-costcos-earnings-2020-05-21", "https://www.nasdaq.com/articles/breakingviews-corona-capital%3A-vaccines-italys-patriotic-bonds-2020-05-21", "https://www.nasdaq.com/articles/better-buy%3A-costco-vs.-constellation-brands-2020-05-21", "https://www.nasdaq.com/articles/dollar-general-stock-should-continue-to-climb-higher-post-pandemic-2020-05-21", "https://www.nasdaq.com/articles/breakingviews-corona-capital%3A-walmart-insurers-whitbread-2020-05-21", "https://www.nasdaq.com/articles/teladoc-health-is-the-amazon-of-online-healthcare-2020-05-22", "https://www.nasdaq.com/articles/walmart-stock-wont-shine-as-bright-after-coronavirus-woes-fade-2020-05-20"], "Content": ["Peter Lynch is one of the most successful mutual fund managers of all time. Lynch ran Fidelity's Magellan Fund between 1977 and 1990, averaging a 29% annual return and regularly outperforming the S&P 500. You'd think he had a crystal ball hiding in his desk drawer, but his approach is anchored in a surprisingly simple concept: Invest in what you know.Investing in what you know means choosing companies with products and business models you understand. That doesn't require you to have an MBA, though. Look to Ronald Read for proof of that. Read was a janitor with no formal financial education. When he died, he was worth millions, and it was because he'd been investing for decades in blue-chip companies whose names he recognized.END", "Costco (NASDAQ: COST) has been an essential retailer during the coronavirus pandemic. The warehouse club sells bulk items and all sorts of essentials that make it easier for people to shelter in place or stay at home for long periods of time.The members-only chain has kept its warehouses open, albeit at limited capacities with customers required to wear masks and maintain social distancing. Costco has at times struggled to keep some items in stock, but it has largely done a good job making it easy for its members to get what they need.Much of the Costco experience is lost during the current crisis. The treasure hunt aspect of visiting the chain and fun asides like free samples, as well as the chain's cheap food court, were missing or greatly curtailed, but that does not make joining a bad idea.END", "END", "The stock market was underwhelmed despite strong results from major retailers. In this episode of Motley Fool Money, Chris Hill is joined by Motley Fool analysts Jason Moser and Ron Gross to go through the latest headlines from Wall Street, employment figures, the change in people's spending habits, and corporate debt. They also share results from the CRM, discount retailers, and cosmetics spaces, as well as news that an iconic brand has filed for bankruptcy. Finally, they answer listener questions and share some stocks to put on your watchlist and much more.Later in the show, Rick Munarriz and Mac Greer chat about the reopening of theme parks and the entertainment industry in general.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*END", "InvestorPlace - Stock Market News, Stock Advice & Trading Tips[Editor’s note: “9 of the Best Food Stocks to Buy Right Now” was originally published in March 2020. It is regularly updated to reflect the most relevant information.]With so much chaos in the financial markets – something that the novel coronavirus and subsequent record-breaking job losses have only exacerbated – it has been difficult to find individual names that haven’t been deeply and negatively impacted. A better approach may be to consider suddenly relevant sectors that have now been discounted. In this case, few market segments offer as much potential as food stocks to buy.Hardly a sexy place to park your money, food stocks are somewhat of an afterthought in bull markets. But this narrative changes during bearish cycles. In an email to InvestorPlace, Veljko Fotak, PhD Associate Professor Department of Finance School of Management University at Buffalo wrote the following:END", "Costco (NASDAQ: COST) recently announced fiscal second-quarter earnings results that included some minor letdowns for investors. Customer traffic posted a rare decline in the period despite surging demand in the early days of the COVID-19 pandemic containment efforts.The warehouse retailer also noted a slightly lower core gross profit margin, as it maintained low prices on in-demand products like consumer electronics. Yet Costco managed to improve on its industry-leading membership renewal rate, and that win bodes well for the chain's long-term sales and earnings trends.END", "For years, Costco (NASDAQ: COST) has traded at a premium to the rest of the retail sector.The warehouse giant has avoided many of the challenges plaguing its brick-and-mortar peers as the company's membership model provides a locked-in customer base and reliable cash flow that goes straight to the bottom line. At the same time, its reputation for bulk goods at rock-bottom prices continues to bring in customer in droves, and it consistently racks up strong same-store sales growth. No other warehouse chain has come close to the level of sales that Costco does, which has given it a competitive advantage in the subsector. However, the pandemic has brought about rapid change in the retail sector. In addition to the bifurcation between non-essential and essential retailers, and pressure in categories like apparel, e-commerce has boomed as shoppers who have been sheltering in place or are simply reluctant to visit a store are now shopping online. That's driven a spike in e-commerce with a number of online retail channels reporting Black Friday levels of traffic in April. Adobe Digital Economy Index reported domestic e-commerce sales up 49% in April from March, while online grocery saw an even bigger boom, jumping 110% from March to April. END", "EnWave (TSXV: ENW) (OTC: NWVCF) reported fiscal second-quarter 2020 results on Friday, May 29, before the market open. The cannabis player's revenue declined 15% year over year, driven by the fallout from the COVID-19 pandemic. It posted a loss per share of 0.02 Canadian, whereas it broke even in the year-ago period. The company's NutraDried segment, based in Washington state, makes all-natural dried cheese snacks. Its Canada-based EnWave segment licenses, manufactures, and installs equipment for dehydrating organic materials, including food, pharmaceuticals, and cannabis. The market reaction was slightly positive. On Friday, EnWave shares on Canada's TSX Venture Exchange (TSX) gained 2.6%, and shares traded over the counter (OTC) in the United States were up 1.3%. The S&P 500 index rose 0.5%. END", "Peter Lynch is one of the most successful mutual fund managers of all time. Lynch ran Fidelity's Magellan Fund between 1977 and 1990, averaging a 29% annual return and regularly outperforming the S&P 500. You'd think he had a crystal ball hiding in his desk drawer, but his approach is anchored in a surprisingly simple concept: Invest in what you know.Investing in what you know means choosing companies with products and business models you understand. That doesn't require you to have an MBA, though. Look to Ronald Read for proof of that. Read was a janitor with no formal financial education. When he died, he was worth millions, and it was because he'd been investing for decades in blue-chip companies whose names he recognized.END", "Looking at options trading activity among components of the Russell 3000 index, there is noteworthy activity today in Zscaler Inc (Symbol: ZS), where a total volume of 119,651 contracts has been traded thus far today, a contract volume which is representative of approximately 12.0 million underlying shares (given that every 1 contract represents 100 underlying shares).  That number works out to 519.6% of ZS's average daily trading volume over the past month, of 2.3 million shares.  Particularly high volume was seen for the $95 strike call option expiring May 29, 2020, with 17,366 contracts trading so far today, representing approximately 1.7 million underlying shares of ZS.  Below is a chart showing ZS's trailing twelve month trading history, with the $95 strike highlighted in orange:\n\nEND", "Investors were slightly concerned Friday morning about some of the geopolitical pressures that are starting to make their way into the financial market. In particular, moves from China to change its relationship with Hong Kong aren't sitting well with some U.S. government officials, and the potential for icier relations between China and the U.S. reawakened fears from last year's trade disputes. Just before 11 a.m. EDT today, the Dow Jones Industrial Average (DJINDICES: ^DJI) was down 237 points to 25,164. The S&P 500 (SNPINDEX: ^GSPC) fell 22 points to 3,007, and the Nasdaq Composite (NASDAQINDEX: ^IXIC) dropped 31 points to 9,338.On the earnings front, investors had to deal with some bad news from a couple of high-profile companies. Marijuana giant Canopy Growth (NYSE: CGC) had particularly disappointing results in its most recent quarter. Although Costco Wholesale (NASDAQ: COST) has gotten a lot of attention for empty store shelves due to runs on consumer goods by its members, even its quarterly results reflected some of the challenges that companies across the economy are facing due to the coronavirus pandemic.END", "Big box retailer Costco (NASDAQ: COST) reported earnings for the fiscal third quarter, which ended May 10, 2020, that included both tailwinds and headwinds from the ongoing COVID-19 pandemic. Net sales increased 7.3% versus last year, as early pandemic panic buying transitioned to lower sales as the outbreak spread and stay-at-home restrictions increased. Total revenue of $37.27 billion beat analyst expectations of $37.13 billion, according to CNBC. The drop in April comparable sales marked the first monthly decline since July 2009. The company was not alone, however. Government data showed that consumer spending decreased 13.6% in April. END", "(RTTNews) - Costco Wholesale Corp. will resume its free in-store samples from mid-June, but with some changes. The warehouse chain had suspended offering free samples in its wholesale clubs from early March to prevent the spread of the coronavirus. Costco's free samples of food as well as non-food items are immensely popular among customers at its warehouse clubs. Customers had taken to social media to express their disappointment when Costco stopped offering its free samples in March.During Costco's quarterly earnings call Thursday, chief financial officer Richard Galanti said that the company plans to bring back its free in-store samples in mid-June.Costco reported third-quarter net income of $838 million or $1.89 per share, down from $906 million or $2.05 per share in the year-ago period. The latest quarter's results were negatively impacted by $0.47 per share from incremental wage and sanitation costs related to COVID-19.END", "Today’s Big PictureAll week long, we’ve been watching tension between the US and China escalate. As markets look to close out the month of May today, they are bracing for President Trump’s expected press conference on the US response to China's controversial national security bill for Hong Kong. Ahead of the presser, Trump has shared the US will issue a tough response, which may include revisiting some of Hong Kong’s economic and trade privileges with the US. The pre-press conference uncertainty, and what the presser could bring is weighing on equities today. Odds are the fallout from the president’s comments mean the month of May, which started on a strong note, helping equities clawback March quarter losses, finishes the month with a whimper. On the housekeeping front, your authors will be taking a much-needed break next week, which means we will be (hopefully) tan, rested, and ready when Daily Markets returns on Monday, June 8th. Data DownloadCoronavirusAs of Friday morning, there were 5.91 million confirmed coronavirus cases worldwide, and over 362,000 lives lost to COVID-19. The United States has over 1.77 million cases, and more than 103,000 lives lost. The UK has the second-highest loss of life at just under 39,000. Brazil has the second-highest case count at nearly 440,000.Russia reported a record number of deaths from the coronavirus today.END", "Consumer firms were mixed premarket Friday, with shares of staples companies in the S&P 500 (XLP) down 0.29% and consumer discretionary firms (XLY) 0.24% higher in recent trading.Big Lots (BIG) was gaining over 13% in value as it posted Q1 adjusted earnings of $1.26 per share compared with $0.92 in the earlier year quarter. Analysts surveyed by Capital IQ were expecting adjusted EPS of $0.40.Williams-Sonoma (WSM) was up climbing past 9% even after reporting an adjusted EPS of $0.74 in Q1, down from $0.81 a year earlier, as revenue was flat at $1.24 billion over the same period. Analysts polled by Capital IQ had expected an adjusted EPS of $0.07 on revenue of $1.1 billion for the quarter.Costco Wholesale (COST) was over 1% lower after it reported fiscal Q3 earnings of $1.89 per share, down from $2.05 in the year-ago period. Analysts polled by Capital IQ had previously expected EPS of $1.89.END", "The markets have been rallying since March's crash, but that doesn't mean they're stable just yet. With a lot of uncertainty surrounding the COVID-19 pandemic, stability comes at a premium these days. And one way you can add some of it to your life is by investing in dividend stocks.While most dividend stocks pay on a quarterly basis, that doesn't mean you have to wait three months for a payment. The three stocks listed below all pay dividends in different periods, and collectively, they can generate recurring monthly income for you.END", "EnWave (TSXV: ENW) (OTC: NWVCF) reported fiscal second-quarter 2020 results on Friday, May 29, before the market open. The cannabis player's revenue declined 15% year over year, driven by the fallout from the COVID-19 pandemic. It posted a loss per share of 0.02 Canadian, whereas it broke even in the year-ago period. The company's NutraDried segment, based in Washington state, makes all-natural dried cheese snacks. Its Canada-based EnWave segment licenses, manufactures, and installs equipment for dehydrating organic materials, including food, pharmaceuticals, and cannabis. The market reaction was slightly positive. On Friday, EnWave shares on Canada's TSX Venture Exchange (TSX) gained 2.6%, and shares traded over the counter (OTC) in the United States were up 1.3%. The S&P 500 index rose 0.5%. END", "Adds background, details on revenue and profit, share moveMay 28 (Reuters) - Warehouse club operator Costco Wholesale Corp COST.O beat quarterly revenue estimates on Thursday, as people stocked up on essentials before hunkering down in their homes to contain the spread of the coronavirus.Costco, like many businesses deemed essential during the coronavirus-led lockdowns, benefited from an unprecedented spike in demand late during March and early April for basic products such as meat and paper towels.E-commerce sales surged 66.1% on an adjusted basis, as consumers avoided in-person shopping and opted instead to use the option of same-day grocery delivery and facility to pick up online orders at local Costco stores.END", "(RTTNews) - Costco Wholesale Corporation (COST) reported earnings for third quarter that dropped from last year.The company's bottom line came in at $838 million, or $1.89 per share.  This compares with $906 million, or $2.05 per share, in last year's third quarter.The company's revenue for the quarter rose 7.3% to $37.27 billion from $34.74 billion last year.Costco Wholesale Corporation earnings at a glance:-Earnings (Q3): $838 Mln. vs. $906 Mln. last year.\n-EPS (Q3): $1.89 vs. $2.05 last year.\n-Revenue (Q3): $37.27 Bln vs. $34.74 Bln last year.\n END", "May 28 (Reuters) - Warehouse club operator Costco Wholesale Corp COST.O reported a 7.3% increase in quarterly revenue on Thursday, as people stocked up on essentials before hunkering down in their homes to contain the spread of the coronavirus.Total revenue rose to $37.27 billion from $34.74 billion last year, driven by a jump in online sales.Net income attributable to Costco fell to $838 million, or $1.89 per share, in the third quarter ended May 10, from $906 million, or $2.05 per share, a year earlier. (Reporting by Praveen Paramasivam in Bengaluru; Editing by Amy Caren Daniel)END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares Russell 1000 Growth ETF (Symbol: IWF) where we have detected an approximate $319.4 million dollar outflow -- that's a 0.6% decrease week over week (from 287,650,000 to 285,900,000).  Among the largest underlying components of IWF, in trading today Cisco Systems Inc (Symbol: CSCO) is off about 0.7%, Netflix Inc (Symbol: NFLX) is off about 0.8%, and Costco Wholesale Corp (Symbol: COST) is higher by about 0.7%. For a complete list of holdings, visit the IWF Holdings page » \n\nThe chart below shows the one year price performance of IWF, versus its 200 day moving average:\n   \n\nEND", "In this episode of Motley Fool Money, Chris Hill chats with Motley Fool analysts Emily Flippen and Ron Gross about the latest news from Wall Street. They talk about the work-from-home culture and the changes it brings. They go through the earning reports of some major retailers and a gaming company, and also discuss the potential delisting of Chinese companies. They share some stocks to keep on your watch list and much more. And TiVo (NASDAQ: TIVO) CEO Dave Shull talks about the future of television.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Walmart wasn't one of them! That's right -- they think these 10 stocks are even better buys.END", "How strong is the consumer? While the peak of COVID-19 fear has subsided, that doesn’t mean there will be an immediate recovery among consumers, which has been the driving force of the U.S. economy. This question, among others, will be answered by Costco (COST) from the company’s outlook for the second half of the year. The nation’s largest warehouse retailer will report third-quarter fiscal 2020 earnings results after the closing bell Thursday. April retail sales plunged more than 16% on a month-to-month comparison and year-over-year, after backing out the auto and gas categories. Despite the weak consumer data, expectations are high for Costco.At a time when analysts are forecasting that both demand and supply-chain issues could hit the U.S. retail sector, customers are rushing to Costco to stock up on supplies. Costco’s “buy in bulk” business profile has made it a standout during the pandemic for stockpiling on household products such as Lysol and toilet paper. The company is more than just a coronavirus play, however. Before the outbreak, Costco was one of the better performers in the retail sector.The company’s membership business model, which generates a sizable portion of annual profits, continues to receive praise. Not only is Costco still finding ways not to grow its membership total, but the company is also getting its club members to spend more. On Thursday, the market will see whether (or how much) this translates to increased sales.END", "(RTTNews) - Costco Wholesale Corporation (COST) will host a conference call at 5:00 PM ET on May 28, 2020, to discuss Q3 20 earnings results.To access the live webcast, log on to https://investor.costco.com/events The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.END", "END", "When it comes to the discussion of major retailers, Target (NYSE: TGT) sometimes becomes an afterthought. Particularly with regard to the COVID-19 pandemic, retail analysts have tended to focus on Target's principal competitors, Walmart, Costco, and Amazon.However, like its peers, local governments deemed Target essential, and it has maintained operations while several of its competitors remained shuttered. This probably helped Target stock over the past few months as a run on consumer staples helped to drive revenue increases. Now, with the stock bouncing back from its March lows, the question for investors is whether Target stock remains a buy?END", "Congratulations on beginning your journey as an investor!You can earn a fortune in the stock market, and one of the best ways to do so is to invest your money in high-quality businesses. Moreover, owning and studying great businesses can help you learn important investing lessons, which, in turn, can help you make even more money in the future.Here are five excellent companies that can form the foundation of your stock portfolio.END", "InvestorPlace - Stock Market News, Stock Advice & Trading Tips[Editor’s note: “9 of the Best Food Stocks to Buy Right Now” was originally published in March 2020. It is regularly updated to reflect the most relevant information.]With so much chaos in the financial markets – something that the novel coronavirus and subsequent record-breaking job losses have only exacerbated – it has been difficult to find individual names that haven’t been deeply and negatively impacted. A better approach may be to consider suddenly relevant sectors that have now been discounted. In this case, few market segments offer as much potential as food stocks to buy.Hardly a sexy place to park your money, food stocks are somewhat of an afterthought in bull markets. But this narrative changes during bearish cycles. In an email to InvestorPlace, Veljko Fotak, PhD Associate Professor Department of Finance School of Management University at Buffalo wrote the following:END", "Costco (NASDAQ: COST) and Kimberly-Clark (NYSE: KMB) are both considered COVID-resistant stocks. Costco, which rallied more than 22% over the past 12 months, was buoyed by panic buying throughout the pandemic. Kimberly-Clark saw demand for its paper-based products -- including tissues, toilet paper, paper towels, and diapers -- surge throughout the crisis. As a result, its stock advanced about 8.6% in the past year against the S&P 500's 5.5% gain.Costco has clearly been the stronger investment, but will it continue to outpace Kimberly-Clark and the broader market? Let's dig deeper to decide.END", "Although you may be retired, chances are that you will still have a long term future ahead of you. That means you'll want to keep part of your money in stocks in order to benefit from their long-term growth potential. Their opportunity to grow is a key tool that you can use to give yourself a fighting chance against inflation over time.Still, not every stock is a decent fit for a retiree's portfolio. With no work-related income and a need to draw from your portfolio to cover your costs, you're particularly at risk if a company runs into trouble. That's especially true in the coronavirus era where many companies have seen their revenues and incomes decline sharply because of state-mandated lockdowns and other social distancing requirements.As a retiree, you need to focus on companies that have clear staying power, even during unprecedented times like these. As a result, if you're retired, consider buying these three stocks as part of the stock allocation in your portfolio.END", "Warehouse shopping giant Costco (NASDAQ: COST) is gearing up for a third-quarter earnings report on the evening of Thursday, May 28. Here's what investors should expect from this business update, which covers a period starting on Feb. 17 -- at the very beginning of the COVID-19 health crisis.END", "Stocks jumped last week as investors gained more optimism that the economy will kick into higher gear as the COVID-19 threat fades. Both the Dow Jones Industrial Average (DJINDICES: ^DJI) and the S&P 500 (SNPINDEX: ^GSPC) rose over 3%. That boost left the S&P 500 down by less than 9% so far this year while the Dow is lower by 14%.Several big-name stocks will announce earnings results over the next few trading days, as the broad market further gauges the likelihood and breadth of a potential economic rebound. Those companies include Costco (NASDAQ: COST), Autodesk (NASDAQ: ADSK), and Ulta Beauty (NASDAQ: ULTA), and below we'll take a look at the key trends investors should be watching this week.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsAfter big gap-up, stocks flushed lower in Wednesday’s session. However, the S&P 500 recovered those losses and climbed to new session highs. With that in mind, let’s look at a few top stock trades amid that action.END", "I was feeling peckish this week so I did a little buying on Wednesday. I also took advantage of Luckin Coffee (NASDAQ: LK) finally trading again after being halted six weeks ago. I sold my entire position in the once promising Chinese coffee chain -- at a beefy loss, as you can probably imagine.I expressed my frustration with Luckin Coffee a couple of weeks into the trading halt. The exchange nixed trading on the shares after management revealed that it was inflating sales by a shockingly high margin. I don't always bail on a stock when the going gets rough, but this just isn't going to end well. It's not like the stock will ever return to its earlier highs, because the fundamentals of Luckin Coffee were purely fictional. Luckin Coffee has an intriguing model, but it's only an average business at best. The brand is now tarnished, and that's something that isn't easy to bounce back from -- even if we now know that the bar wasn't as high as Luckin Coffee tricked us into believing. I more than offset the Luckin Coffee by initiating a position in Costco Wholesale (NASDAQ: COST) and adding to my positions in Pinterest (NYSE: PINS) and Sonos (NASDAQ: SONO). Let's go over these purchases. END", "In this episode of MarketFoolery, Chris Hill and Motley Fool analyst Ron Gross discuss all things retail. They talk about a home improvement company, a consumer apparel company, and a supermarket chain. They talk about balance sheets, COVID-related costs, and much more.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Walmart wasn't one of them! That's right -- they think these 10 stocks are even better buys.END", "If you want to find recession-proof stocks, look no further than the companies doing well amid the coronavirus pandemic. If a company can weather the global economic shutdown and uncertainty caused by the pandemic, it can survive a recession.Here are three companies proving resilient in the midst of the pandemic. All are capable of doing the same in a recession.END", "Among the underlying components of the S&P 500 index, we saw noteworthy options trading volume today in Ulta Beauty Inc (Symbol: ULTA), where a total of 7,213 contracts have traded so far, representing approximately 721,300 underlying shares.  That amounts to about 67.2% of ULTA's average daily trading volume over the past month of 1.1 million shares.  Especially high volume was seen for the $227.50 strike call option expiring May 22, 2020, with 1,179 contracts trading so far today, representing approximately 117,900 underlying shares of ULTA.  Below is a chart showing ULTA's trailing twelve month trading history, with the $227.50 strike highlighted in orange:\n\nEND", "In this episode of Industry Focus: Consumer Goods, Emily Flippen and Fool.com contributor Dan Kline play a fun game that looks at how some retailers are doing. Get to know eight great retail companies, their strengths and much more.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Walmart wasn't one of them! That's right -- they think these 10 stocks are even better buys.END", "In this episode of MarketFoolery, Chris Hill and Motley Fool analyst Jason Moser talk about the latest headlines from Wall Street. Discover how Walmart (NYSE: WMT) is winning in the retail space and some other retail news. A popular social media platform gets a new CEO. And there is also entertainment news and much more.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than Walmart Inc.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Walmart Inc. wasn't one of them! That's right -- they think these 10 stocks are even better buys.END", "Walmart (NYSE: WMT) is the world's biggest retailer, so it had a unique perspective into how shopping patterns changed as COVID-19 containment measures spread across the country. The overall sales impact was positive for the business, even though expenses surged in categories like labor, cleaning and sanitation, and digital fulfillment.In a conference call with Wall Street analysts, Walmart detailed the huge spending shifts that executives noticed this quarter, which often varied dramatically by week. They broke down into a few clear stages of pandemic-driven demand.Let's take a closer look.END", "Financial markets in the U.S., including the Nasdaq and the New York Stock Exchange, will be closed on Monday, May 25, in observance of Memorial Day — a time to honor members of our armed forces who gave their lives in the service of our country. To those brave men and women, thank you for your service.Unofficially the beginning of summer, in this three-day weekend investors should also thank the Fed and the U.S. Treasury. While we’re not yet completely out of the woods regarding the pandemic, the fact that the stock market has rebounded some 35% from the March lows is an incredible accomplishment. All told, stocks are holding up well amid all of the uncertainty. But as a market participant, a capitalist and proponent of growth, “holding up well” or hoping for “less bad results” is a mindset I don’t want to get used to. This was nonetheless the case on Friday.Stocks held up pretty well, shrugging off not only increased tensions between the U.S. and China, but also amid the ongoing uncertainty about the pace of economic recovery from the coronavirus. Investors are still trying to decide what headlines are more important.\"The biggest thing out there today is the Hong Kong/China saber rattling,\" said Eric Freedman, chief investment officer at U.S. Bank Wealth Management. \"We still think COVID-19 concerns are in the driver's seat, but we could see U.S.-China relations move back into the front seat.”END", "END", "In this episode of Motley Fool Answers, Alison Southwick chats with Motley Fool personal finance expert Robert Brokamp and Fool.com contributor Dan Kline about the latest headlines from Wall Street. They talk about some labor statistics and some companies that seem least likely to survive the financial fallout from the coronavirus and much more.Also, watch out for their weekly recommendations to take your mind off all the craziness.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*END", "The earnings reports this week by retailers that stayed open through the COVID-19 pandemic have surpassed many investors' high expectations. Walmart (NYSE: WMT), Target, and Lowe's all announced record sales growth despite more-limited operating hours. The companies took the opportunity to further establish their multichannel selling platforms and cement their positions as essential shopping outlets.BJ's Wholesale (NYSE: BJ) was no exception to those positive trends, reporting on Thursday that e-commerce sales jumped over 300% to push comparable-store sales far higher in the first quarter of 2020.Let's look at those metrics with an eye toward what they might mean for the upcoming earnings report from Costco (NASDAQ: COST), due out on Thursday, May 28.END", "END", "The coronavirus pandemic has thrown many companies into unknown territory. But businesses can adapt, and Costco (NASDAQ: COST) and Constellation Brands (NYSE: STZ) are good examples.Both companies beat most recent estimated earnings and reported sales increases. But one makes a better investment opportunity than the other. Let's examine the companies to find out which one.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsWhat’s next for Dollar General (NYSE:DG)? The novel coronavirus helped, not hurt, the discount store giant. But, the price of Dollar General stock largely reflects this.END", "END", "Proclaiming Teladoc Health (NYSE: TDOC) the Amazon of online health might seem strange at first. After all, Amazon launched Amazon Care in 2019 to offer health services for employees. The company has also purchased an online pharmacy. Given those moves, one might assume that Amazon itself will become the Amazon of online health.However, Teladoc entered this industry years ahead of Amazon. While a large, well-resourced tech giant could become a competitive threat, Teladoc's focus on healthcare and its market position could still make it the predominant ecosystem in the healthcare realm. END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsWhen does a huge, slow-growing retailer become a hot stock? In the middle of a pandemic. Walmart (NYSE:WMT) stock is up 5% in 2020, while the average stock in the S&P 500 is down almost 10%, because it delivers earnings through the novel coronavirus lockdown.END"]}