{"Title": ["Copart, Inc. (CPRT) Q3 2020 Earnings Call Transcript", "First Week of CPRT July 17th Options Trading", "Why Shares of Carvana, AutoNation, and Copart Surged in April", "Why Shares of Carvana, AutoNation, and Copart Surged in April", "Copart Reaches Analyst Target Price", "Stock Alert: Copart Rises 7%", "Look Under The Hood: QLD Has 16% Upside", "Interesting CPRT Put And Call Options For November 20th", "Copart, Inc. (CPRT) Q3 2020 Earnings Call Transcript", "Copart Becomes Oversold (CPRT)", "Surprising Analyst 12-Month Target For QQXT", "3 Monster Growth Stocks That Can Climb Higher as Market Plunges", "CPRT Crosses Below Key Moving Average Level", "Notable Friday Option Activity: MMM, MCK, CPRT", "Validea Peter Lynch Strategy Daily Upgrade Report - 2/21/2020", "Copart, Inc. (CPRT) Q2 2020 Earnings Call Transcript", "Why CarMax, Copart, and Carvana Stocks Are Soaring Tuesday", "Consumer Sector Update for 02/20/2020: STMP,DPZ,CPRT", "Nasdaq 100 Movers: CPRT, LBTYA", "Copart Q2 20 Earnings Conference Call At 11:00 AM ET", "Stock Alert: Copart Drops 9%", "Noteworthy Friday Option Activity: LOW, XOM, CPRT", "Why Copart Stock Zoomed 90.3% Higher in 2019", "FTC, BURL, CPRT, CDW: Large Outflows Detected at ETF", "Consumer Sector Update for 02/20/2020: LB,STMP,DPZ,CPRT", "Consumer Sector Update for 02/20/2020: STMP,DPZ,CPRT", "Nasdaq 100 Movers: CPRT, LBTYA", "Copart Reaches Analyst Target Price", "Copart, Inc. (CPRT) Q1 2020 Earnings Call Transcript", "Copart Q1 Profit Rises", "Monday Sector Leaders: Services, Industrial", "CPRT Crosses Above Average Analyst Target", "Copart Reaches Analyst Target Price", "Copart Proves Salvaging Vehicles Is Big Business", "Copart's Management Addresses a Future Risk", "First Week of CPRT May 2020 Options Trading", "Copart Ends the Year With Record-Breaking Sales in the Fourth Quarter", "10 Excellent Stocks to Watch for 2020 and Beyond", "The 7 Best S&P 500 Stocks of 2019 So Far", "3 Surprising Stocks Hitting New Highs Last Week", "Invesco FTSE RAFI US 1500 Small-Mid ETF Experiences Big Outflow", "Copart, Inc. (CPRT) Q4 2019 Earnings Call Transcript", "Thursday Sector Leaders: Industrial, Technology & Communications", "S&P 500 Movers: CHD, IPGP", "7 Top Texas Stocks to Buy Now", "Invesco S&P 500 Equal Weight Industrials ETF Experiences Big Outflow", "3 Surprising Stocks Hitting New Highs Last Week", "Copart, Inc. (CPRT) Q3 2019 Earnings Call Transcript", "Validea Warren Buffett Strategy Daily Upgrade Report - 9/6/2019", "Consumer Sector Update for 05/23/2019: CPRT,LB,VFC"], "Elapsed Time": ["MAY 21, 2020", "MAY 18, 2020", "MAY 4, 2020", "MAY 4, 2020", "APR 30, 2020", "APR 7, 2020", "APR 7, 2020", "MAR 27, 2020", "MAY 21, 2020", "MAR 18, 2020", "MAR 6, 2020", "MAR 1, 2020", "FEB 28, 2020", "FEB 28, 2020", "FEB 21, 2020", "FEB 20, 2020", "MAR 24, 2020", "FEB 20, 2020", "FEB 20, 2020", "FEB 20, 2020", "FEB 20, 2020", "JAN 17, 2020", "JAN 14, 2020", "JAN 9, 2020", "FEB 20, 2020", "FEB 20, 2020", "FEB 20, 2020", "NOV 27, 2019", "NOV 21, 2019", "NOV 20, 2019", "NOV 11, 2019", "OCT 25, 2019", "JAN 3, 2020", "OCT 14, 2019", "OCT 3, 2019", "OCT 2, 2019", "SEP 24, 2019", "SEP 19, 2019", "SEP 18, 2019", "SEP 8, 2019", "OCT 22, 2019", "SEP 5, 2019", "SEP 5, 2019", "SEP 5, 2019", "JUL 11, 2019", "JUN 24, 2019", "JUN 16, 2019", "MAY 23, 2019", "SEP 6, 2019", "MAY 23, 2019"], "Published Date": ["May 21, 2020 4:00PM EDT", "May 18, 2020 10:39AM EDT", "May 4, 2020 11:43AM EDT", "May 4, 2020 11:43AM EDT", "Apr 30, 2020 9:14AM EDT", "Apr 7, 2020 10:38AM EDT", "Apr 7, 2020 9:10AM EDT", "Mar 27, 2020 11:00AM EDT", "May 21, 2020 4:00PM EDT", "Mar 18, 2020 12:36PM EDT", "Mar 6, 2020 8:39AM EST", "Mar 1, 2020 7:22AM EST", "Feb 28, 2020 4:10PM EST", "Feb 28, 2020 2:31PM EST", "Feb 21, 2020 10:00AM EST", "Feb 20, 2020 10:31PM EST", "Mar 24, 2020 12:47PM EDT", "Feb 20, 2020 1:43PM EST", "Feb 20, 2020 10:23AM EST", "Feb 20, 2020 10:00AM EST", "Feb 20, 2020 9:56AM EST", "Jan 17, 2020 1:46PM EST", "Jan 14, 2020 10:00AM EST", "Jan 9, 2020 10:54AM EST", "Feb 20, 2020 3:59PM EST", "Feb 20, 2020 1:43PM EST", "Feb 20, 2020 10:23AM EST", "Nov 27, 2019 8:07AM EST", "Nov 21, 2019 3:00PM EST", "Nov 20, 2019 8:20PM EST", "Nov 11, 2019 2:38PM EST", "Oct 25, 2019 8:15AM EDT", "Jan 3, 2020 9:26AM EST", "Oct 14, 2019 11:57PM EDT", "Oct 3, 2019 11:57AM EDT", "Oct 2, 2019 10:45AM EDT", "Sep 24, 2019 7:38AM EDT", "Sep 19, 2019 2:30PM EDT", "Sep 18, 2019 4:17PM EDT", "Sep 8, 2019 11:00AM EDT", "Oct 22, 2019 10:55AM EDT", "Sep 5, 2019 3:23PM EDT", "Sep 5, 2019 2:52PM EDT", "Sep 5, 2019 10:33AM EDT", "Jul 11, 2019 10:43AM EDT", "Jun 24, 2019 11:05AM EDT", "Jun 16, 2019 9:15AM EDT", "May 23, 2019 5:23PM EDT", "Sep 6, 2019 11:00AM EDT", "May 23, 2019 2:04PM EDT"], "Link": ["https://www.nasdaq.com/articles/copart-inc.-cprt-q3-2020-earnings-call-transcript-2020-05-21", "https://www.nasdaq.com/articles/first-week-of-cprt-july-17th-options-trading-2020-05-18", "https://www.nasdaq.com/articles/why-shares-of-carvana-autonation-and-copart-surged-in-april-2020-05-04-0", "https://www.nasdaq.com/articles/why-shares-of-carvana-autonation-and-copart-surged-in-april-2020-05-04", "https://www.nasdaq.com/articles/copart-reaches-analyst-target-price-2020-04-30", "https://www.nasdaq.com/articles/stock-alert%3A-copart-rises-7-2020-04-07", "https://www.nasdaq.com/articles/look-under-the-hood%3A-qld-has-16-upside-2020-04-07", "https://www.nasdaq.com/articles/interesting-cprt-put-and-call-options-for-november-20th-2020-03-27", "https://www.nasdaq.com/articles/copart-inc.-cprt-q3-2020-earnings-call-transcript-2020-05-21", "https://www.nasdaq.com/articles/copart-becomes-oversold-cprt-2020-03-18", "https://www.nasdaq.com/articles/surprising-analyst-12-month-target-for-qqxt-2020-03-06", "https://www.nasdaq.com/articles/3-monster-growth-stocks-that-can-climb-higher-as-market-plunges-2020-03-01", "https://www.nasdaq.com/articles/cprt-crosses-below-key-moving-average-level-2020-02-28", "https://www.nasdaq.com/articles/notable-friday-option-activity%3A-mmm-mck-cprt-2020-02-28", "https://www.nasdaq.com/articles/validea-peter-lynch-strategy-daily-upgrade-report-2-21-2020-2020-02-21", "https://www.nasdaq.com/articles/copart-inc.-cprt-q2-2020-earnings-call-transcript-2020-02-21", "https://www.nasdaq.com/articles/why-carmax-copart-and-carvana-stocks-are-soaring-tuesday-2020-03-24", "https://www.nasdaq.com/articles/consumer-sector-update-for-02-20-2020%3A-stmpdpzcprt-2020-02-20", "https://www.nasdaq.com/articles/nasdaq-100-movers%3A-cprt-lbtya-2020-02-20", "https://www.nasdaq.com/articles/copart-q2-20-earnings-conference-call-at-11%3A00-am-et-2020-02-20", "https://www.nasdaq.com/articles/stock-alert%3A-copart-drops-9-2020-02-20", "https://www.nasdaq.com/articles/noteworthy-friday-option-activity%3A-low-xom-cprt-2020-01-17", "https://www.nasdaq.com/articles/why-copart-stock-zoomed-90.3-higher-in-2019-2020-01-14", "https://www.nasdaq.com/articles/ftc-burl-cprt-cdw%3A-large-outflows-detected-at-etf-2020-01-09", "https://www.nasdaq.com/articles/consumer-sector-update-for-02-20-2020%3A-lbstmpdpzcprt-2020-02-20", "https://www.nasdaq.com/articles/consumer-sector-update-for-02-20-2020%3A-stmpdpzcprt-2020-02-20", "https://www.nasdaq.com/articles/nasdaq-100-movers%3A-cprt-lbtya-2020-02-20", "https://www.nasdaq.com/articles/copart-reaches-analyst-target-price-2019-11-27", "https://www.nasdaq.com/articles/copart-inc.-cprt-q1-2020-earnings-call-transcript-2019-11-21", "https://www.nasdaq.com/articles/copart-q1-profit-rises-2019-11-20", "https://www.nasdaq.com/articles/monday-sector-leaders%3A-services-industrial-2019-11-11", "https://www.nasdaq.com/articles/cprt-crosses-above-average-analyst-target-2019-10-25", "https://www.nasdaq.com/articles/copart-reaches-analyst-target-price-2020-01-03", "https://www.nasdaq.com/articles/copart-proves-salvaging-vehicles-is-big-business-2019-10-15", "https://www.nasdaq.com/articles/coparts-management-addresses-a-future-risk-2019-10-03", "https://www.nasdaq.com/articles/first-week-of-cprt-may-2020-options-trading-2019-10-02", "https://www.nasdaq.com/articles/copart-ends-the-year-with-record-breaking-sales-in-the-fourth-quarter-2019-09-24", "https://www.nasdaq.com/articles/10-excellent-stocks-to-watch-for-2020-and-beyond-2019-09-19", "https://www.nasdaq.com/articles/the-7-best-sp-500-stocks-of-2019-so-far-2019-09-18", "https://www.nasdaq.com/articles/3-surprising-stocks-hitting-new-highs-last-week-2019-09-08", "https://www.nasdaq.com/articles/invesco-ftse-rafi-us-1500-small-mid-etf-experiences-big-outflow-2019-10-22", "https://www.nasdaq.com/articles/copart-inc.-cprt-q4-2019-earnings-call-transcript-2019-09-05", "https://www.nasdaq.com/articles/thursday-sector-leaders%3A-industrial-technology-communications-2019-09-05", "https://www.nasdaq.com/articles/sp-500-movers%3A-chd-ipgp-2019-09-05", "https://www.nasdaq.com/articles/7-top-texas-stocks-to-buy-now-2019-07-11", "https://www.nasdaq.com/articles/invesco-sp-500-equal-weight-industrials-etf-experiences-big-outflow-2019-06-24", "https://www.nasdaq.com/articles/3-surprising-stocks-hitting-new-highs-last-week-2019-06-16", "https://www.nasdaq.com/articles/copart-inc.-cprt-q3-2019-earnings-call-transcript-2019-05-23", "https://www.nasdaq.com/articles/validea-warren-buffett-strategy-daily-upgrade-report-9-6-2019-2019-09-06", "https://www.nasdaq.com/articles/consumer-sector-update-for-05-23-2019%3A-cprtlbvfc-2019-05-23"], "Content": ["END", "Investors in Copart Inc (Symbol: CPRT) saw new options become available this week, for the July 17th expiration.   At Stock Options Channel, our YieldBoost formula has looked up and down the CPRT options chain for the new July 17th contracts and identified one put and one call contract of particular interest.The put contract at the $80.00 strike price has a current bid of $4.40.  If an investor was to sell-to-open that put contract, they are committing to purchase the stock at $80.00, but will also collect the premium, putting the cost basis of the shares at $75.60 (before broker commissions).  To an investor already interested in purchasing shares of CPRT, that could represent an attractive alternative to paying $82.02/share today.\n\nBecause the $80.00 strike represents an approximate 2% discount to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the put contract would expire worthless.  The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 59%.  Stock Options Channel will track those odds over time to see how they change, publishing a chart of those numbers on our website under the contract detail page for this contract.  Should the contract expire worthless, the premium would represent a 5.50% return on the cash commitment, or 33.46% annualized — at Stock Options Channel we call this the YieldBoost.\n\n\nBelow is a chart showing the trailing twelve month trading history for Copart Inc, and highlighting in green where the $80.00 strike is located relative to that history:\n\nEND", "END", "END", "\nThere are 7 different analyst targets contributing to that average for Copart Inc, but the average is just that — a mathematical average.  There are analysts with lower targets than the average, including one looking for a price of $65.00.  And then on the other side of the spectrum one analyst has a target as high as $110.00.  The standard deviation is $14.787.\n\n\nBut the whole reason to look at the average CPRT price target in the first place is to tap into a \"wisdom of crowds\" effort, putting together the contributions of all the individual minds who contributed to the ultimate number, as opposed to what just one particular expert believes.  And so with CPRT crossing above that average target price of $83.00/share, investors in CPRT have been given a good signal to spend fresh time assessing the company and deciding for themselves: is $83.00 just one stop on the way to an even higher target, or has the valuation gotten stretched to the point where it is time to think about taking some chips off the table?  Below is a table showing the current thinking of the analysts that cover Copart Inc:\n\n\nEND", "(RTTNews) - Shares of online vehicle auction and re marketing services provider Copart, Inc. (CPRT) are climbing more than 7% Tuesday morning at $70.22. There are no company-specific news to drive the stock up.Before the coronavirus pandemic hitting the market, Copart shares had touched an all time high of $104.88 in February. It has recorded a 52-week low of $55.69 in March.U.S. stocks are rising on Tuesday following news the spread of the coronavirus is slowing in hot spots like New York. The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.END", "Looking at the underlying holdings of the ETFs in our coverage universe at ETF Channel, we have compared the trading price of each holding against the average analyst 12-month forward target price, and computed the weighted average implied analyst target price for the ETF itself. \tFor the ProShares ProShares Ultra QQQ ETF (Symbol: QLD), we found that the implied analyst target price for the ETF based upon its underlying holdings is $110.40 per unit.\n\n\nWith QLD trading at a recent price near $94.85 per unit, that means that analysts see 16.39% upside for this ETF looking through to the average analyst targets of the underlying holdings.   Three of QLD's underlying holdings with notable upside to their analyst target prices are Copart Inc (Symbol: CPRT), MercadoLibre Inc (Symbol: MELI), and Cisco Systems Inc (Symbol: CSCO). Although CPRT has traded at a recent price of $65.39/share, the average analyst target is 38.51% higher at $90.57/share. Similarly, MELI has 33.80% upside from the recent share price of $506.16 if the average analyst target price of $677.22/share is reached, and analysts on average are expecting CSCO to reach a target price of $50.00/share, which is 20.69% above the recent price of $41.43. Below is a twelve month price history chart comparing the stock performance of CPRT, MELI, and CSCO:  \n\n END", "Investors in Copart Inc (Symbol: CPRT) saw new options begin trading this week, for the November 20th expiration.  One of the key inputs that goes into the price an option buyer is willing to pay, is the time value, so with 238 days until expiration the newly trading contracts represent a potential opportunity for sellers of puts or calls to achieve a higher premium than would be available for the contracts with a closer expiration.   At Stock Options Channel, our YieldBoost formula has looked up and down the CPRT options chain for the new November 20th contracts and identified one put and one call contract of particular interest.The put contract at the $60.00 strike price has a current bid of $7.20.  If an investor was to sell-to-open that put contract, they are committing to purchase the stock at $60.00, but will also collect the premium, putting the cost basis of the shares at $52.80 (before broker commissions).  To an investor already interested in purchasing shares of CPRT, that could represent an attractive alternative to paying $70.86/share today.\n\nBecause the $60.00 strike represents an approximate 15% discount to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the put contract would expire worthless.  The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 76%.  Stock Options Channel will track those odds over time to see how they change, publishing a chart of those numbers on our website under the contract detail page for this contract.  Should the contract expire worthless, the premium would represent a 12.00% return on the cash commitment, or 18.40% annualized — at Stock Options Channel we call this the YieldBoost.\n\n\nBelow is a chart showing the trailing twelve month trading history for Copart Inc, and highlighting in green where the $60.00 strike is located relative to that history:\n\nEND", "END", "Legendary investor Warren Buffett advises to be fearful when others are greedy, and be greedy when others are fearful.  One way we can try to measure the level of fear in a given stock is through a technical analysis indicator called the Relative Strength Index, or RSI, which measures momentum on a scale of zero to 100.  A stock is considered to be oversold if the RSI reading falls below 30.\n\nIn trading on Wednesday, shares of Copart Inc (Symbol: CPRT) entered into oversold territory, hitting an RSI reading of 26.9, after changing hands as low as $61.71 per share.  By comparison, the current RSI reading of the S&P 500 ETF (SPY) is 33.4.  A bullish investor could look at CPRT's 26.9 RSI reading today as a sign that the recent heavy selling is in the process of exhausting itself, and begin to look for entry point opportunities on the buy side.    The chart below shows the one year performance of CPRT shares:\n   \n   END", "Looking at the underlying holdings of the ETFs in our coverage universe at ETF Channel, we have compared the trading price of each holding against the average analyst 12-month forward target price, and computed the weighted average implied analyst target price for the ETF itself. \tFor the First Trust NASDAQ-100 Ex-Technology Sector Index Fund ETF (Symbol: QQXT), we found that the implied analyst target price for the ETF based upon its underlying holdings is $64.69 per unit.\n\n\nWith QQXT trading at a recent price near $56.90 per unit, that means that analysts see 13.70% upside for this ETF looking through to the average analyst targets of the underlying holdings.   Three of QQXT's underlying holdings with notable upside to their analyst target prices are lululemon athletica inc (Symbol: LULU), Copart Inc (Symbol: CPRT), and MercadoLibre Inc (Symbol: MELI). Although LULU has traded at a recent price of $221.19/share, the average analyst target is 14.25% higher at $252.71/share. Similarly, CPRT has 14.16% upside from the recent share price of $83.51 if the average analyst target price of $95.33/share is reached, and analysts on average are expecting MELI to reach a target price of $716.50/share, which is 14.11% above the recent price of $627.88. Below is a twelve month price history chart comparing the stock performance of LULU, CPRT, and MELI:  \n\n END", "Markets are plunging, taking a serious hit as the coronavirus spreads rapidly throughout the world. So far, the worst of the outbreak is in China, but large-scale viral cases are on the rise in Italy, Iran, and South Korea. Medical restrictions and quarantines are disrupting global trade and travel patterns, with shutdowns in Chinese factories impacting global supply chains in everything from electronics to the containerized shipping industry. The S&P 500 is down 12.8% from its peak on February 19, completely erasing earlier gains and putting the index at an 8.6% loss for the year to date.But as per usual in the stock markets, risky times also present opportunity for daring investors – and while the market as an aggregate is falling, any one stock’s individual performance may be very different. In short, a savvy investor can find stocks with serious growth potential, even in today’s market conditions.We’ve used TipRanks’ Stock Screener tool to pull up some stocks with serious growth prospects. Setting the filters to show us only mid- to large-cap stocks, with upwards of 20% upside potential, 6,100 stocks were reduced to a far more manageable 293. Let’s dive in and examine three of them in detail.Copart, Inc. (CPRT)We’ll start with Copart, the online automotive auction site. The Texas-based company boasts a global reach, with services in the US and Canada, UK and Ireland, Germany, Spain, and the UAE. The company offers services to sellers looking to unload used and salvaged vehicles, primarily in the dismantling, parts, and export markets. A limited number of vehicles are sold as used cars for the general public, but most of Copart’s customers are insurance companies.END", "In trading on Friday, shares of Copart Inc (Symbol: CPRT) crossed below their 200 day moving average of $83.09, changing hands as low as $79.92 per share.  Copart Inc shares are currently trading down about 2.5% on the day.  The chart below shows the one year performance of CPRT shares, versus its 200 day moving average:\n\n   END", "Among the underlying components of the S&P 500 index, we saw noteworthy options trading volume today in 3M Co (Symbol: MMM), where a total of 53,027 contracts have traded so far, representing approximately 5.3 million underlying shares.  That amounts to about 141.5% of MMM's average daily trading volume over the past month of 3.7 million shares.  Especially high volume was seen for the $165 strike call option expiring April 17, 2020, with 3,403 contracts trading so far today, representing approximately 340,300 underlying shares of MMM.  Below is a chart showing MMM's trailing twelve month trading history, with the $165 strike highlighted in orange:\n\nEND", "The following are today's upgrades for Validea's P/E/Growth Investor model based on the published strategy of Peter Lynch. This strategy looks for stocks trading at a reasonable price relative to earnings growth that also possess strong balance sheets.SCIPLAY CORP (SCPL) is a small-cap growth stock in the Software & Programming industry. The rating according to our strategy based on Peter Lynch changed from 67% to 74% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.Company Description: SciPlay Corporation developer and publisher of digital games on mobile and Web platforms. The Company has one operating segment with one business activity, developing and monetizing social games. The Company offers seven games, including social casino games Jackpot Party Casino, Gold Fish Casino, Hot Shot Casino and Quick Hit Slots, and casual games MONOPOLY Slots, Bingo Showdown and 88 Fortunes Slots. Its social casino games typically include slots-style play and occasionally include table games-style game play, while its casual games blend slots-style or bingo game play with adventure game features. Its games are offered and played across multiple platforms, including Apple, Google, Facebook and Amazon.The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.END", "END", "END", "Top Consumer StocksWMT\t-0.17%MCD\t-1.03%DIS\t-1.44%CVS\t-0.72%KO\t-0.71%Consumer stocks were moderately lower on Thursday, with shares of consumer staples companies in the S&P 500 slipping 0.5% this afternoon while shares of consumer discretionary firms in the S&P 500 were dropping 0.4%.Among consumer stocks moving on news:(+) Stamps.com (STMP) surged 61% on Thursday after Q4 results topped Wall Street expectations. FY20 revenue also is een exceeding analyst estimates. Excluding one-time items, it earned $2.12 per share on $160.9 million in revenue during the three months ended Dec. 31, breezing past the Capital IQ consensus looking for a $0.98 per share adjusted profit on $142.3 million in revenue.In other sector news:(+) Domino's Pizza (DPZ) climbed nearly 29% to a record high of $381.86 after the restaurant chain reported better-than-expected Q4 financial results and increased its quarterly dividend by 20% compared with its most recent distribution to $0.78 per share. Excluding one-time items, it earned $3.13 per share, up from $2.62 during the same quarter last year, while net sales grew 6.5% to $1.15 billion. Analysts, on average, had been modeling for non-GAAP net income of $2.97 per share on $1.13 billion in sales.(-) Copart (CPRT) slid 7.3% after online vehicle auction company said it earned $0.65 per share during its fiscal Q2 ended Jan. 31, up from $0.52 a year earlier but missing the Capital IQ consensus calll by $0.01 per share. Revenue rose to $575.1 million from $484.9 million last year but lagged the $576.1 million Street view.END", "\nIn early trading on Thursday, shares of Liberty Global topped the list of the day's best performing components of the Nasdaq 100 index, trading up 2.0%.  Year to date, Liberty Global has lost about 6.8% of its value.\n\nAnd the worst performing Nasdaq 100 component thus far on the day is Copart, trading down 8.0%.  Copart is showing a gain of 5.7% looking at the year to date performance.\n\nOne other component making moves today is Synopsys, trading down 3.3%.\n\n \n\n\n\n\n\n\n\nVIDEO: Nasdaq 100 Movers: CPRT, LBTYA\nEND", "(RTTNews) - Copart Inc (CPRT) will host a conference call at 11:00 AM ET on Feb. 20, 2020, to discuss its Q2 20 earnings results.To access the live webcast, log on at http://stream.conferenceamerica.com/copart022020 The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.END", "(RTTNews) - Shares of online vehicle auctions company Copart, Inc. (CPRT) are falling more than 9% on Thursday morning after second-quarter earnings missed estimates.The stock gapped down more than 7% today morning and is currently trading at $91.30. CPRT has traded in the range of $51.99-$104.88 in the past one year.EPS in the third quarter was $0.71 compared with $0.55 in the same quarter a year ago. Excluding items, adjusted EPS of $0.65 missed average estimates of analysts polled by Thomson Reuters by $0.01.Revenue,  increased 18.6% year-over-year to $575.1 million but missed estimates of $576.04 million. END", "Among the underlying components of the S&P 500 index, we saw noteworthy options trading volume today in Lowe's Companies Inc (Symbol: LOW), where a total of 17,514 contracts have traded so far, representing approximately 1.8 million underlying shares.  That amounts to about 53.8% of LOW's average daily trading volume over the past month of 3.3 million shares.  Particularly high volume was seen for the $125 strike call option expiring February 21, 2020, with 1,465 contracts trading so far today, representing approximately 146,500 underlying shares of LOW.  Below is a chart showing LOW's trailing twelve month trading history, with the $125 strike highlighted in orange:\n\nEND", "END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the First Trust Large Cap Growth AlphaDEX Fund (Symbol: FTC) where we have detected an approximate $70.2 million dollar outflow -- that's a 6.4% decrease week over week (from 14,800,002 to 13,850,002).  Among the largest underlying components of FTC, in trading today Burlington Stores Inc (Symbol: BURL) is up about 0.6%, Copart Inc (Symbol: CPRT) is up about 1.4%, and CDW Corp (Symbol: CDW) is higher by about 1.3%. For a complete list of holdings, visit the FTC Holdings page » \n\nThe chart below shows the one year price performance of FTC, versus its 200 day moving average:\n   \n\nEND", "Top Consumer StocksWMT\t-0.06%MCD\t-0.37%DIS\t-0.75%CVS\t+0.51%KO\t-0.31%Consumer stocks still were narrowly lower heading into Thursday's close, with the shares of consumer staples companies in the S&P 500 slipping 0.1% this afternoon while the shares of consumer discretionary firms in the S&P 500 also were dropping 0.1%.Among consumer stocks moving on news:(-) L Brands (LB) dropped 4% after the retailer Thursday said it will sell a 55% equity stake in its Victoria's Secret store chain to private-equity investors Sycamore Partners for about $525 million. L Brands CEO and board chairman Leslie Wexner also will step down once the transaction closes and will be succeeded by Andrew Meslow, now the chief operating officer at the company's Bath & Body Works segment.In other sector news:(+) Stamps.com (STMP) surged 65% on Thursday after Q4 results topped Wall Street expectations. FY20 revenue also is een exceeding analyst estimates. Excluding one-time items, it earned $2.12 per share on $160.9 million in revenue during the three months ended Dec. 31, breezing past the Capital IQ consensus looking for a $0.98 per share adjusted profit on $142.3 million in revenue.(+) Domino's Pizza (DPZ) climbed nearly 29% to a record high of $381.86 after the restaurant chain reported better-than-expected Q4 financial results and increased its quarterly dividend by 20% compared with its most recent distribution to $0.78 per share. Excluding one-time items, it earned $3.13 per share, up from $2.62 during the same quarter last year, while net sales grew 6.5% to $1.15 billion. Analysts, on average, had been modeling for non-GAAP net income of $2.97 per share on $1.13 billion in sales.END", "Top Consumer StocksWMT\t-0.17%MCD\t-1.03%DIS\t-1.44%CVS\t-0.72%KO\t-0.71%Consumer stocks were moderately lower on Thursday, with shares of consumer staples companies in the S&P 500 slipping 0.5% this afternoon while shares of consumer discretionary firms in the S&P 500 were dropping 0.4%.Among consumer stocks moving on news:(+) Stamps.com (STMP) surged 61% on Thursday after Q4 results topped Wall Street expectations. FY20 revenue also is een exceeding analyst estimates. Excluding one-time items, it earned $2.12 per share on $160.9 million in revenue during the three months ended Dec. 31, breezing past the Capital IQ consensus looking for a $0.98 per share adjusted profit on $142.3 million in revenue.In other sector news:(+) Domino's Pizza (DPZ) climbed nearly 29% to a record high of $381.86 after the restaurant chain reported better-than-expected Q4 financial results and increased its quarterly dividend by 20% compared with its most recent distribution to $0.78 per share. Excluding one-time items, it earned $3.13 per share, up from $2.62 during the same quarter last year, while net sales grew 6.5% to $1.15 billion. Analysts, on average, had been modeling for non-GAAP net income of $2.97 per share on $1.13 billion in sales.(-) Copart (CPRT) slid 7.3% after online vehicle auction company said it earned $0.65 per share during its fiscal Q2 ended Jan. 31, up from $0.52 a year earlier but missing the Capital IQ consensus calll by $0.01 per share. Revenue rose to $575.1 million from $484.9 million last year but lagged the $576.1 million Street view.END", "\nIn early trading on Thursday, shares of Liberty Global topped the list of the day's best performing components of the Nasdaq 100 index, trading up 2.0%.  Year to date, Liberty Global has lost about 6.8% of its value.\n\nAnd the worst performing Nasdaq 100 component thus far on the day is Copart, trading down 8.0%.  Copart is showing a gain of 5.7% looking at the year to date performance.\n\nOne other component making moves today is Synopsys, trading down 3.3%.\n\n \n\n\n\n\n\n\n\nVIDEO: Nasdaq 100 Movers: CPRT, LBTYA\nEND", "\nThere are 6 different analyst targets contributing to that average for Copart Inc, but the average is just that — a mathematical average.  There are analysts with lower targets than the average, including one looking for a price of $79.00.  And then on the other side of the spectrum one analyst has a target as high as $100.00.  The standard deviation is $8.342.\n\n\nBut the whole reason to look at the average CPRT price target in the first place is to tap into a \"wisdom of crowds\" effort, putting together the contributions of all the individual minds who contributed to the ultimate number, as opposed to what just one particular expert believes.  And so with CPRT crossing above that average target price of $90.00/share, investors in CPRT have been given a good signal to spend fresh time assessing the company and deciding for themselves: is $90.00 just one stop on the way to an even higher target, or has the valuation gotten stretched to the point where it is time to think about taking some chips off the table?  Below is a table showing the current thinking of the analysts that cover Copart Inc:\n\n\nEND", "END", "(RTTNews) - Copart Inc. (CPRT) reported that its net income for the first-quarter rose to $218.18 million or $0.91 per share from $114.08 million or $0.47 per share in the prior year.Non-GAAP earnings per share for the quarter were $0.65 compared to $0.47 in the previous year.Total service revenues and vehicle sales for the quarter grew to $554.42 million from $461.37 million in the prior year.Analysts polled by Thomson Reuters expected the company to report earnings of $0.59 per share and revenues of $544.63 million for the quarter. Analysts' estimates typically exclude special items. END", "Looking at the sectors faring best as of midday Monday, shares of Services companies are outperforming other sectors, higher by 0.2%.  Within that group, Walgreens Boots Alliance Inc (Symbol: WBA) and NVR Inc. (Symbol: NVR) are two large stocks leading the way, showing a gain of 5.7% and 4.1%, respectively.  Among the largest ETFs, one ETF closely following services stocks is the iShares U.S. Consumer Services ETF (Symbol: IYC), which is flat on the day on the day, and up 23.33% year-to-date.  Walgreens Boots Alliance Inc, meanwhile, is down 6.37% year-to-date, and NVR Inc. is up 46.22% year-to-date.  WBA makes up approximately 1.5% of the underlying holdings of IYC.\n\nThe next best performing sector is the Industrial sector, not showing much of a loss.  Among large Industrial stocks, Boeing Co.  (Symbol: BA) and Copart Inc (Symbol: CPRT) are the most notable, showing a gain of 4.9% and 1.6%, respectively.  One ETF closely tracking Industrial stocks is the Industrial Select Sector SPDR ETF (XLI), which is up 0.1% in midday trading, and up 28.96% on a year-to-date basis.  Boeing Co. , meanwhile, is up 16.76% year-to-date, and Copart Inc is up 73.29% year-to-date.  Combined, BA and CPRT make up approximately 9.3% of the underlying holdings of XLI.\n\nComparing these stocks and ETFs on a trailing twelve month basis, below is a relative stock price performance chart, with each of the symbols shown in a different color as labeled in the legend at the bottom:\n\n\n \n\n\n\n\nEND", "\nThere are 6 different analyst targets contributing to that average for Copart Inc, but the average is just that — a mathematical average.  There are analysts with lower targets than the average, including one looking for a price of $71.00.  And then on the other side of the spectrum one analyst has a target as high as $93.00.  The standard deviation is $8.238.\n\n\nBut the whole reason to look at the average CPRT price target in the first place is to tap into a \"wisdom of crowds\" effort, putting together the contributions of all the individual minds who contributed to the ultimate number, as opposed to what just one particular expert believes.  And so with CPRT crossing above that average target price of $83.67/share, investors in CPRT have been given a good signal to spend fresh time assessing the company and deciding for themselves: is $83.67 just one stop on the way to an even higher target, or has the valuation gotten stretched to the point where it is time to think about taking some chips off the table?  Below is a table showing the current thinking of the analysts that cover Copart Inc:\n\n\nEND", "\nThere are 6 different analyst targets contributing to that average for Copart Inc, but the average is just that — a mathematical average.  There are analysts with lower targets than the average, including one looking for a price of $79.00.  And then on the other side of the spectrum one analyst has a target as high as $100.00.  The standard deviation is $7.174.\n\n\nBut the whole reason to look at the average CPRT price target in the first place is to tap into a \"wisdom of crowds\" effort, putting together the contributions of all the individual minds who contributed to the ultimate number, as opposed to what just one particular expert believes.  And so with CPRT crossing above that average target price of $91.33/share, investors in CPRT have been given a good signal to spend fresh time assessing the company and deciding for themselves: is $91.33 just one stop on the way to an even higher target, or has the valuation gotten stretched to the point where it is time to think about taking some chips off the table?  Below is a table showing the current thinking of the analysts that cover Copart Inc:\n\n\nEND", "In 2017, Hurricane Harvey dumped as much as 60 inches of rain in Southeast Texas, flooding homes, schools, businesses, and autos. The Insurance Council of Texas estimated at least $4.75 billion was paid out to insured owners who collectively lost more than 250,000 private passenger and commercial vehicles in the flooding. And this is just one event. In 2005, Hurricane Katrina and two other storms damaged some 571,000 vehicles along the Gulf Coast and in Florida. Flooding is the biggest cause of vehicle damage reported to insurers after storms like these, according to Roger Morris, spokesman for the National Insurance Crime Bureau. Add to this the number of wrecked and totaled vehicles that insurers declare as a total loss each year, and the numbers become overwhelming.END", "Among automobile industry investments, shares of online vehicle auction behemoth Copart (NASDAQ: CPRT) are notable for having soared nearly 400% over the last five years as the company has expanded globally and improved its auction platform to attract a wider range of sellers and bidders for salvage and used vehicles. In this midst of this success, now seems an opportune time to assess new risks that might impair the company's business model over the next several years.During Copart's fiscal fourth-quarter earnings conference call last month, an analyst asked for management's perspective on the rise of car-sharing, and the potential for a reduction in individual vehicle ownership as car fleets tied to ride-hailing businesses grow more prevalent. The question addressed the risk that declining car ownership could translate to fewer vehicles available for auction.CEO Jay Adair offered the insight that automobile ownership doesn't rest on practical considerations alone. Adair pointed out that at least in America, car owners choose vehicles for reasons extending past utility. We buy cars even where mass transportation is readily available. Many purchasers opt for new vehicles replete with the latest technology when a used, utilitarian car might do. Adair also cited brand attachment as a purchase factor: \"[T]here is nothing practical about buying a Mercedes-Benz or a BMW or any luxury car. It's a personal choice.\"Adair's point is that the appearance of ride-hailing services may increase, rather than decrease, the number of vehicles on the road. I find this reasoning persuasive. Classical economic theory assumes that consumers nearly always make rational choices that benefit their finances over the long term. Yet as Adair argues, consumption is often personal, and non-exclusive. You can be an avid user of Uber and still overspend on a luxury vehicle. Those who predict that we'll ditch personal car ownership once car-sharing options are ubiquitous may be overrelying on textbook interpretations of supply and demand.END", "Investors in Copart Inc (Symbol: CPRT) saw new options begin trading this week, for the May 2020 expiration.  One of the key inputs that goes into the price an option buyer is willing to pay, is the time value, so with 226 days until expiration the newly trading contracts represent a possible opportunity for sellers of puts or calls to achieve a higher premium than would be available for the contracts with a closer expiration.   At Stock Options Channel, our YieldBoost formula has looked up and down the CPRT options chain for the new May 2020 contracts and identified one put and one call contract of particular interest.The put contract at the $75.00 strike price has a current bid of $4.60.  If an investor was to sell-to-open that put contract, they are committing to purchase the stock at $75.00, but will also collect the premium, putting the cost basis of the shares at $70.40 (before broker commissions).  To an investor already interested in purchasing shares of CPRT, that could represent an attractive alternative to paying $78.09/share today.\n\nBecause the $75.00 strike represents an approximate 4% discount to the current trading price of the stock (in other words it is out-of-the-money by that percentage), there is also the possibility that the put contract would expire worthless.  The current analytical data (including greeks and implied greeks) suggest the current odds of that happening are 63%.  Stock Options Channel will track those odds over time to see how they change, publishing a chart of those numbers on our website under the contract detail page for this contract.  Should the contract expire worthless, the premium would represent a 6.13% return on the cash commitment, or 9.91% annualized — at Stock Options Channel we call this the YieldBoost.\n\n\nBelow is a chart showing the trailing twelve month trading history for Copart Inc, and highlighting in green where the $75.00 strike is located relative to that history:\n\nEND", "Copart (NASDAQ: CPRT), an online automotive auction company, reported its fourth-quarter results on Sept. 4, with sales spiking 20.8% to $542.6 million. The strong revenue growth in the quarter comes on top of the its increasing revenue growth in the previous three quarters of this year, and set a record for the company's fourth-quarter sales.END", "It sounds and seems impossible, but we’re within sight of the end of 2019, and the beginning of 2020. The new year is only fifteen weeks away, which isn’t too soon to start thinking about restructuring stock portfolios.The economy is still in reasonably good shape, which bodes well for stocks. It would be naive to believe the coming year, however, is going to look like a year that’s about to wind down. As market conditions change and the economic growth cycle matures, different areas thrive, while others struggle.Geography can matter too.With that as the backdrop, here’s a rundown of ten stocks to watch as 2019 comes to a close and 2020 gears up. Now may not be the ideal time to step into them, but now’s when they should be added to watchlists for due diligence purposes. Notice that not all of them are high-profile names, but they’re each positioned nicely for growth … more so than most of their peers.END", "Stocks have had a good 2019. Through the first half of the year, the S&P 500 was on track for its best year in over two decades. To be sure, gains have been muted in the third quarter despite major indices flirting with all-time highs. But with the S&P 500 up 20% year-to-date, stocks are still having one of their best years this century.One bullish sign about this rally is that the leadership in the S&P 500 in 2019 is very diverse. That is, the individual stocks which are leading the market higher are not concentrated in one industry — rather, they are a from a broad array on sectors. That’s bullish because it shows that the market rally this year has breadth. You don’t just have one boat or one group of boats rushing ahead of the rest. Instead, the whole sea is rising here, and when the whole sea is rising, that is often a dynamic that is tough to stop.Underneath this sea of stocks are undercurrents of megatrends making their way to the surface. Investors who get in now — before the crowd has been convinced of the potential long-term worth of these companies — will .With that in mind, let’s take a look at the best stocks of 2019 so far, and see where these stocks could go next.END", "The market had a good week, so it's not a surprise to see many of the recent market darlings keep moving higher. More than 625 stocks on the major U.S. exchanges hit new 52-week highs last week. A lot of the winners are familiar and obvious, but some of the names may surprise you.Twitter (NYSE: TWTR), Choice Hotels (NYSE: CHH), and Copart (NASDAQ: CPRT) are some of the more surprising names among the hundreds of stocks hitting all-time highs. Let's see what's driving these three stocks higher.END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the Invesco FTSE RAFI US 1500 Small-Mid ETF (Symbol: PRFZ) where we have detected an approximate $90.3 million dollar outflow -- that's a 4.6% decrease week over week (from 15,350,000 to 14,650,000).  Among the largest underlying components of PRFZ, in trading today Generac Holdings Inc (Symbol: GNRC) is off about 0.1%, Copart Inc (Symbol: CPRT) is up about 0.9%, and Universal Forest Products Inc. (Symbol: UFPI) is higher by about 0.6%. For a complete list of holdings, visit the PRFZ Holdings page » \n\nThe chart below shows the one year price performance of PRFZ, versus its 200 day moving average:\n   \n\nEND", "END", "The best performing sector as of midday Thursday is the Industrial sector, higher by 2.3%.  Within the sector, Copart Inc (Symbol: CPRT) and Rockwell Automation, Inc. (Symbol: ROK) are two of the day's stand-outs, showing a gain of 6.0% and 5.7%, respectively.  Among industrial ETFs, one ETF following the sector is the Industrial Select Sector SPDR ETF (Symbol: XLI), which is up 1.9% on the day, and up 20.94% year-to-date.  Copart Inc, meanwhile, is up 67.92% year-to-date, and Rockwell Automation, Inc. is up 7.15% year-to-date.  Combined, CPRT and ROK make up approximately 1.5% of the underlying holdings of XLI.\n\nThe next best performing sector is the Technology & Communications sector, higher by 2.2%.  Among large Technology & Communications stocks, IPG Photonics Corp (Symbol: IPGP) and NVIDIA Corp (Symbol: NVDA) are the most notable, showing a gain of 6.4% and 5.9%, respectively.  One ETF closely tracking Technology & Communications stocks is the Technology Select Sector SPDR ETF (XLK), which is up 1.9% in midday trading, and up 32.25% on a year-to-date basis.  IPG Photonics Corp, meanwhile, is up 17.09% year-to-date, and NVIDIA Corp is up 34.25% year-to-date.  Combined, IPGP and NVDA make up approximately 2.1% of the underlying holdings of XLK.\n\nComparing these stocks and ETFs on a trailing twelve month basis, below is a relative stock price performance chart, with each of the symbols shown in a different color as labeled in the legend at the bottom:\n\n\n \n\n\n\n\nEND", "In early trading on Thursday, shares of IPG Photonics topped the list of the day's best performing components of the S&P 500 index, trading up 7.9%. Year to date, IPG Photonics registers a 18.8% gain.\n\nAnd the worst performing S&P 500 component thus far on the day is Church & Dwight, trading down 3.0%. Church & Dwight is showing a gain of 18.3% looking at the year to date performance.\n\nTwo other components making moves today are Newmont Goldcorp, trading down 2.9%, and Copart, trading up 5.3% on the day.\n\n \n\n\n\n\n\n\n\nVIDEO: S&P 500 Movers: CHD, IPGP END", "Everything's bigger in Texas. That doesn't just include the oil wells, the Longhorn cattle, and the plates of barbecue you'll find across the state. You can find Texas-sized investment opportunities, too -- and in more industries than you might expect.Stock market investors don't typically focus on where their companies are headquartered, because in most cases, top stocks do business well beyond their backyard. Yet when you start looking closely at Texas, you'll find a wealth of prosperous companies that either already are or have the potential to become the biggest players in their industry niches.END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the Invesco S&P 500— Equal Weight Industrials ETF (Symbol: RGI) where we have detected an approximate $43.9 million dollar outflow -- that's a 17.5% decrease week over week (from 2,000,000 to 1,650,000).  Among the largest underlying components of RGI, in trading today Arconic Inc (Symbol: ARNC) is up about 0.7%, Copart Inc (Symbol: CPRT) is up about 0.3%, and Equifax Inc (Symbol: EFX) is lower by about 0.5%. For a complete list of holdings, visit the RGI Holdings page » \n\nThe chart below shows the one year price performance of RGI, versus its 200 day moving average:\n   \n\nEND", "Wall Street's rallying again, so it's not a shock to see nearly 700 stocks on the major U.S. exchanges hitting new 52-week highs. Investors are winning these days, and that means many likely and unlikely stocks notching fresh high-water marks.Beyond Meat (NASDAQ: BYND), Disney (NYSE: DIS), and Copart (NASDAQ: CPRT) are some of the more surprising names among the hundreds of stocks hitting all-time highs. Let's see what's driving these three stocks higher.END", "END", "The following are today's upgrades for Validea's Patient Investor model based on the published strategy of Warren Buffett. This strategy seeks out firms with long-term, predictable profitability and low debt that trade at reasonable valuations.COPART, INC. (CPRT) is a large-cap growth stock in the Computer Services industry. The rating according to our strategy based on Warren Buffett changed from 86% to 93% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates strong interest.Company Description: Copart, Inc. (Copart) is a provider of online auctions and vehicle remarketing services in the United States, Canada, the United Kingdom, the United Arab Emirates, Oman, Bahrain, Brazil, Ireland, Spain and India. The Company also provides vehicle remarketing services in Germany. The Company operates through two segments: United States and International. The Company provides vehicle sellers with a range of services to process and sell vehicles primarily over the Internet through its virtual bidding third generation Internet auction-style sales technology (VB3). The Company's service offerings include Online Seller Access, Salvage Estimation Services, Estimating Services, End-Of-Life Vehicle Processing, Virtual Insured Exchange (VIX), Transportation Services, Vehicle Inspection Stations, On-Demand Reporting, Department of Motor Vehicle (DMV) Processing, Flexible Vehicle Processing Programs, Buy It Now, Member Network, Sales Process, Copart Dealer Services, CashForCars.com and U-Pull-It.The following table summarizes whether the stock meets each of this strategy's tests. Not all criteria in the below table receive equal weighting or are independent, but the table provides a brief overview of the strong and weak points of the security in the context of the strategy's criteria.END", "Top Consumer StocksWMT\t-0.93%\tMCD\t-0.87%\tDIS  \t-1.29%\tCVS \t-1.41%\tKO   \t+0.08%\tConsumer stocks were broadly lower, with shares of consumer staples companies in the S&P 500 sinking nearly 0.5% this afternoon while shares of consumer discretionary firms in the S&P 500 were falling over 1.6%. Among consumer stocks moving on news: (+) Copart (CPRT) rose over 6% on Thursday after the car and truck dealer earned $0.66 per share, excluding one-time items, rising from $0.52 per share during the same quarter last year, while net sales grew 15.7% year over year to $553.1 million. Analysts, on average, had been looking for a $0.62 per share Q3 profit on $537.11 million in sales.In other sector news:(+) L Brands (LB) climbed 13% after the apparel retailer reported above-consensus Q1 financial results. It earned $0.14 per share on $2.63 billion in net sales during the three months ended May 5 compared with Wall Street expectations looking for a $0.00 per share on $2.56 billion in revenue. (-) VF Corp. (VFC) was down almost 1%, reversing an earlier gain. Country music fans were threatening to boycott the company's Wrangler jeans division over its collaboration with rapper Lil Nas X, according to media reports.END"]}