{"Title": ["4 Ways Alphabet Is Expanding Its Television Offerings", "Why SiriusXM's Bond Offering Is Troubling", "Survey: Netflix Sees Record High Penetration", "Surprising Jobs Numbers and an Interview With Shopify CEO Tobi Lutke", "Why It’s No Surprise That Alphabet Stock Has Gained Ground in 2020", "How Biotech Companies Are Valued", "Virgin Galactic Stock Won’t Benefit Now From SpaceX’s Success", "3 Reasons to Buy Alibaba Stock on the Dip", "4 Ways Alphabet Is Expanding Its Television Offerings"], "Elapsed Time": ["7 HOURS AGO", "23 HOURS AGO", "23 HOURS AGO", "1 DAY AGO", "1 DAY AGO", "2 DAYS AGO", "2 DAYS AGO", "2 DAYS AGO", "7 HOURS AGO"], "Published Date": ["Jun 10, 2020 7:02AM EDT", "Jun 9, 2020 2:54PM EDT", "Jun 9, 2020 2:46PM EDT", "Jun 9, 2020 8:52AM EDT", "Jun 8, 2020 4:13PM EDT", "Jun 8, 2020 12:24PM EDT", "Jun 8, 2020 10:02AM EDT", "Jun 8, 2020 9:47AM EDT", "Jun 10, 2020 7:02AM EDT"], "Link": ["https://www.nasdaq.com/articles/4-ways-alphabet-is-expanding-its-television-offerings-2020-06-10", "https://www.nasdaq.com/articles/why-siriusxms-bond-offering-is-troubling-2020-06-09", "https://www.nasdaq.com/articles/survey%3A-netflix-sees-record-high-penetration-2020-06-09", "https://www.nasdaq.com/articles/surprising-jobs-numbers-and-an-interview-with-shopify-ceo-tobi-lutke-2020-06-09", "https://www.nasdaq.com/articles/why-its-no-surprise-that-alphabet-stock-has-gained-ground-in-2020-2020-06-08", "https://www.nasdaq.com/articles/how-biotech-companies-are-valued-2020-06-08", "https://www.nasdaq.com/articles/virgin-galactic-stock-wont-benefit-now-from-spacexs-success-2020-06-08", "https://www.nasdaq.com/articles/3-reasons-to-buy-alibaba-stock-on-the-dip-2020-06-08", "https://www.nasdaq.com/articles/4-ways-alphabet-is-expanding-its-television-offerings-2020-06-10"], "Content": ["Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) may be the king of search engines, but its presence in the television market has been nearly nonexistent. Sure, its YouTube is the go-to platform for sharing and watching crowd-contributed digital video, and YouTube TV adds actual studio-made programming to the mix. YouTube TV presently hosts a modest 2 million paying subscribers, which translates into a modest $3 billion in annual revenue. That's hardly a show stopper.Don't be surprised if Alphabet's digital television footprint expands much more rapidly over the course of the next five years than it has during the past five, however. The company has made four important moves on the TV front just within the past month that could finally, collectively, turn it into a television powerhouse.END", "In this episode of MarketFoolery, Chris Hill chats with Motley Fool contributor Dan Kline about the latest news from Wall Street. There is encouraging news from the RV industry. They put some perspective on a recent announcement by a major restaurant chain. They talk about some entertainment news and much more.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Walmart wasn't one of them! That's right -- they think these 10 stocks are even better buys.END", "Netflix (NASDAQ: NFLX) is \"clearly a COVID structural winner\" according to Mark Mahaney of RBC Capital Markets, who reaffirmed his outperform (buy) rating and $500 price target on the stock.The analyst reported the results of a recent survey of more than 1,500 U.S. residents, which found the streaming giant had achieved a record-high penetration, with 68% of respondents watching Netflix, up from 65% in each of the previous four quarters. The company widened its lead against Amazon.com's (NASDAQ: AMZN) Prime Video at 60%, Disney's (NYSE: DIS) Hulu at 50%, and Disney+ at 42%.The survey found that customer satisfaction has returned to levels not seen since Netflix raised prices early last year. 68% of respondents reported being \"extremely satisfied\" or \"very satisfied\", up 4% compared to last quarter.END", "In this podcast, we've got a look at news about jobs and companies including Zoom Video (NASDAQ: ZM), Slack (NYSE: WORK), DocuSign (NASDAQ: DOCU), Dick's Sporting Goods (NYSE: DKS), eBay (NASDAQ: EBAY), and Levi Strauss (NYSE: LEVI). Ron Gross and Jason Moser talk about two stocks on their radar: Target (NYSE: TGT) and FLIR Systems (NASDAQ: FLIR). And Motley Fool CEO Tom Gardner talks with Shopify (NYSE: SHOP) CEO Tobi Lutke about the business of Shopify, the value of diversity, and the future of work.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*David and Tom just revealed what they believe are the ten best stocks for investors to buy right now… and Walmart wasn't one of them! That's right -- they think these 10 stocks are even better buys.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsThere is no shortage of stocks that have left investors under water in 2020. Some have clawed their way back from the worst of the damage done during the March market selloff. However, very few have bounced back to the point that they’re in positive growth territory for 2020. Despite legitimate concerns about the weakness of ad revenue during the novel coronavirus pandemic, though, Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL) has performed well. And GOOG stock is one of those rare picks that is in positive territory for 2020.END", "In this episode of Industry Focus: Wildcard, Dylan Lewis chats with Motley Fool contributor Brian Feroldi about valuable lessons from a company working on a COVID-19 vaccine, the various clinical trial phases a drug has to undergo, how biotech companies generate revenues, how they are valued, and much more.To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. To get started investing, check out our quick-start guide to investing in stocks. A full transcript follows the video.10 stocks we like better than WalmartWhen investing geniuses David and Tom Gardner have an investing tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*David and Tom just revealed what they believe are the ten best stocks for investors to buy right now... and Walmart wasn't one of them! That's right -- they think these 10 stocks are even better buys.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsVirgin Galactic (NYSE:SPCE) stock has been one of the hottest trading names of 2020. The company, which went public via a special purpose acquisition company at $10 per share, blasted off to a high of $42 in February. Shares sunk back to $10 at the depths of the March crash, but have recovered to $17. And they could soar again soon. The market is in a speculative frenzy right now. On top of that, space travel is making major headlines.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsAfter a post-earnings pullback, shares of Alibaba (NYSE:BABA) are heating up again. Can Alibaba stock make a run for its prior highs? END", "Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) may be the king of search engines, but its presence in the television market has been nearly nonexistent. Sure, its YouTube is the go-to platform for sharing and watching crowd-contributed digital video, and YouTube TV adds actual studio-made programming to the mix. YouTube TV presently hosts a modest 2 million paying subscribers, which translates into a modest $3 billion in annual revenue. That's hardly a show stopper.Don't be surprised if Alphabet's digital television footprint expands much more rapidly over the course of the next five years than it has during the past five, however. The company has made four important moves on the TV front just within the past month that could finally, collectively, turn it into a television powerhouse.END"]}