{"Title": ["Notable Wednesday Option Activity: AMZN, AAPL, GOOGL", "ANALYSIS-A casino or stock market? Retail buying frenzy goes wild", "Czech coalition agrees 5% digital tax aimed at global internet giants -CTK", "4 Ways Alphabet Is Expanding Its Television Offerings", "INSIGHT-U.S. companies vow to fight racism but face critics on diversity", "U.S. student's app offers roadmap to Singapore contact tracing tech", "Facebook, Twitter, Google to report monthly on fake news fight, EU says", "U.S. student's app offers roadmap to Singapore contact tracing tech", "Notable Wednesday Option Activity: AMZN, AAPL, GOOGL"], "Elapsed Time": ["53 MINUTES AGO", "1 HOUR AGO", "4 HOURS AGO", "7 HOURS AGO", "7 HOURS AGO", "7 HOURS AGO", "8 HOURS AGO", "14 HOURS AGO", "53 MINUTES AGO"], "Published Date": ["Jun 10, 2020 1:28PM EDT", "Jun 10, 2020 12:29PM EDT", "Jun 10, 2020 10:05AM EDT", "Jun 10, 2020 7:02AM EDT", "Jun 10, 2020 7:00AM EDT", "Jun 10, 2020 7:00AM EDT", "Jun 10, 2020 6:02AM EDT", "Jun 10, 2020 12:00AM EDT", "Jun 10, 2020 1:28PM EDT"], "Link": ["https://www.nasdaq.com/articles/notable-wednesday-option-activity%3A-amzn-aapl-googl-2020-06-10", "https://www.nasdaq.com/articles/analysis-a-casino-or-stock-market-retail-buying-frenzy-goes-wild-2020-06-10", "https://www.nasdaq.com/articles/czech-coalition-agrees-5-digital-tax-aimed-at-global-internet-giants-ctk-2020-06-10", "https://www.nasdaq.com/articles/4-ways-alphabet-is-expanding-its-television-offerings-2020-06-10", "https://www.nasdaq.com/articles/insight-u.s.-companies-vow-to-fight-racism-but-face-critics-on-diversity-2020-06-10", "https://www.nasdaq.com/articles/u.s.-students-app-offers-roadmap-to-singapore-contact-tracing-tech-2020-06-10-0", "https://www.nasdaq.com/articles/facebook-twitter-google-to-report-monthly-on-fake-news-fight-eu-says-2020-06-10", "https://www.nasdaq.com/articles/u.s.-students-app-offers-roadmap-to-singapore-contact-tracing-tech-2020-06-10", "https://www.nasdaq.com/articles/notable-wednesday-option-activity%3A-amzn-aapl-googl-2020-06-10"], "Content": ["Among the underlying components of the S&P 500 index, we saw noteworthy options trading volume today in Amazon.com Inc (Symbol: AMZN), where a total of 188,634 contracts have traded so far, representing approximately 18.9 million underlying shares.  That amounts to about 501.2% of AMZN's average daily trading volume over the past month of 3.8 million shares.  Especially high volume was seen for the $2700 strike call option expiring June 12, 2020, with 10,285 contracts trading so far today, representing approximately 1.0 million underlying shares of AMZN.  Below is a chart showing AMZN's trailing twelve month trading history, with the $2700 strike highlighted in orange:\n\nEND", "By Thyagaraju Adinarayan and John McCrankLONDON/NEW YORK, June 10 (Reuters) - A raft of small cap stocks has soared by hundreds of millions of dollars in value in recent weeks as frenzied retail traders piled in to a blistering stocks rally.Increased savings, stimulus checks from the government, and ultra-low interest rates due to the coronavirus pandemic have led to a flood of money into the markets from punters, leading to chaotic trades via mobile phone apps.A little-known Chinese online real estate company's American depositary shares (ADSs) jumped as much as 1,250% on Tuesday before closing 400% higher. The reason cited widely on social media was a part of its name, FANGDD Network DUO.O.\"In my 20 years of experience I've never seen retail traders push stocks around like they're doing right now,\" said Dennis Dick, a trader with Bright Trading LLC. \"When the retail rush comes into something, it can really move.\"END", "Adds backgroundPRAGUE, June 10 (Reuters) - The two Czech ruling coalition parties agreed on Wednesday to introduce a 5% digital tax on the local revenues of global internet giants such as Amazon and Google, news agency CTK quoted Labour Minister Jana Malacova as saying on Wednesday.The government has long planned to impose the tax on firms with global revenue over 750 million euros ($853 million)annually, 100 million crowns ($4.28 million) turnover in the Czech market and more than 200,000 user accounts. It was not immediately clear if any of those parameters would change.The initial plan was to impose a 7% tax on big tech companies’ local revenues from targeted advertising, digital marketplace provision and user data sales despite opposition from the United States where the biggest firms are based.The Czech Republic would follow other countries in Europe with its digital tax after the European Union failed to reach a bloc-wide agreement. The Czech legislation is still subject to parliamentary approval.END", "Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) may be the king of search engines, but its presence in the television market has been nearly nonexistent. Sure, its YouTube is the go-to platform for sharing and watching crowd-contributed digital video, and YouTube TV adds actual studio-made programming to the mix. YouTube TV presently hosts a modest 2 million paying subscribers, which translates into a modest $3 billion in annual revenue. That's hardly a show stopper.Don't be surprised if Alphabet's digital television footprint expands much more rapidly over the course of the next five years than it has during the past five, however. The company has made four important moves on the TV front just within the past month that could finally, collectively, turn it into a television powerhouse.END", "By Ross Kerber, Helen Coster and Arriana McLymoreJune 10 (Reuters) - In the past, U.S. corporations have largely remained silent as protests erupted over killings of African-Americans by police officers. That changed with the May 25 death of George Floyd in Minneapolis, which has set off a flurry of corporate statements of solidarity with the black community – along with pledges of more than $1.7 billion to advance racial justice and equity.The unprecedented outpouring of support, however, has stirred up criticism along with praise. Many social justice advocates, corporate diversity experts and investors say companies also need to focus on equity in their own ranks, especially by hiring and promoting minority workers.The tensions show the difficulty executives face in aligning their firms with popular social causes at a time of soaring wealth and inequality – and growing pressure from some investors to show leadership on societal problems. Activists, along with some business leaders, also see an opportunity amid global protests to push reform on social justice issues well beyond police brutality.The rush of corporate concern belies the reality of workforce inequity, said Natasha Lamb, managing partner of Arjuna Capital. Arjuna is a Boston-based investment adviser and frequent filer of shareholder resolutions pressing companies - with mixed success - to disclose more data on pay equity.END", "By Paresh DaveOAKLAND, Calif., June 10 (Reuters) - Singapore kicked off a global rush to develop contact tracing apps for the novel coronavirus when the city-state launched an apparently new system in March.But the project actually drew inspiration from a 2014 U.S. high school project that won an international prize but found no backers - until now.It all started when Rohan Suri created an app at Thomas Jefferson High School in Alexandria, Virginia, to tell his mom to leave home for the bus stop when he was seven minutes away. As the Ebola epidemic ravaged western Africa at the time, Suri and schoolmate Claire Scoggins connected the dots between tracking apps and contact tracers who ask patients whom they may have spread viruses to.\"I got really interested in basically automating a lot of these contact tracing efforts,\" Suri said, noting a staff shortage in remote parts of Africa during the Ebola epidemic.END", "By Foo Yun CheeBRUSSELS, June 10 (Reuters) - Facebook FB.O, Google GOOGL.O and Twitter TWTR.N should provide monthly reports on their fight against disinformation, two senior EU officials said on Wednesday as they called out Russia and China for their roles in the spread of fake news.The comments by EU foreign policy head Josep Borrell and the European Commission's Vice President for values and transparency Vera Jourova underscore the bloc's concerns about the prevalence of misleading news on COVID-19 and the attempts by foreign actors to influence Europe.\"It really showed that disinformation does not only harm the health of our democracies, it also harms the health of our citizens. It can negatively impact the economy and undermine the response of the public authorities and therefore weaken the health measures,\" Jourova told a news conference.She said the next fake news front was vaccination, citing a study showing that Germans' willingness to be vaccinated had fallen by 20 percentage points in two months.END", "By Paresh DaveOAKLAND, Calif., June 10 (Reuters) - Singapore kicked off a global rush to develop contact tracing apps for the novel coronavirus when the city-state launched an apparently new system in March.But the project actually drew inspiration from a 2014 U.S. high school project that won an international prize but found no backers - until now.It all started when Rohan Suri created an app at Thomas Jefferson High School in Alexandria, Virginia, to tell his mom to leave home for the bus stop when he was seven minutes away. As the Ebola epidemic ravaged western Africa at the time, Suri and schoolmate Claire Scoggins connected the dots between tracking apps and contact tracers who ask patients whom they may have spread viruses to.\"I got really interested in basically automating a lot of these contact tracing efforts,\" Suri said, noting a staff shortage in remote parts of Africa during the Ebola epidemic.END", "Among the underlying components of the S&P 500 index, we saw noteworthy options trading volume today in Amazon.com Inc (Symbol: AMZN), where a total of 188,634 contracts have traded so far, representing approximately 18.9 million underlying shares.  That amounts to about 501.2% of AMZN's average daily trading volume over the past month of 3.8 million shares.  Especially high volume was seen for the $2700 strike call option expiring June 12, 2020, with 10,285 contracts trading so far today, representing approximately 1.0 million underlying shares of AMZN.  Below is a chart showing AMZN's trailing twelve month trading history, with the $2700 strike highlighted in orange:\n\nEND"]}