{"Title": ["Dow Movers: XOM, BA", "New U.S. restrictions on 33 Chinese firms and institutions take effect June 5", "GM, Ford join U.S. companies condemning George Floyd death, racism", "What Should You Expect From Broadcom’s Q2 Earnings Report?", "How to Profit From Advanced Micro Devices Amid Dwindling Momentum", "INTC a Top 25 Dividend Giant With $33.26B Held By ETFs", "Semiconductor Companies Gear up to Seek Federal Funding to Open U.S. Plants", "Facebook, Snapchat join chorus of companies condemning George Floyd death, racism", "Dow Movers: XOM, BA", "Dow Movers: BA, INTC", "Nvidia Is Showing Investors It’s More Than Fun and Games", "7 5G Stocks to Buy for the Future of Telecom", "AMD Stock May Look Weak, but There’s Still Lots of Opportunity", "Here’s Why AMD Stock Has Doubled in the Past Year", "Qualcomm Stock Still Has Plenty of Room to Run With the 5G Catalyst", "Noteworthy ETF Inflows: ESGU, HD, PG, INTC", "Only Fourteen Dow Components With Recent Insider Buying, INTC is One of Them", "S&P futures tread water as Sino-U.S. tensions weigh", "Nasdaq Today: What's Sending Chip Stocks AMD and NVIDIA Lower Wednesday?", "The Trump Administration’s War on Huawei Could Hurt These 3 Stocks", "Intel Remains A Blue-Chip Stock to Buy Post-Pandemic", "Earnings Show There’s No Reason to Let Nvidia Stock Go Yet", "This Huge Opportunity Can Supercharge AMD’s Growth", "NVIDIA's Data Center Business Is Now Almost as Big as Gaming", "S&P 500 set for muted open after hitting near 3-month high", "Is TSMC Becoming a Pawn in the Trade War Between the U.S. and China?", "Remdesivir Can’t Cure Covid, But Good Luck Telling Gilead Stock", "EARNINGS-Nvidia forecasts second-quarter revenue above estimates", "How to Start Investing in Private Equity", "3 Dow Jones Stocks to Trade for the Technical Investor", "Stock to Buy Advanced Micro Devices Ready to Reclaim the Throne", "Notable Wednesday Option Activity: GOOG, INTC, GLW", "Where Will Advanced Micro Devices Be in 1 Year?", "Noteworthy ETF Inflows: SPY, BRK.B, PG, INTC", "Expect Earnings to Highlight the Potential of Nvidia Stock", "S&P 500 flat after mixed retail earnings", "S&P 500 steady after mixed retail earnings", "Dow Movers: DIS, WMT", "Insiders Buy the Holdings of DSI ETF", "Mobileye CEO sees \"great consolidation\" ahead in autonomous car sector", "Dow Jones Surges 400 Points as Coca-Cola Warns on Pandemic Aftermath, Intel's AMD Killer Falls Short", "Breakingviews - China's chip giant serves nationalism and reform", "Why Intel Could Lose More Ground to AMD", "Taiwan Semiconductor To Build a $12 Billion Chip Plant In Arizona", "U.S. Bans Huawei From Purchasing American Chips in Escalation of the Trade War", "3 Tech Stocks Backed By Killer New Laptop Releases", "Dow Movers: WBA, UNH", "How AMD Will Beat Its Own Revenue Forecast in 2020", "Advanced Micro Devices Is a Curious Defensive Play", "Nvidia launches chip aimed at data center economics"], "Elapsed Time": ["1 HOUR AGO", "22 HOURS AGO", "2 DAYS AGO", "2 DAYS AGO", "2 DAYS AGO", "2 DAYS AGO", "2 DAYS AGO", "3 DAYS AGO", "1 HOUR AGO", "6 DAYS AGO", "6 DAYS AGO", "6 DAYS AGO", "6 DAYS AGO", "6 DAYS AGO", "MAY 28, 2020", "MAY 28, 2020", "6 DAYS AGO", "MAY 28, 2020", "MAY 27, 2020", "MAY 27, 2020", "MAY 27, 2020", "MAY 26, 2020", "MAY 26, 2020", "MAY 24, 2020", "MAY 28, 2020", "MAY 22, 2020", "MAY 22, 2020", "MAY 21, 2020", "MAY 21, 2020", "MAY 20, 2020", "MAY 20, 2020", "MAY 20, 2020", "MAY 23, 2020", "MAY 20, 2020", "MAY 20, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 19, 2020", "MAY 20, 2020", "MAY 17, 2020", "MAY 17, 2020", "MAY 15, 2020", "MAY 15, 2020", "MAY 15, 2020", "MAY 15, 2020", "MAY 15, 2020", "MAY 18, 2020", "MAY 14, 2020"], "Published Date": ["Jun 4, 2020 10:13AM EDT", "Jun 3, 2020 1:42PM EDT", "Jun 2, 2020 11:32AM EDT", "Jun 2, 2020 11:03AM EDT", "Jun 2, 2020 10:02AM EDT", "Jun 2, 2020 7:57AM EDT", "Jun 1, 2020 2:58PM EDT", "Jun 1, 2020 9:41AM EDT", "Jun 4, 2020 10:13AM EDT", "May 29, 2020 10:20AM EDT", "May 29, 2020 8:04AM EDT", "May 29, 2020 7:50AM EDT", "May 29, 2020 7:17AM EDT", "May 28, 2020 3:55PM EDT", "May 28, 2020 10:56AM EDT", "May 28, 2020 10:49AM EDT", "May 29, 2020 11:08AM EDT", "May 28, 2020 6:46AM EDT", "May 27, 2020 12:18PM EDT", "May 27, 2020 10:40AM EDT", "May 27, 2020 6:44AM EDT", "May 26, 2020 3:42PM EDT", "May 26, 2020 8:38AM EDT", "May 24, 2020 2:42PM EDT", "May 28, 2020 8:46AM EDT", "May 22, 2020 12:00PM EDT", "May 22, 2020 11:01AM EDT", "May 21, 2020 4:46PM EDT", "May 21, 2020 9:47AM EDT", "May 20, 2020 3:39PM EDT", "May 20, 2020 1:45PM EDT", "May 20, 2020 1:18PM EDT", "May 23, 2020 8:30AM EDT", "May 20, 2020 10:52AM EDT", "May 20, 2020 8:38AM EDT", "May 19, 2020 12:58PM EDT", "May 19, 2020 11:24AM EDT", "May 19, 2020 10:13AM EDT", "May 19, 2020 10:05AM EDT", "May 19, 2020 8:30AM EDT", "May 20, 2020 12:38PM EDT", "May 17, 2020 11:56PM EDT", "May 17, 2020 1:33PM EDT", "May 15, 2020 12:57PM EDT", "May 15, 2020 12:16PM EDT", "May 15, 2020 10:39AM EDT", "May 15, 2020 10:30AM EDT", "May 15, 2020 6:40AM EDT", "May 18, 2020 12:44PM EDT", "May 14, 2020 9:00AM EDT"], "Link": ["https://www.nasdaq.com/articles/dow-movers%3A-xom-ba-2020-06-04", "https://www.nasdaq.com/articles/new-u.s.-restrictions-on-33-chinese-firms-and-institutions-take-effect-june-5-2020-06-03", "https://www.nasdaq.com/articles/gm-ford-join-u.s.-companies-condemning-george-floyd-death-racism-2020-06-02", "https://www.nasdaq.com/articles/what-should-you-expect-from-broadcoms-q2-earnings-report-2020-06-02", "https://www.nasdaq.com/articles/how-to-profit-from-advanced-micro-devices-amid-dwindling-momentum-2020-06-02", "https://www.nasdaq.com/articles/intc-a-top-25-dividend-giant-with-%2433.26b-held-by-etfs-2020-06-02", "https://www.nasdaq.com/articles/semiconductor-companies-gear-up-to-seek-federal-funding-to-open-u.s.-plants-2020-06-01", "https://www.nasdaq.com/articles/facebook-snapchat-join-chorus-of-companies-condemning-george-floyd-death-racism-2020-06-01", "https://www.nasdaq.com/articles/dow-movers%3A-xom-ba-2020-06-04", "https://www.nasdaq.com/articles/dow-movers%3A-ba-intc-2020-05-29", "https://www.nasdaq.com/articles/nvidia-is-showing-investors-its-more-than-fun-and-games-2020-05-29", "https://www.nasdaq.com/articles/7-5g-stocks-to-buy-for-the-future-of-telecom-2020-05-29", "https://www.nasdaq.com/articles/amd-stock-may-look-weak-but-theres-still-lots-of-opportunity-2020-05-29", "https://www.nasdaq.com/articles/heres-why-amd-stock-has-doubled-in-the-past-year-2020-05-28", "https://www.nasdaq.com/articles/qualcomm-stock-still-has-plenty-of-room-to-run-with-the-5g-catalyst-2020-05-28", "https://www.nasdaq.com/articles/noteworthy-etf-inflows%3A-esgu-hd-pg-intc-2020-05-28", "https://www.nasdaq.com/articles/only-fourteen-dow-components-with-recent-insider-buying-intc-is-one-of-them-2020-05-29", "https://www.nasdaq.com/articles/sp-futures-tread-water-as-sino-u.s.-tensions-weigh-2020-05-28", "https://www.nasdaq.com/articles/nasdaq-today%3A-whats-sending-chip-stocks-amd-and-nvidia-lower-wednesday-2020-05-27", "https://www.nasdaq.com/articles/the-trump-administrations-war-on-huawei-could-hurt-these-3-stocks-2020-05-27", "https://www.nasdaq.com/articles/intel-remains-a-blue-chip-stock-to-buy-post-pandemic-2020-05-27", "https://www.nasdaq.com/articles/earnings-show-theres-no-reason-to-let-nvidia-stock-go-yet-2020-05-26", "https://www.nasdaq.com/articles/this-huge-opportunity-can-supercharge-amds-growth-2020-05-26", "https://www.nasdaq.com/articles/nvidias-data-center-business-is-now-almost-as-big-as-gaming-2020-05-24", "https://www.nasdaq.com/articles/sp-500-set-for-muted-open-after-hitting-near-3-month-high-2020-05-28", "https://www.nasdaq.com/articles/is-tsmc-becoming-a-pawn-in-the-trade-war-between-the-u.s.-and-china-2020-05-22", "https://www.nasdaq.com/articles/remdesivir-cant-cure-covid-but-good-luck-telling-gilead-stock-2020-05-22", "https://www.nasdaq.com/articles/earnings-nvidia-forecasts-second-quarter-revenue-above-estimates-2020-05-21-0", "https://www.nasdaq.com/articles/how-to-start-investing-in-private-equity-2020-05-21", "https://www.nasdaq.com/articles/3-dow-jones-stocks-to-trade-for-the-technical-investor-2020-05-20", "https://www.nasdaq.com/articles/stock-to-buy-advanced-micro-devices-ready-to-reclaim-the-throne-2020-05-20", "https://www.nasdaq.com/articles/notable-wednesday-option-activity%3A-goog-intc-glw-2020-05-20", "https://www.nasdaq.com/articles/where-will-advanced-micro-devices-be-in-1-year-2020-05-23", "https://www.nasdaq.com/articles/noteworthy-etf-inflows%3A-spy-brk.b-pg-intc-2020-05-20", "https://www.nasdaq.com/articles/expect-earnings-to-highlight-the-potential-of-nvidia-stock-2020-05-20", "https://www.nasdaq.com/articles/sp-500-flat-after-mixed-retail-earnings-2020-05-19", "https://www.nasdaq.com/articles/sp-500-steady-after-mixed-retail-earnings-2020-05-19", "https://www.nasdaq.com/articles/dow-movers%3A-dis-wmt-2020-05-19", "https://www.nasdaq.com/articles/insiders-buy-the-holdings-of-dsi-etf-2020-05-19", "https://www.nasdaq.com/articles/mobileye-ceo-sees-great-consolidation-ahead-in-autonomous-car-sector-2020-05-19", "https://www.nasdaq.com/articles/dow-jones-surges-400-points-as-coca-cola-warns-on-pandemic-aftermath-intels-amd-killer", "https://www.nasdaq.com/articles/breakingviews-chinas-chip-giant-serves-nationalism-and-reform-2020-05-18", "https://www.nasdaq.com/articles/why-intel-could-lose-more-ground-to-amd-2020-05-17", "https://www.nasdaq.com/articles/taiwan-semiconductor-to-build-a-%2412-billion-chip-plant-in-arizona-2020-05-15", "https://www.nasdaq.com/articles/u.s.-bans-huawei-from-purchasing-american-chips-in-escalation-of-the-trade-war-2020-05-15", "https://www.nasdaq.com/articles/3-tech-stocks-backed-by-killer-new-laptop-releases-2020-05-15", "https://www.nasdaq.com/articles/dow-movers%3A-wba-unh-2020-05-15", "https://www.nasdaq.com/articles/how-amd-will-beat-its-own-revenue-forecast-in-2020-2020-05-15", "https://www.nasdaq.com/articles/advanced-micro-devices-is-a-curious-defensive-play-2020-05-18", "https://www.nasdaq.com/articles/nvidia-launches-chip-aimed-at-data-center-economics-2020-05-14"], "Content": ["\nIn early trading on Thursday, shares of Boeing topped the list of the day's best performing Dow Jones Industrial Average components, trading up 4.4%.  Year to date, Boeing has lost about 44.5% of its value.\n\nAnd the worst performing Dow component thus far on the day is Exxon Mobil, trading down 1.6%.  Exxon Mobil is lower by about 30.6% looking at the year to date performance.\n\nTwo other components making moves today are Walgreens Boots Alliance, trading down 1.5%, and Intel trading up 0.8% on the day.\n\n \n\n\n\n\n\n\n\nVIDEO: Dow Movers: XOM, BA\nEND", "By David Shepardson and Karen FreifeldWASHINGTON/NEW YORK, June 3 (Reuters) - The U.S Commerce Department said on Wednesday that new restrictions on 33 Chinese firms and institutions it announced last month will take effect Friday.The agency has added the companies and institutions to an economic blacklist, accusing them of helping China spy on its minority Muslim Uighur population in Xinjiang or because of alleged ties to weapons of mass destruction and China's military.China's foreign ministry said last month it deplored and firmly opposed U.S. sanctions over Xinjiang, calling it a purely internal affair for China.The move will restrict the sales of U.S. goods to the companies and institutions on the list, as well as certain items made abroad with U.S. content or technology. Companies can apply for licenses to make the sales, but they must overcome a presumption of denial.END", "June 2 (Reuters) - General Motors Co GM.N and Ford Motor Co F.N condemned racial inequality in the United States following the death of George Floyd, an unarmed black man, at the hands of police in Minneapolis last week.In a letter to employees, GM Chief Executive Officer Mary Barra wrote she was \"impatient and disgusted\" following the death of Floyd and emphasized the need to \"individually and collectively\" drive change.The No.1 U.S. automaker shared Barra's letter, sent to its staff on Saturday, with thousands of dealers and suppliers.Barra also said she was commissioning an inclusion advisory board at the company.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsBroadcom (NASDAQ:AVGO) will deliver one of the more closely watched earnings report for this season on June 4. In the first quarter, the company posted $5.25 in earnings per share (EPS) on revenue of $5.85 billion. That was below the consensus estimate for $5.34 per share. What are the expectations for AVGO stock in the second quarter?END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsThe Invesco QQQ ETF (NASDAQ:QQQ) is within striking distance of its record high, well before the other major indexes. But some of the players that led the tech stock snapback have lost steam lately. Advanced Micro Device (NASDAQ:AMD) is one of them. AMD stock returned to its previous peak as early as mid-April, but it has been stuck in the mud ever since.END", "Intel Corp (Symbol: INTC) has been named as a Top 25 ''Dividend Giant'' by ETF Channel, with a stunning $33.26B worth of stock held by ETFs, and above-average ''DividendRank'' statistics including a strong 2.13% yield, according to the most recent Dividend Channel ''DividendRank'' report.   The report noted a strong quarterly dividend history at Intel Corp, and favorable long-term multi-year growth rates in key fundamental data points.\n\n\nThe annualized dividend paid by Intel Corp is $1.32/share, currently paid in quarterly installments, and its most recent dividend ex-date was on 05/06/2020.  Below is a long-term dividend history chart for INTC, which the report stressed as being of key importance.  Indeed, studying a company's past dividend history can be of good help in judging whether the most recent dividend is likely to continue.\n\n\nEND", "The Semiconductor Industry Association, the trade group that represents Intel (NASDAQ: INTC) and other U.S. semiconductor companies, plans to lobby the federal government for billions of dollars in funding to build chip plants on U.S. soil, reportsa the Wall Street Journal. Citing a draft of the proposal put forth by the Semiconductor Industry Association, whose members also include Broadcom, Micron, and AMD, the Association reportedly wants the federal government to offer up $37 billion in funding to states wooing semiconductor companies and for research and development.END", "Adds background in paras 3-5June 1 (Reuters) - Facebook Inc FB.O and Snapchat developer Snap Inc SNAP.N became the latest  U.S. companies condemning racial inequality in the United States as violent protests flared up across major cities over the death of George Floyd, an unarmed black man who died while in police custody in Minneapolis last week.The two tech companies followed Intel Corp INTC.O, Netflix Inc NFLX.O, Alphabet's GOOGL.O Google, International Business Machines Corp IBM.N and Nike Inc NKE.N in taking a public stance against Floyd's death - calling out discrimination against African-Americans.But tech companies such as Facebook and Google for years have struggled to quell concerns about discrimination against African-Americans in their own workplaces, and black engineers remain underrepresented in their workforces relative to the U.S. population.The challenges are not expected to ease as the novel coronavirus pandemic forces the companies to slow hiring and work remotely for months to come.  END", "\nIn early trading on Thursday, shares of Boeing topped the list of the day's best performing Dow Jones Industrial Average components, trading up 4.4%.  Year to date, Boeing has lost about 44.5% of its value.\n\nAnd the worst performing Dow component thus far on the day is Exxon Mobil, trading down 1.6%.  Exxon Mobil is lower by about 30.6% looking at the year to date performance.\n\nTwo other components making moves today are Walgreens Boots Alliance, trading down 1.5%, and Intel trading up 0.8% on the day.\n\n \n\n\n\n\n\n\n\nVIDEO: Dow Movers: XOM, BA\nEND", "In early trading on Friday, shares of Intel topped the list of the day's best performing Dow Jones Industrial Average components, trading up 1.8%.  Year to date, Intel registers a 4.9% gain.\n\nAnd the worst performing Dow component thus far on the day is Boeing, trading down 1.9%.  Boeing is lower by about 54.9% looking at the year to date performance.\n\nTwo other components making moves today are Caterpillar, trading down 1.5%, and Microsoft, trading up 1.1% on the day.\n\n \n\n\n\n\n\n\n\nVIDEO: Dow Movers: BA, INTC\nEND", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsIn advance of its earnings report on May 21, Nvidia (NASDAQ:NVDA) stock was generating significant interest from investors. The Covid-19 pandemic forced Americans to shelter in place. As a result, demand for video games — and the devices that power them — soared. And investors expected this trend would create surging demand for the company’s graphic processing units (GPUs).END", "InvestorPlace - Stock Market News, Stock Advice & Trading Tips5G or fifth-generation telecom promises huge changes in the way we interact with technology. For investors, this means it’s time to think about 5G stocks.5G will not only be faster, but it will provide more bandwidth. This means that we, and the companies that provide us with data, can provide more data simultaneously.If I can lean on the analogy of water through a hose — not only will the water move faster through the hose, but the hose will also increase in size. This is going to mean that wireless connections will be as fast, and in some places faster, than the available wireline services.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsIn a market that’s demonstrated a knack for volatile price swings in 2020, is this week’s dizzying tribute in Advanced Micro Devices (NASDAQ:AMD) an opportunity for investors to buy, sell or simply hold on tight too? Let’s take a look at what’s happening off and on the price chart of AMD stock to form a stronger risk-adjusted opinion on positioning for tomorrow and beyond.END", "Prior to 2017, Advanced Micro Devices (NASDAQ: AMD) was stuck. In the CPU market, AMD's products were vastly inferior to those of market leader Intel (NASDAQ: INTC). In the GPU market, NVIDIA (NASDAQ: NVDA) was overwhelmingly dominant.AMD is still in second place across the board, but the company is now on the rise. The launch of its Ryzen PC CPUs in 2017 and its EPYC server CPUs based on the same underlying technology has put Intel on the defensive. And while NVIDIA still leads the GPU market, AMD came out with its most competitive GPU product in a long time last year.AMD stock has more than doubled over the past year. The reason for this rally is simple: Investors are expecting big market-share gains and rapid earnings growth.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsQualcomm (NASDAQ:QCOM) had a huge year in 2019. This year was on track to be even better, and QCOM stock reflected that. In January, it came within a hair of closing at $96, a record high. Shareholder jubilation quickly turned to dismay when the company’s stock plummeted during the March market selloff. However, Qualcomm didn’t stay in the cellar for long. It’s now up 28% from that March low. Thanks to the promise of 5G adoption, this stock is well positioned for long-term growth — although investors may need to show a little patience.END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares ESG MSCI USA ETF (Symbol: ESGU) where we have detected an approximate $147.0 million dollar inflow -- that's a 2.1% increase week over week in outstanding units (from 103,450,000 to 105,600,000).  Among the largest underlying components of ESGU, in trading today Home Depot Inc (Symbol: HD) is up about 0.4%, Procter & Gamble Company  (Symbol: PG) is up about 1.9%, and Intel Corp (Symbol: INTC) is lower by about 0.9%. For a complete list of holdings, visit the ESGU Holdings page » \n\nThe chart below shows the one year price performance of ESGU, versus its 200 day moving average:\n   \n\nEND", "The officers and directors of a company tend to have a unique inside view into the business, so when these insiders make purchases, investors are wise to take notice.  Presumably the only reason for a company insider to choose to take their hard-earned cash and use it to buy stock in the open market, is that they expect to make money — maybe they find the stock very undervalued, or maybe they see exciting progress within the company, or maybe both.  Within the 30 components of the Dow Jones Industrial Average, only fourteen companies have experienced such buying over the trailing six month period, one of which was Intel Corp (Symbol: INTC), where an investment totaling $999.2K was made by Director Alyssa Henry.  Click Here to Learn Which Other Thirteen Dow Components Also Had Recent Insider Buying »\nEND", "By Medha SinghMay 28 (Reuters) - Futures contracts for the S&P 500 were largely flat on Thursday as investors weighed hopes of an economic recovery against underlying tensions between the United States and China.Chipmakers, which are sensitive to China's growth, were under pressure, with Intel Corp INTC.O and Advanced Micro Devices Inc AMD.O dropping about 1% each in premarket trade.President Donald Trump has promised action over China's new national security legislation for Hong Kong by the end of the week.Analysts have warned the souring relations between the world's two largest economies in recent weeks over trade and the handling of the coronavirus outbreak pose the biggest threat to the stock market's strong rally off the March lows.END", "The Nasdaq Composite (NASDAQINDEX: ^IXIC) has held up better during the coronavirus bear market than many of its broader benchmark peers, as investors have generally been optimistic about the prospects for the high-growth tech stocks that make up the bulk of the biggest companies that trade on the Nasdaq. However, as investors start to look past the coronavirus crisis, investors seem to be doing some sector rotation. That sent the Nasdaq Composite lower by more than 1% at noon EDT, and the Nasdaq 100 Index was down even more.Among the outstanding performers in the Nasdaq so far in 2020 have been NVIDIA (NASDAQ: NVDA) and Advanced Micro Devices (NASDAQ: AMD). NVIDIA came into Wednesday up nearly 50% year to date, and AMD had been higher by 16%. However, both stocks suffered declines of more than 5% Wednesday morning, and shareholders wonder whether the conditions that spurred them to move higher could now reverse themselves and cause headwinds going forward.END", "Chinese tech giant Huawei, one of the world's leading manufacturers of telecom equipment, networking hardware, and smartphones, has been repeatedly slammed by the Trump administration's trade war against China.Last year, the U.S. Department of Commerce placed Huawei on an \"Entity List,\" a group of firms that American companies cannot offer their technologies to without a special license. Earlier this year, it expanded that licensing requirement to all non-U.S. chipmakers that use American chipmaking equipment, intellectual property, and design software.The U.S. wanted to cut off Huawei's access to American technologies for three reasons: It wanted to throttle Huawei's progress in the 5G market, remain ahead of China in the semiconductor market, and limit Huawei's overseas reach due to national security concerns.Huawei claims it doesn't have a special relationship with the Chinese government, but it also didn't deny media reports that claimed it received as much as $75 billion in state subsidies. Therefore, the battle against Huawei could drag on for years as the trade war evolves into a tech war.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsGiven all the curveballs 2020 has thrown investors, it’s comforting to know that one company is still chugging along nicely: Intel (NASDAQ:INTC). Tech has remained a nice area of respite in uncertain times, and Intel stock in particular is poised to continue outperforming.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsI can see why some investors might fret about Nvidia (NASDAQ:NVDA) at this point. As markets have rallied from March lows, NVDA stock has doubled. Surely, some investors might think, the gains are at or near an end.END", "Advanced Micro Devices (NASDAQ: AMD) is showing no signs of slowing down despite the adverse impact of the COVID-19 outbreak on businesses and economies around the globe.The chipmaker delivered terrific growth for the first quarter of 2020, and expects to sustain its momentum for the remainder of the year. AMD's guidance indicates that its revenue could jump between 20% and 30% in 2020. However, it won't be surprising to see AMD surpass its own expectations thanks to the massive opportunity in the data center business and its growing clout against Intel (NASDAQ: INTC).END", "NVIDIA (NASDAQ: NVDA) has been stepping up its data center game for a while now. Last quarter's results indicate the effort has been worth it. Gaming is still the company's single biggest source of revenue, but data center sales saw a big year-over-year jump -- so big, in fact, that NVIDIA could justify pouring more time and resources into the market, now that it's proved it can do well in it.END", "By Medha SinghMay 28 (Reuters) - The S&P 500 looked set for a subdued open on Thursday as investors paused for breath after three days of gains and weighed signs of an economic recovery against underlying tensions between the United States and China.Boeing Co BA.N climbed 4.7%, the most among the 30 blue-chip Dow components in before the bell trading, as the planemaker said it had resumed production of its 737 MAX passenger jet at its Washington plant, although at a \"low rate\". Its top supplier, Spirit AeroSystems SPR.N, jumped 6.3%.The benchmark S&P 500 .SPX managed to close above the key 3,000 mark at a near three-month high on Wednesday, as growing evidence of a pick up in business activity across the globe and massive amounts of stimulus drove hopes of an economic recovery.END", "TSMC (NYSE: TSM), the world's largest contract chipmaker, recently announced plans to build a new $12 billion plant in Arizona by 2024. The facility will hire 1,600 people and produce up to 20,000 wafers per month with its 5nm manufacturing process.The announcement might seem like good news for Taiwan-based TSMC and Arizona, but it also indicates the company is becoming entangled in the escalating trade war. Let's see how this deal could affect TSMC's business, and whether or not it's becoming a pawn in the messy tech war between the U.S. and China.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsGilead Sciences (NASDAQ:GILD) created Remdesivir to treat the Ebola virus. This is a coronavirus similar to, though not precisely like, the COVID-19 strain behind the global pandemic.END", "Adds details from releaseMay 21 (Reuters) - Nvidia Corp NVDA.O on Thursday forecast second-quarter revenue above analysts' estimates, as demand surges for its chips used in data centers that power the shift to working remotely due to the coronavirus outbreak.The company said the forecast includes contribution from its $6.9 billion purchase of Israeli chip firm Mellanox Technologies Ltd, which strengthened its data center business.The chipmaker said it expects current-quarter revenue of $3.65 billion, plus or minus 2%, while analysts on average were expecting $3.29 billion, according to IBES data from Refinitiv.     Much like rivals Intel Corp INTC.O and  Advanced Micro Devices Inc AMD.O, Nvidia recorded a jump in demand for data center chips as companies invested to strengthen their IT infrastructure to support employees working remotely.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsWhat is private investing?END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsHeadlines can be fickle at best. But don’t fret. With more reliable price action indicating unfinished business for today’s bull market, let’s explore two Dow Jones stocks to buy and one to monitor for selling in case a second round of sell-offs comes to pass.Tuesday’s headlines weren’t the positive signals long-term investors relish. Strong gains by the Dow Jones to start the week, prompted in part by promising novel coronavirus vaccine news from biotech Moderna (NASDAQ:MRNA), were quickly challenged as health experts offered skeptical criticism of the yesterday’s announcement.The countering headlines saw Monday’s well-cheered gains of nearly 4% chipped away by a dip of 1.59% in the blue chip index. And unsurprisingly, many Dow Jones stocks fared even worse.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsAdvanced Micro Devices (NASDAQ:AMD) is always a stock to buy, especially when share prices decline. And when it comes to buying on the dip, the bigger the better.END", "Among the underlying components of the S&P 500 index, we saw noteworthy options trading volume today in Alphabet Inc (Symbol: GOOG), where a total of 13,214 contracts have traded so far, representing approximately 1.3 million underlying shares.  That amounts to about 72.3% of GOOG's average daily trading volume over the past month of 1.8 million shares.  Especially high volume was seen for the $1400 strike call option expiring May 22, 2020, with 684 contracts trading so far today, representing approximately 68,400 underlying shares of GOOG.  Below is a chart showing GOOG's trailing twelve month trading history, with the $1400 strike highlighted in orange:\n\nEND", "One of the biggest winners in the semiconductor space over the past few years has been Advanced Micro Devices (NASDAQ: AMD). The CPU and GPU designer had long been an also-ran in the chip space, with minimal market share relative to CPU leader Intel (NASDAQ: INTC) and GPU leader NVIDIA (NASDAQ: NVDA).However, that is clearly changing. Look no further than AMD's stock price relative to the market for the last five years as evidence of its renaissance under CEO Lisa Su, who took over in 2014. AMD 5 Year Total Returns (Daily) data by YChartsBut just because AMD has annihilated the overall market's returns for the last five years doesn't necessarily mean it's too late to get on the AMD train. In the field of technology, oftentimes it's the winners that keep on winning.Looking at recent developments in the chip space, AMD does appear to have a solid and even improving outlook going into the second half of 2020 and into 2021.END", "Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the SPDR— S&P 500— ETF Trust (Symbol: SPY) where we have detected an approximate $219.2 million dollar inflow -- that's a 0.1% increase week over week in outstanding units (from 889,680,000 to 890,430,000).  Among the largest underlying components of SPY, in trading today Berkshire Hathaway Inc New (Symbol: BRK.B) is up about 2.1%, Procter & Gamble Company  (Symbol: PG) is up about 0.7%, and Intel Corp (Symbol: INTC) is higher by about 3.3%. For a complete list of holdings, visit the SPY Holdings page » \n\nThe chart below shows the one year price performance of SPY, versus its 200 day moving average:\n   \n\nEND", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsIt took a while, but investors have come to realize that Nvidia (NASDAQ:NVDA) is likely to be an even bigger winner in the “new normal.” NVDA stock plunged as markets sold off in February and March. But it has skyrocketed off the bottom, gaining 79% in just over two months.END", "For a live blog on the U.S. stock market, click LIVE/ or type LIVE/ in a news windowWalmart rises on strong Q1 resultsAdvance Auto Parts gains on same-store sales potentialHome Depot drops after results miss estimatesU.S. housing starts post record declineIndexes mixed: Dow up 0.25%, S&P flat, Nasdaq up 0.55%Updates to early afternoonBy Medha Singh and Ambar WarrickMay 19 (Reuters) - The S&P 500 was largely unchanged on Tuesday, after a strong rally in the prior session, as investors sifted through a mixed batch of results from major retailers including Walmart and Home Depot.END", "For a live blog on the U.S. stock market, click LIVE/ or type LIVE/ in a news windowWalmart surges on strong Q1 resultsAdvance Auto Parts rises on Q2 same-stores sales potentialHome Depot drops after Q1 results miss estimatesU.S. housing starts post record declineIndexes mixed: Dow dips 0.26%, S&P flat, Nasdaq up 0.56%Adds quote, details; updates pricesBy Medha Singh and Ambar WarrickMay 19 (Reuters) - The S&P 500 was trading flat on Tuesday, handing back some gains from a strong rally in the previous session, as investors digested a mixed set of quarterly results from retailers including Home Depot and Walmart.END", "In early trading on Tuesday, shares of Walmart topped the list of the day's best performing Dow Jones Industrial Average components, trading up 2.0%.  Year to date, Walmart registers a 9.6% gain.\n\nAnd the worst performing Dow component thus far on the day is Walt Disney, trading down 2.4%.  Walt Disney is lower by about 21.1% looking at the year to date performance.\n\nTwo other components making moves today are Home Depot, trading down 2.1%, and Intel trading up 1.1% on the day.\n\n \n\n\n\n\n\n\n\nVIDEO: Dow Movers: DIS, WMT\nEND", "\nIntel Corp (Symbol: INTC), which makes up 1.96% of the iShares MSCI KLD 400 Social ETF (DSI), has seen 2 directors and officers purchase shares in the past six months, according to the recent Form 4 data.  The ETF holds a total of $35,310,458 worth of INTC, making it the #9 largest holding.  The table below details the recent insider buying activity observed at INTC:END", "JERUSALEM, May 19 (Reuters) - The autonomous car industry will have to consolidate because it is too difficult for separate companies to cooperate in developing self-driving vehicles, the head of Intel's INTC.O autonomous car unit said on Tuesday.Amnon Shashua, CEO of Intel's Israel-based Mobileye, said the strategy of having individual companies each focusing on one component, like safety, sensors or maps, is not sustainable because it's an \"end-to-end system\" that cannot be broken down.\"It's a formidable task, and there are going to be very very few actors who can go from silicon (chips) to self-driving systems,\" Shashua said during an online conference by the Israel government-backed EcoMotion.\"Therefore, what we see in the industry and what will continue in the industry is a great consolidation,\" he said.END", "Strong earnings reports from retailers Target and Lowe's helped power the stock market higher on Wednesday morning. The Dow Jones Industrial Average (DJINDICES: ^DJI) was up 1.8% at 11:30 a.m. EDT.Shares of beverage giant Coca-Cola (NYSE: KO) and chip giant Intel (NASDAQ: INTC) surged on Wednesday, despite negative news for both companies. Coca-Cola's CEO warned in an interview about weak sales volume in May and a painful recovery from the pandemic, and Intel's latest high-end gaming CPU was met with mixed reviews.END", "END", "Intel's (NASDAQ: INTC) fiscal 2020 first-quarter results were a tad disappointing as the chip giant withdrew its full-year guidance on account of the uncertainty caused by the novel coronavirus pandemic.Though the company managed to turn in impressive numbers for the quarter, delivering 23% annual revenue growth and a 63% increase in adjusted earnings per share (EPS), the second-quarter earnings guidance fell short of expectations. Intel's guidance points toward a 12% increase in revenue and a 4% improvement in EPS, which pales in comparison to the prior quarter.This sharp drop-off means Intel may not be able to sustain its coronavirus-driven momentum. One of the reasons why that may be the case is the fact the company continues to lag rival Advanced Micro Devices (NASDAQ: AMD) on the technology curve.END", "The world's largest semiconductor manufacturing specialist will spend $12 billion on a next-generation chip factory in Arizona.Taiwan Semiconductor Manufacturing (NYSE: TSM) committed to this massive project on Friday, as the Trump administration tightened restrictions on semiconductor shipments to and from China.END", "Chinese smartphone maker Huawei was dealt another blow Friday after the U.S. Commerce Department amended an export rule to prevent it from purchasing semiconductors from U.S. companies. In a statement, the Commerce Department said by amending the export rule it \"cuts off\" Huawei's ability to get around U.S. export controls. The Commerce Department contends that Huawei has continued to use software and semiconductors from U.S. companies even after the company and 114 of its overseas affiliates were added to a blacklist late last year.  END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsThe novel coronavirus has been bad news for most tech stocks. Even if their business has escaped a direct impact, the market selloff in March knocked them down significantly.However, one market segment that has staged a surprising comeback as a direct result of the pandemic is laptops. With employees working from home en masse, laptop sales have spiked. Research from the NDP Group shows laptop sales in the U.S. grew by 10% in the first two weeks of March alone.There have been reports of store shelves (and online stock) stripped of popular laptops, globally. Supply chain disruptions when the coronavirus first swept through China haven’t helped there, but demand is also stronger than manufacturers have seen in years.END", "\nIn early trading on Friday, shares of UnitedHealth Group topped the list of the day's best performing Dow Jones Industrial Average components, trading up 2.6%.  Year to date, UnitedHealth Group registers a 1.4% gain.\n\nAnd the worst performing Dow component thus far on the day is Walgreens Boots Alliance, trading down 3.2%.  Walgreens Boots Alliance is lower by about 36.2% looking at the year to date performance.\n\nTwo other components making moves today are Intel, trading down 2.5%, and Coca-Cola, trading up 2.2% on the day.\n\n \n\n\n\n\n\n\n\nVIDEO: Dow Movers: WBA, UNH\nEND", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsThe bullish sentiment for Advanced Micro Devices (NASDAQ:AMD) is so strong that near-term demand uncertainties are barely scaring its investors away. And while the company reported a strong first quarter, the lowered outlook should have sent AMD stock lower.END", "InvestorPlace - Stock Market News, Stock Advice & Trading TipsAdvanced Micro Devices (NASDAQ:AMD) shares opened May 18 near their pre-pandemic high and they’re likely to go higher. AMD stock was trading at almost $55 in the pre-market. The all-time high of $58 is within reach.END", "By Stephen NellisMay 14 (Reuters) - Semiconductor firm Nvidia Corp NVDA.O on Thursday announced a new chip that can be digitally split up to run several different programs on one physical chip, a first for the company that matches a key capability on many of Intel Corp's INTC.O chips.The notion behind what the Santa Clara, California-based company calls its A100 chip is simple: Help the owners of data centers get every bit of computing power possible out of the physical chips they purchase by ensuring the chip never sits idle. The same principle helped power the rise of cloud computing over the past two decades and helped Intel build a massive data center business.When software developers turn to a cloud computing provider such as Amazon.com AMZN.O or Microsoft Corp MSFT.O for computing power, they do not rent a full physical server inside a data center. Instead they rent a software-based slice of a physical server called a \"virtual machine.\"Such virtualization technology came about because software developers realized that powerful and pricey servers often ran far below full computing capacity. By slicing physical machines into smaller virtual ones, developers could cram more software on to them, similar to the puzzle game Tetris. Amazon, Microsoft and others built profitable cloud businesses out of wringing every bit of computing power from their hardware and selling that power to millions of customers.END"]}