{"Name": ["ARK INVESTMENT MANAGEMENT LLC", "RENAISSANCE TECHNOLOGIES LLC", "NIKKO ASSET MANAGEMENT AMERICAS, INC.", "SUMITOMO MITSUI TRUST HOLDINGS, INC.", "SABBY MANAGEMENT, LLC"], "Description": ["NO INFO", "Renaissance Technologies LLC, also known as RenTech or RenTec, is an American hedge fund based in East Setauket, New York, on Long Island, which specializes in systematic trading using quantitative models derived from mathematical and statistical analyses. The firm is regarded as one of the \"most secretive and successful\" hedge funds in the world. Their signature Medallion fund is famed for the best record in investing history. Renaissance was founded in 1982 by James Simons, an award-winning mathematician and former Cold War code breaker.\nIn 1988, the firm established its most profitable portfolio, the Medallion Fund, which used an improved and expanded form of Leonard Baum's mathematical models, improved by algebraist James Ax, to explore correlations from which they could profit. Jim Berlekamp was instrumental in evolving trading to shorter-dated, pure systems driven decision-making. The hedge fund was named Medallion in honor of the math awards that Simons and Ax had won.Renaissance's flagship Medallion fund, which is run mostly for fund employees, is famed for the best track record on Wall Street, returning more than 66 percent annualized before fees and 39 percent after fees over a 30-year span from 1988 to 2018. Renaissance offers two portfolios to outside investors—Renaissance Institutional Equities Fund (RIEF) and Renaissance Institutional Diversified Alpha (RIDA).Simons ran Renaissance until his retirement in late 2009. The company is now run by Peter Brown (after Robert Mercer resigned). Both of them were computer scientists specializing in computational linguistics who joined Renaissance in 1993 from IBM Research. Simons continues to play a role at the firm as non-executive chairman and remains invested in its funds, particularly the secretive and consistently profitable black-box strategy known as Medallion. Because of the success of Renaissance in general and Medallion in particular, Simons has been described as the best money manager on earth.", "NO INFO", "Sumitomo Mitsui Trust Holdings, Inc. (三井住友トラスト・ホールディングス株式会社, Mitsui Sumitomo Torasuto Hōrudingusu Kabushiki Gaisha), formerly Chuo Mitsui Trust Holdings, Inc., is a Japanese financial holding company headquartered in Chiyoda, Tokyo. It provides an assortment of financial products to retail and wholesale customers, with a focus on asset management, financial brokerage and real estate services.Its main operating company is Sumitomo Mitsui Trust Bank, Limited (三井住友信託銀行株式会社, Mitsui Sumitomo Shintaku Ginkō Kabushiki Gaisha), which is the largest trust company and the fifth-largest bank in Japan measured by assets.\nThe company has no capital relationship with the Sumitomo Mitsui Financial Group; the two banking groups are similarly named because both are descended from the historical Sumitomo and Mitsui conglomerates.\nThere is just a weak control relationship between Sumitomo Mitsui Trust Holdings and Sumitomo Mitsui Financial Group. In fact SM Trust Holdings controls about 66% of Japan Trustee Services Bank. As of March 31, 2017, SM Financial Group's website reports that Japan Trustee Services Bank owned 5.50% of Sumitomo Mitsui Financial Group, but also 1.52% from trust location n. 1 (信託口1), 1.50% from trust location n. 2 (信託口2), 2.05% from location n. 5 (信託口5), 1.36% from trust location n. 7 (信託口7), and 1.85% from trust location n. 9 (信託口9) as well.", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": ["NO INFO", [], "NO INFO", ["President (corporate title)|President"], "NO INFO"]}