{"Content": ["When 's  Fandango acquired 's Vudu, it reinforced its presence in the digital media purchase and rental space. But, , Fandango also got something else very important in the deal: Vudu's free ad-supported video on demand (AVOD) streaming service. In this aspect of the Fandango deal, we can see the pressure exerted by another deal: 's  acquisition of Tubi.Fox's deal to land Tubi wasn't officially closed until May, but it was announced in March and has helped set the tone for what has been a big year for AVOD services. Though  and other subscription-video-on-demand (SVOD) services are the ones best known by customers, AVOD services occupy the thoughts of many an executive.Image source: TubiAVOD services are free, ad-supported alternatives to the popular subscription-based SVOD services. While Netflix makes money on subscriptions, services like Tubi make money by bringing in viewers and selling ad space in their streams. Some services, like 's Hulu, do a bit of both.AVOD services are enjoying a moment in the sun for a few reasons. Chief among them is the fact that advertising is a big business, and traditional TV advertising is stuck on a sinking ship. Modern viewers are canceling cable and satellite programs and instead watching ad-free  alternatives like Netflix. Among viewers who still have legacy pay-TV services, there are many who use DVRs to record their programs and fast-forward through ads. These trends have been key to the increasingly prominent role that live sports play in pay-TV packages, but . Advertisers need other ways to reach consumers.Of course, advertisers want to know that they're actually reaching those consumers. In that regard, AVOD services have been doing pretty well. The Tubi service claims to have 25 million active users and to have served up 163 million hours worth of content to those users in December of 2019. That's not an unheard-of amount of viewers -- Disney+ has about twice that in subscribers, and Netflix has far more -- but it's still quite a few people to reach with advertisements.AVOD services also have the advantage of being able to offer ad buyers the ability to target ads. AVOD services offer \"addressable\" advertising, meaning that these services can show different ads within the same programs to different viewers. AVOD ads can be targeted based on user profiles and, in at least some cases, anonymized device profiles.That makes advertising more efficient -- and ad spots more valuable. In a virtuous cycle, it also allows AVOD services to cut down their ad loads, making the free services more appealing to viewers and increasing the size of the audience for advertisers.All of this helps explain why the AVOD market is growing fast. Between 2018 and 2020, AVOD revenue grew by 38%. Experts believe that revenue will only keep on growing, at least in the near term.A lot of companies have moved aggressively into AVOD in the past year or two.   rolled out the Roku Channel on its streaming platform in 2017.  launched a free service called IMDb Freedive (now IMDb TV) at the beginning of 2019. Comcast's forthcoming service Peacock has a free ad-supported option, and Comcast also owns Fandango, which acquired Vudu and its AVOD service, as mentioned above.Until it acquired Tubi, Fox didn't have an AVOD solution on this scale. Nor did Fox have a particularly strong setup for getting videos from its many media properties to its viewers. Fox was too far behind the streaming revolution. It had its broadcast and pay-TV channels (including its sports channels), but it lacked both a strong streaming presence and -- perhaps more importantly -- an advertising platform that would allow the company to monetize content without help from pay-TV bundlers and other fast-sinking outsiders.So Fox went big and acquired the biggest AVOD service on the market. Tubi had already passed competitors like 's Crackle, one of the oldest and best-known services in the AVOD space, to become the single largest AVOD service by both library size and active user base. By acquiring Tubi, Fox went from a non-player in streaming and AVOD to a major one.Fox has big plans for Tubi. AVOD services are valuable on their own, but a streaming service like Tubi can also be built upon. Roku is now turning the Roku Channel into a hub for premium subscription services, which is also how 's Apple TV app (an AVOD service with an SVOD service, Apple TV+, attached) works. NBCUniversal's Peacock includes a premium subscription option as well as an AVOD side.   in a move reminiscent of the Fox-Tubi deal; the company is now using its service to grow its previously meager footprint in streaming.In other words, there are lots of ways to make AVOD just the beginning of a streaming media presence. Fox will reportedly do so by adding old Fox shows to the platform and expanding the streaming service's mission to include national and local news streaming. Original content is not in the picture, though, at least not yet.Fox had to act because it needed a streaming future. It needed a way to make the kind of money that Amazon, Roku, and others have wrung from their AVOD platforms. And Fox needed to make sure that it was the one to buy Tubi, lest it be left with slimmer pickings, like the Vudu service that Fandango got. There's precious little space left in AVOD now, but Fox doesn't have to worry about that -- not anymore.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Fox Corporation wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.", ["When 's  Fandango acquired 's Vudu, it reinforced its presence in the digital media purchase and rental space. But, , Fandango also got something else very important in the deal: Vudu's free ad-supported video on demand (AVOD) streaming service. In this aspect of the Fandango deal, we can see the pressure exerted by another deal: 's  acquisition of Tubi.Fox's deal to land Tubi wasn't officially closed until May, but it was announced in March and has helped set the tone for what has been a big year for AVOD services. Though  and other subscription-video-on-demand (SVOD) services are the ones best known by customers, AVOD services occupy the thoughts of many an executive.Image source: TubiAVOD services are free, ad-supported alternatives to the popular subscription-based SVOD services. While Netflix makes money on subscriptions, services like Tubi make money by bringing in viewers and selling ad space in their streams. Some services, like 's Hulu, do a bit of both.AVOD services are enjoying a moment in the sun for a few reasons. Chief among them is the fact that advertising is a big business, and traditional TV advertising is stuck on a sinking ship. Modern viewers are canceling cable and satellite programs and instead watching ad-free  alternatives like Netflix. Among viewers who still have legacy pay-TV services, there are many who use DVRs to record their programs and fast-forward through ads. These trends have been key to the increasingly prominent role that live sports play in pay-TV packages, but . Advertisers need other ways to reach consumers.Of course, advertisers want to know that they're actually reaching those consumers. In that regard, AVOD services have been doing pretty well. The Tubi service claims to have 25 million active users and to have served up 163 million hours worth of content to those users in December of 2019. That's not an unheard-of amount of viewers -- Disney+ has about twice that in subscribers, and Netflix has far more -- but it's still quite a few people to reach with advertisements.AVOD services also have the advantage of being able to offer ad buyers the ability to target ads. AVOD services offer \"addressable\" advertising, meaning that these services can show different ads within the same programs to different viewers. AVOD ads can be targeted based on user profiles and, in at least some cases, anonymized device profiles.That makes advertising more efficient -- and ad spots more valuable. In a virtuous cycle, it also allows AVOD services to cut down their ad loads, making the free services more appealing to viewers and increasing the size of the audience for advertisers.All of this helps explain why the AVOD market is growing fast. Between 2018 and 2020, AVOD revenue grew by 38%. Experts believe that revenue will only keep on growing, at least in the near term.A lot of companies have moved aggressively into AVOD in the past year or two.   rolled out the Roku Channel on its streaming platform in 2017.  launched a free service called IMDb Freedive (now IMDb TV) at the beginning of 2019. Comcast's forthcoming service Peacock has a free ad-supported option, and Comcast also owns Fandango, which acquired Vudu and its AVOD service, as mentioned above.Until it acquired Tubi, Fox didn't have an AVOD solution on this scale. Nor did Fox have a particularly strong setup for getting videos from its many media properties to its viewers. Fox was too far behind the streaming revolution. It had its broadcast and pay-TV channels (including its sports channels), but it lacked both a strong streaming presence and -- perhaps more importantly -- an advertising platform that would allow the company to monetize content without help from pay-TV bundlers and other fast-sinking outsiders.So Fox went big and acquired the biggest AVOD service on the market. Tubi had already passed competitors like 's Crackle, one of the oldest and best-known services in the AVOD space, to become the single largest AVOD service by both library size and active user base. By acquiring Tubi, Fox went from a non-player in streaming and AVOD to a major one.Fox has big plans for Tubi. AVOD services are valuable on their own, but a streaming service like Tubi can also be built upon. Roku is now turning the Roku Channel into a hub for premium subscription services, which is also how 's Apple TV app (an AVOD service with an SVOD service, Apple TV+, attached) works. NBCUniversal's Peacock includes a premium subscription option as well as an AVOD side.   in a move reminiscent of the Fox-Tubi deal; the company is now using its service to grow its previously meager footprint in streaming.In other words, there are lots of ways to make AVOD just the beginning of a streaming media presence. Fox will reportedly do so by adding old Fox shows to the platform and expanding the streaming service's mission to include national and local news streaming. Original content is not in the picture, though, at least not yet.Fox had to act because it needed a streaming future. It needed a way to make the kind of money that Amazon, Roku, and others have wrung from their AVOD platforms. And Fox needed to make sure that it was the one to buy Tubi, lest it be left with slimmer pickings, like the Vudu service that Fandango got. There's precious little space left in AVOD now, but Fox doesn't have to worry about that -- not anymore.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Fox Corporation wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Looking at the underlying holdings of the ETFs in our coverage universe at , we have compared the trading price of each holding against the average analyst 12-month forward target price, and computed the weighted average implied analyst target price for the ETF itself. \tFor the Vanguard Mega Cap Value ETF (Symbol: MGV), we found that the implied analyst target price for the ETF based upon its underlying holdings is $83.21 per unit.\n\n\nWith MGV trading at a recent price near $74.74 per unit, that means that analysts see 11.33% upside for this ETF looking through to the average analyst targets of the underlying holdings.   Three of MGV's underlying holdings with notable upside to their analyst target prices are Fox Corp (Symbol: FOX), Berkshire Hathaway Inc (Symbol: BRK.A), and AFLAC Inc (Symbol: AFL). Although FOX has traded at a recent price of $28.78/share, the average analyst target is 66.78% higher at $48.00/share. Similarly, BRK.A has 34.70% upside from the recent share price of $278640.00 if the average analyst target price of $375316.00/share is reached, and analysts on average are expecting AFL to reach a target price of $46.00/share, which is 26.13% above the recent price of $36.47. Below is a twelve month price history chart comparing the stock performance of FOX, BRK.A, and AFL:  \n\n   Below is a summary table of the current analyst target prices discussed above:\n\nAre analysts justified in these targets, or overly optimistic about where these stocks will be trading 12 months from now? Do the analysts have a valid justification for their targets, or are they behind the curve on recent company and industry developments? A high price target relative to a stock's trading price can reflect optimism about the future, but can also be a precursor to target price downgrades if the targets were a relic of the past. These are questions that require further investor research.  \n\n\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Sports are just one of many industries hard hit by the novel coronavirus. The impact goes beyond just the sports teams themselves. Sports is an economy on its own. Many industries depend on the popularity of professional leagues like the NFL and NBA, as well as college basketball and football, for their continued success.This includes the ad-supported broadcast and cable television industries. As viewers move towards streaming apps for scripted entertainment, live sports is one of the few ways broadcasters have an edge against “disruptors” like  (NASDAQ:). But, with sports on hiatus until the pandemic subsides, major broadcasting names are taking a hit.It’s not all bad news for these ad stocks. The NFL plans to start their  in September. The NBA  later this year. However, it whether the 2020 NCAA football season will be canceled. Things remain up in the air for the 2020-2021 NCAA basketball season as well.Even if only college-level sports are cancelled this fall, it could still be bad news for sports broadcasters. College football generates . Without popular sports like this on the air, it’s going to be tough for national and regional-level sports broadcasters.There are many ad stocks that could be affected by a continued sports hiatus. Here are three names that could see the largest impact:Will continued cancellations of sports hurt these stocks going forward? Let’s dive in and find out.Source: Gary Watts / Shutterstock.com\n\tAs I discussed last month, DIS stock has its . But beyond troubles in the company’s theme park and theatrical motion picture business is the impact of sports cancellations on their ESPN unit.ESPN has already seen revenue losses due to the pandemic. With the NBA suspending its season, the sports broadcasting giant lost around  in ad revenue. If the NBA doesn’t return this fall, the network could see additional losses.But potential revenue losses go beyond professional basketball. If college football winds up being cancelled this fall, expect more pain for their top and bottom lines. The same could be said about college basketball, which is another key sport on the network’s television and streaming platforms.To top it all off, subscription revenue could take a hit as well. Both in terms of subscriber revenue from cable TV, as well as subscriber revenue for ESPN+.U.S. households could be using the coronavirus as good reason to  Given the sports network generates most of its revenue from “” paid by the cable companies, the potential ad revenue losses could pale in comparison to potential losses from cord cutting.With this in mind, Disney stock could experience more trouble, even as other things return to normal post-pandemic.Source: Leonard Zhukovsky / Shutterstock.com\n\tAfter  to Disney, FOX stock has become a pure play in broadcasting. Not only via its ownership of the Fox broadcast network and major Fox affiliates, but also via their ownership of national sports channels like FS1.Granted, Fox is more than just sports programming. But it does make up a big part of their overall audience. In short, it makes sense the company disclosed in a March 31  that the pandemic could materially impact their underlying business.But with the NFL starting on schedule, how bad could things be? Sure, the NFL is Fox’s flagship sports programming. Yet, with the , Fox may not be able to generate as much revenue as they have in prior football seasons.FOX stock has recovered from its March lows below $20 per share. But, trading around $25 per share today, it’s still far below prior highs above $35 per share. It may be temping to dive into beaten-down ad stocks like this. But with sports still up in the air, it may be not a great time to buy.Source: Shutterstock\n\tSinclair Broadcasting owns and/or operates scores of local television stations from coast to coast. As many of their  are Fox or CBS affiliates, that means heavy exposure to the near-term fortunes of the NFL. But the company’s exposure goes beyond just broadcast stations.Recent deals have left SBGI stock tied to the fortunes of regional sports networks, or RSNs. Last year, the company partnered with  to buy . Also, they purchased an equity stake in the , which airs New York Yankees games.To top it all off, Sinclair owns a piece of the , a Chicago-area RSN in partnership with the Chicago Cubs. Unfortunately, this venture launched just weeks before the coronavirus put Major League Baseball on hiatus.This is bad news in terms of ad revenue. But, like with ESPN, Sinclair could see a larger impact from a decline in affiliate fees. And not just from its stable of regional sports cable networks. In recent years, broadcasters like this company have boosted TV stations revenue via  paid by cable operators.In short, this could be one of the top ad stocks affected by sports cancellations. Keep this in mind, even as SBGI stock trades nearly 50% from where it was back in February.Thomas Niel, InvestorPlace contributor, as written single-stock analysis since 2016. As of this writing, Thomas Niel did not hold a position in any of the aforementioned securities.The post  appeared first on .The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["ikon search string for individual stock moves: The Day Ahead newsletter: The Morning News Call newsletter: U.S. stock indexes, S&P 500 and the Dow Jones were set to rise on Monday, building on last week's sharp gains after a surprise rebound in jobs strengthened views that the U.S. economy has weathered the worst of the economic fallout from the COVID-19 pandemic. At 8:30 ET, Dow e-minis  were up 1.02% at 27,348. S&P 500 e-minis  were up 0.71% at 3,209.5, while Nasdaq 100 e-minis  were up 0.02% at 9,810.   The top three NYSE percentage gainers premarket :  ** Noble Corporation Plc <NE.N>, up 160.7%  ** Chesapeake Energy <CHK.N>, up 79.8%  ** Highpoint Resources <HPR.N>, up 80.0%   The top three NYSE percentage losers premarket :  ** HB Fuller Co <FUL.N>, down 30.2%  ** Emergent Biosolutions <EBS.N>, down 12%  ** X Financial <XYF.N>, down 8.6%   The top three Nasdaq percentage gainers premarket :  ** Enochian Biosciences Inc <ENOB.O>, up 289.6%  ** Sino-Global Shipping America Ltd <SINO.O>, up 136.0%  ** Supercom Ltd <SPCB.O>, up 101.6%   The top three Nasdaq percentage losers premarket :  ** Opiant Pharmaceuticals Inc <OPNT.O>, down 33.3%  ** Fox Marble Holdings <FOX.O>, down 17%  ** Ascena Retail Group Inc <ASNA.O>, down 16.5%    ** Gilead Sciences Inc : up 4.2% premarket  BUZZ-Rises on report AstraZeneca approached co for potential merger    ** Cisco Systems Inc : down 0.2% premarket  BUZZ- Evercore raises PT on long-term opportunities    ** Yatra Online Inc : down 14.7% premarket  BUZZ-India's Yatra sees worst day in a month on Ebix merger termination    ** Chevron corp : up 3.4% premarket  BUZZ-JPM hikes PT on attractive cash margins, global asset base    ** Tesla Inc : up 1.4% premarket  BUZZ-Gains as China sales of Model 3 more than triple in May    ** PG&E Corp : down 0.7% premarket  BUZZ-Shares drop on planned equity raises    ** Evofem Biosciences Inc : up 6.9% premarket  BUZZ-Piper Sandler see promise in contraceptive drug    ** Seagate Technology Plc : up 1.1% premarket  BUZZ-Rosenblatt starts with 'buy' on storage demand growth    ** Freeport-McMoRan Inc : up 2.8% premarket  BUZZ-Copper to gain as trends signal demand surge - Jefferies    ** American Airlines Group Inc : up 7.0% premarket  ** Carnival corp : up 18.2% premarket  ** Wynn Resorts Ltd : up 3.6% premarket  BUZZ-U.S. airlines, cruise stocks jump on faster economic recovery hopes    ** Dunkin' Brands Group Inc : up 5.3% premarket  BUZZ-KeyBanc sees improving sales as U.S. states reopen; upgrades    ** Sundial Growers Inc : up 12.2% premarket  BUZZ-Gains after debt swap with creditors    ** NXP Semiconductors : up 3.2% premarket  BUZZ-Evercore raises to 'outperform' on automotive demand recovery    ** Opiant Pharmaceuticals : down 33.3% premarket  ** Emergent BioSolutions : down 12.0% premarket  BUZZ-Down after Teva wins patent dispute (Compiled by Shivani Kumaresan in Bengaluru)(( ; +1 646 223 8780;))The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["  confirmed on Thursday that it has acquired virtual-reality (VR) specialist NextVR. The  start-up created a platform that broadcasts live and recorded events -- including concerts and sports -- to VR headsets.  The move comes just weeks after .The iPhone maker didn't disclose the terms of the deal, but issued a boilerplate statement confirming the acquisition, saying, \"Apple buys smaller technology companies from time to time, and we generally do not discuss our purpose or plans.\" At the same time, NextVR's website announced \"NextVR is heading in a new direction.\"  The deal is reportedly valued at about $100 million. Image source: Getty Images.NextVR boasts a laundry list of high-profile partnerships with professional sports and entertainment organizations, including  ,  ,    Sports, the National Basketball Association (NBA),  and the National Hockey League (NHL), among others. In addition to its platform, NextVR boasts a treasure trove of patents -- more than 40 in all -- for a process that upscales high-quality video streams for upload to VR headsets. Apple has made no secret of its aspirations in augmented reality (AR) and VR, and there have been rumors of an under-the-radar research segment with hundreds of its employees working on ways to incorporate the technology into its future product lines.The company's ambitions have been on full display in recent months. During its , Apple announced that it launched a new iPad Pro that featured a \"a first-in-class LiDAR [Light Detection and Ranging] scanner with some really exciting augmented reality applications.\" This is similar to the the technology used in self-driving cars, sending out pulsed beams of laser light to measure the distance to nearby objects.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Apple wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["New York State Attorney General Letitia James wants to see some money change hands. James recently called on cable and satellite companies to slash their customers' bills to reflect the fact that COVID-19 has eliminated virtually all live TV sporting events. James has a point, because there's a fair bit of money involved here: As tech industry competitors have played pied piper to fans of movies and TV shows, the legacy pay-TV (cable and satellite) business has become . Sports account for a huge chunk of the typical customer's pay-TV bill, and right now that money is being paid by subscribers in return for almost nothing at all.But this is a complicated issue. Will there be refunds? If so, how will they work? This is about more than just sports leagues and fans -- it's also about pay-TV companies like  ,  , and  , as well as sports networks like 's  ESPN, Comcast's NBC Sports Network, and 's   FS1, as well as regional networks owned by these companies and others.Image source: Getty Images.Pay-TV services lose content from time to time for various reasons. Events get canceled, shows go off the air, and carriage disputes can lead to whole networks going dark. What makes the current situation such a big deal are two things: First, the scale of this crisis means that virtually all major sporting events are being lost at once (sports fans got a live NFL draft broadcast, but they're missing MLB, NBA, and NHL games). Second, sports broadcast rights are really, really expensive.Subscription video on demand (SVOD) services like Netflix and its entertainment- and  peers are the most popular sort of streaming service in the cord-cutting era, and such services don't have live sports (or live anything, for that matter). What's more, sports fans tend to watch sporting events live, which means that sports are fairly \"DVR-proof\" and very appealing to advertisers. As a result, sports have become critical to pay-TV networks. As of 2017, ESPN was getting around $7 out of a typical customer's cable bill (and that was just the one network -- ESPN 2 and the rest of the gang accounted for another couple of bucks).ESPN's rates went up from their 2011 levels to meet that 2017 measurement, and the rising prices reflect the growing importance of sports to the networks. But while high prices are certainly good for ESPN, the value of sports also means that networks like ESPN and FS1 are turning around and paying sports leagues big bucks for the broadcast rights that help drive their own high prices. Those broadcast rights are pricey and getting pricier. League TV deals  (one deal, between MLB and Fox, is already done and matches the predicted trend). And this is happening despite the fact that the leagues in question are currently not playing any games.This is the part of the equation where at least a little wiggle room can be found. Networks are not expecting full refunds, and they'll be paying sports organizations whether or not the games take place. But they likely won't pay the full amount. For example, the cancellation of March Madness led to some complicated financial fallout and made the fine print of   and Turner Sports' huge contract with the NCAA newly relevant (Turner Sports is owned by AT&T's WarnerMedia). Even putting aside any potential changes in the contract that the parties may yet agree to, the contract as written reportedly includes some details that would save CBS and Turner Sports at least a little. Still, the companies appear to be on the hook for the bulk of the roughly $800 million that the contract costs each year.So the leagues get paid by the networks, whether there are sports or not. The networks get paid by the pay-TV companies. And the pay-TV companies tend to pass on this expense to their subscribers. The average ESPN price of around $7 per month reflects a portion of a bill that the pay-TV company's end user is paying. And getting bundles without sports is typically tough for subscribers to do -- the non-sports fans among cable and satellite customers are helping to subsidize the things the sports fans watch.Now that sports are all but off the air, it's not just non-sports fans who are wondering why sports channels are so darn pricey.James' call for pay-TV providers to reimburse customers makes some sense. Pay-TV customers are paying top dollar for sports content that they simply aren't receiving. But we're a few steps away from any refunds to end users. The very pay-TV providers that James is calling upon for refunds are, as of this writing, not enjoying any unusual income from the sports situation. They're still charging the usual prices, but they're saving relatively little on affiliate fees.If cable and satellite companies offer rebates to customers without getting rebates from sports networks, they will of course lose money. On the other hand, if cable and satellite companies facilitate a chain reaction of refunds from sports networks to customers, they'll make customers happy at sports networks' expense. It's easy to see why Altice USA CEO Dexter Goei would say that he and Altice are \"in complete agreement with the New York AG.\" (Goel made the comments on .) Saying that Altice is in discussions with sports networks regarding possible rebates on affiliate fees, Goei expressed optimism that some sort of rebate would be coming down the pike.  executive Erin McPherson has echoed that sentiment. \"We don't want to charge our customers for content they aren't watching and receiving,\" .But what about the sports networks? Like the pay-TV providers, they aren't necessarily pocketing much extra money thanks to this crisis. While some things may have changed (incentive-based payments, for example, would be unreachable without broadcasts), the sports networks are still paying the leagues for broadcast rights to sporting events that don't exist. So the sports networks, too, have to seek relief in order to give it. Comcast -- which is both a pay-TV provider and the owner of NBC Sports, which has sports broadcast contracts with (among other entities) the NHL -- is reportedly working on deals to get relief on its very real payments for non-existent sports. Other networks are, too.But these discussions will presumably hinge not only on what the leagues are able or willing to offer, but also on when, if, and how the sports leagues will return. If sports are back soon, this problem will shrink fast. If months and months more are lost, then the problem -- and the negotiations -- will only grow stickier.Altice's Goei, along with others, is confident that Altice will be able to hammer out a deal that delivers some amount of relief to customers. But consumers shouldn't hold their breath for a big bailout. There are a few degrees of separation between end users and the leagues that were supposed to be providing these live TV sporting events. And the leagues have financial concerns of their own -- TV money goes to players and other employees, after all. (Some reports suggest that the financial situations of teams and leagues as pretty dire, but some experts are quick to point out that team owners have a long-standing history of painting misleading pictures of their finances in the context of labor disputes and government subsidies -- both of which are in play during this crisis.) The complex situation seems likely to result in some kind of rebate to customers, but it would be pretty surprising if the process somehow led to a refund or rebate worth anything near the amount that legacy pay-TV customers pay each month for sports content.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Comcast wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["  outperformed a surging stock market last month. Shares rose 13% in May compared with a 4.5% increase in the  according to data provided by .The increase pared some of the media giant's recent losses, but the stock is still down 17% so far in 2020.Image source: Getty Images.Investors were pleased with Fox's fiscal third-quarter earnings report, which came out on May 6. In that announcement, the company revealed a , mainly due to its airing of the Super Bowl in early February. Affiliate revenue and advertising sales jumped, and adjusted earnings improved to $920 million from $766 million a year ago.Fox's report only covered the period that ended on March 31, which leaves most of the COVID-19 impact for the fiscal fourth quarter and beyond. Executives said that so far, advertising revenue and ratings have declined due to the cancellation of many sporting events. Those figures should rebound quickly for the , though, assuming organizations like the NFL and NCAA proceed with their football seasons as usual.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Fox Corporation wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["It was a quiet morning until Federal Reserve Chairman Jerome Powell gave a midday speech about the economy. After his comments, most stocks headed lower, including top media companies. Shares of   finished down 8%,  was down 3% for both Class A and Class B shares, and the stock of   was down 5%.For media companies with pay-TV services, a lot of revenue is generated from advertising. And in a weak economy, there's less ad spending to go around.Advertisers are reportedly cutting back on spending. Image source: Getty Images.Powell's speech included how hard the economy is being hit by the COVID-19 pandemic, and suggested more action from both the Federal Reserve and the U.S. government is needed. His realistic tone rattled investors and sent the market averages sharply down.So how did Powell's speech stoke fears toward  specifically? Consider that both ViacomCBS and Fox have a large presence in TV broadcasting, and broadcasts run on ad dollars. That's a problem. The coronavirus-induced economic slowdown already has advertisers considering  of $1 billion to $1.5 billion. There's no point spending money targeting consumers stuck at home.Then there's the issue of sports. ViacomCBS lost crucial ad dollars with the cancellation of important events. But for Fox, the most important sports are the NFL and college football. Those sports haven't started yet, and therefore Fox hasn't lost that advertising revenue. Upon sharing this with investors last week, . However, the longer the coronavirus drags on, the more real the possibility that football will be canceled, which would hurt Fox.Eros International isn't the broadcasting empire that Fox and ViacomCBS are. Rather it's the top video-on-demand platform in India. It offers both a subscription package and an ad-supported free version. Even these could be hurt in an economic downturn. In a bad economy, fewer people would spend on discretionary items like subscription services. That could push users toward the free ad-supported version. And if advertisers cut back on spending, it's a double whammy.  data by It's important to keep today's drop in perspective. Wall Street is volatile. Consider how much returns differ based on investors' starting point.Chart by author.These companies' stocks have appreciated quite a bit since April 1, so a small pullback at some point was expected. And in a volatile market like this, the smallest sliver of news can send a stock sharply higher or lower in daily trading. Today it was lower.As challenging as it is, investors should try to block out the daily noise and extend their time horizon. When it comes to media stocks, the more I extend my vision, the more I believe media will be consumed on demand. In that light, ad spending on linear TV will increasingly fall, with or without the coronavirus. All of these companies are transitioning toward streaming in some way. But I find ViacomCBS the most intriguing of the three right now. In the first quarter of 2020, its domestic streaming and digital video revenue was up 51%; customers were up 50% to 13.5 million. That's still a small portion of the U.S. population and could provide strong upside if the growth momentum continues in coming quarters. It also sports a reasonable valuation and (for now) a .ViacomCBS is a company I've added to my watch list. But investors need to take more into consideration than just the factors I've presented.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and ViacomCBS Inc wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Fox Corporation (FOX) announced earnings for third quarter that dropped from the same period last year.The company's profit totaled $78 million, or $0.13 per share.  This compares with $529 million, or $0.85 per share, in last year's third quarter.Excluding items, Fox Corporation reported adjusted earnings of $568 million or $0.93 per share for the period. Analysts had expected the company to earn $0.71\t per share, according to figures compiled by Thomson Reuters. Analysts' estimates typically exclude special items.The company's revenue for the quarter rose 25.1% to $3.44 billion from $2.75 billion last year.Fox Corporation earnings at a glance:-Earnings (Q3): $568 Mln. vs. $471 Mln. last year.\n-EPS (Q3): $0.93 vs. $0.76 last year.\n-Analysts Estimate: $0.71\t\n-Revenue (Q3): $3.44 Bln vs. $2.75 Bln last year.\n The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Shares of   headed higher on Thursday after the company showed its business is holding up well during the COVID-19 pandemic. Both its Class A shares and Class B shares were 9% higher during early trading, before fading later in the session.What might be most surprising for investors is Fox's ad revenue, which in the third quarter of fiscal 2020 grew a whopping 44% year over year.Image source: Getty Images.The coronavirus has affected consumer spending, which makes companies cut their advertising budgets. Consider that competitor 's advertising revenue only increased 2% in its most recent quarter, even after accounting for the impact from lost sporting events. By contrast, Fox saw incredible growth.There are two big reasons for Fox's strong quarter. First, Fox News was already incredibly popular among viewers. But in Q3, its viewership among adults age 25 to 54 nearly doubled. That's a desirable target demographic, and advertisers spent their money on Fox, where the eyeballs were. Second, 40% of Fox's ad revenue comes from live sports. Companies like ViacomCBS were hurt because sporting events were canceled. But the bulk of Fox's sports revenue comes from the NFL and college football, two sports that haven't started yet. Had the COVID-19 outbreak occurred during the fall rather than the spring, this could have been a very different story.All told, Fox Corporation's total quarterly revenue grew 25% year over year to $3.4 billion, while delivering  of $0.93 per share. The adjusted number accounts for one-time expenses related to its now- in .Right now, college football and the NFL are planning for normal seasons. But if COVID-19 flares up again and cancels fall sports, that would be a blow to Fox Corporation's advertising revenue. It's worth keeping tabs on.As it is, next quarter will have more challenges for Fox. In particular, its local news partners are feeling the effects of reduced advertising spending. At the current pace, management expects local-news ad revenue to be down 50% in the upcoming fourth quarter. Fortunately for Fox, it is a diversified , helping it weather the storm. But the decline in ad revenue will still be a real near-term headwind.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Fox Corporation (A Shares) wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["It's been a rough couple of months for professional sports. Reacting to the COVID-19 crisis, pro sports leagues in the United States (and across the world) . But there's a spot of good news for the sports industry this month: Prices for sports broadcast rights are expected to rise in the coming years.Sports broadcast rights have been on the rise for some time now, but continuing that trajectory against such historic headwinds is remarkable. That sports would continue to grow in value even as they disappear from TV during the COVID-19 crisis is a reminder of just how important sports are to pay-TV bundles. It's also something that could have consequences for the pay-TV and streaming industries.Image source: Getty ImagesSports broadcast rights have always been valuable, but things really began to take off for pro sports leagues as new technologies arrived to change the ways in which viewers consume TV. The DVR, pioneered by companies like  , allowed consumers to time-shift content viewing and, more importantly, fast-forward through commercials. DVRs allow viewers to turn live TV into on-demand content. On-demand content is also, of course, available from subscription video-on-demand (SVOD) services like  . The arrival of the streaming revolution allowed viewers to swap commercial-filled live TV for on-demand, commercial-free content. (Some SVOD services, like 's  Hulu, have commercials of their own, but that doesn't do much good for the legacy pay-TV companies that are losing ground to SVOD competitors.)On these shifting sands, sports were quickly identified as a spot of firm ground for pay-TV companies and their advertisers. Unlike most other forms of TV content, sports are closely tied to the live viewing experience. Most sports fans don't \"DVR\" their sports for later; they watch them live if they watch them at all. On top of that, sports have long been tougher to get through streaming services. Some leagues have their own services (like baseball's MLB.TV or basketball's NBA League Pass, for example), but prices tend to be high, and regional blackouts abound. By and large, sports are things that are hard to stream, easy to find on legacy pay-TV, and preferably consumed live on channels like Disney's ESPN, 's   FS1, and 's  NBCSN.This unique cocktail so much so that some have speculated that sports rights are a \"bubble\" due to pop. If there was ever a time for popping, now is that time.Right now, sports aren't on TV. The NBA and NHL have suspended their seasons. MLB's season never started. The NFL is in its off-season, but even it didn't escape COVID-19-related issues: The NFL draft, usually a big event with a live audience, became a virtual event. That event, at least, made it to TV on Disney's ABC and ESPN, but it is one of a very few live sports-related programs still making it to broadcast.The industry seems to view the current problems as temporary and surmountable. Broadcast rights fees are likely to keep going up, sometimes by quite a bit, according to an analysis by MoffettNathanson.New rights deals are on the way. The NHL's new contract will begin in 2021, and new deals on MLB and NFL broadcasts will start in 2022. These deals should be worth significantly more to sports leagues annually than are the deals being replaced, according to MoffettNathanson's analysis. An already announced deal between MLB and Fox, good through the 2028 season and reportedly worth more than $5 billion, appears to match the trend that MoffettNathanson predicts.Percent increase in annual average valueNote: All percentages and values are projected except for MLB's deal with Fox. Source: MoffettNathanson There's a common-sense aspect to this: Assuming that this crisis ends in something resembling business-as-usual, one might reasonably assume that sports will remain valuable to pay-TV providers for all of the reasons that they were before. But there are other dimensions to this, too.Sports will surely be back, but will fans? Sports leagues try to avoid lockouts and strikes not just because of the huge immediate losses, but also because the perception within the industry is that fans who are denied their sports for a significant period of time may be less likely to return. These fears haven't always been borne out in pasts strikes and lockouts. For instance, attendance actually rose in some markets in the 2005-06 NHL season that followed the infamous 2004-05 lockout. Still, a popular perception persists that the 2004-05 lockout did lasting harm to the league. Will a lost season across the board do harm to sports as a whole?There are other reasons to keep an eye on sports broadcast rights growth, whether we think it's a \"bubble\" or not. For one thing, sports prices have the potential to actually accelerate the very cord-cutting that sports are supposedly helping pay-TV companies combat.Image source: Getty ImagesFee increases of the sort predicted by MoffettNathanson could be high enough to push up prices of the channels that buy them and, in turn, the cost of pay-TV bundles. Sports fans are important customers in the pay-TV space, but by embracing these sports fans too much, pay-TV companies may be pushing non-sports fans out the door toward 's SVOD competition. A customer who wants to watch movies and sitcoms instead of sports might reasonably ask why they are being asked to subsidize sports fans' passions by paying for a bundle that includes sports channels, which often cost pay-TV carriers double or triple what other channels do. The problem is illustrated by Philo, a private company that offers a streaming live TV \"skinny bundle\" with no sports (or news) and manages to offer a nearly 60-channel bundle of brand-name networks like AMC and Comedy Central for a mere $20 per month. For reference, one analysis found that ESPN costs customers an average of $18.55 per month .And while Philo is the main sports-free option, it's not the only \"skinny bundle.\" There are plenty of non-cable and satellite live TV options for those who  like sports, too. 's  Sling TV, 's   YouTube TV, and others still threaten pay TV, regardless of how much fans love sports. Of course, these services still have to find a way to get channels like ESPN and FS1 into their bundles while those networks grow more expensive.A more intriguing streaming threat may come from direct-to-consumer options. Sports leagues themselves are getting better at streaming. Recent years have seen league-streaming services like MLB.TV and NBA League Pass unveil single-team bundles with lower prices -- a better fit for casual fans of specific teams and for budget-minded consumers who might not have liked the eye-popping prices that full-season, full-league packages often command. Meanwhile, MLB's streaming-rights situation looks very different now than it did a year ago.  There may soon come a day when Bronx fans can watch the Yankees on  , which would be bad news for legacy pay-TV companies. And it's worth remembering that the biggest sports network of all, Disney's ESPN, has long threatened to go direct-to-consumer -- .Sports rights may be valuable, but they are also complicated. When sports cost more, so do channels, and so, most likely, does pay TV. Rising prices that push up bundle prices could push even more non-sports fans away from pay TV, which will only make legacy pay TV still more reliant on live sports and, therefore, more vulnerable to threats like streaming-sports alternatives and problems with the sports business as a whole. There aren't many better options for companies in the pay-TV business, though, so there's every reason to expect new high-priced sports deals to go through as predicted, even as dangers loom.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now… and Walt Disney wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Shares of media giant    were falling today as investors processed more bad news stemming from the coronavirus pandemic. The broader stock market was reeling from the latest unemployment figures released today, and Fox's stock took a hit along with it.Fox Corporation's stock was down 8% as of 11:41 a.m. EDT.Image source: Getty Images.Fox's shares, like many other companies', have been volatile over the past two months. The company's stock price is down nearly 19% since the beginning of March, far more than the broader S&P 500's 6% dip.Fox Corporation's share price drop today likely stems from the latest U.S. jobless claims figures released this morning, which showed that an additional 3.8 million workers filed for unemployment benefits. This brings the total number of unemployment claims to 30 million over the past six weeks.Fox's media empire isn't immune to overall economic weakness. With live sports nonexistent right now because of COVID-19, the company won't be able to sell advertising time during sporting events. can likely expect more volatility from Fox's stock over the coming weeks. The company will report its third-quarter 2020 results on May 6 and said in an SEC filing at the end of March that the COVID-19 pandemic will have a \"material adverse effect\" on the company's financial results.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Fox Corporation wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Looking at the underlying holdings of the ETFs in our coverage universe at , we have compared the trading price of each holding against the average analyst 12-month forward target price, and computed the weighted average implied analyst target price for the ETF itself. \tFor the Vanguard Mega Cap ETF (Symbol: MGC), we found that the implied analyst target price for the ETF based upon its underlying holdings is $113.42 per unit.\n\n\nWith MGC trading at a recent price near $103.37 per unit, that means that analysts see 9.72% upside for this ETF looking through to the average analyst targets of the underlying holdings.   Three of MGC's underlying holdings with notable upside to their analyst target prices are Fox Corp (Symbol: FOX), Simon Property Group, Inc. (Symbol: SPG), and General Electric Co (Symbol: GE). Although FOX has traded at a recent price of $27.95/share, the average analyst target is 71.74% higher at $48.00/share. Similarly, SPG has 58.43% upside from the recent share price of $68.80 if the average analyst target price of $109.00/share is reached, and analysts on average are expecting GE to reach a target price of $9.55/share, which is 45.14% above the recent price of $6.58. Below is a twelve month price history chart comparing the stock performance of FOX, SPG, and GE:  \n\n   Below is a summary table of the current analyst target prices discussed above:\n\nAre analysts justified in these targets, or overly optimistic about where these stocks will be trading 12 months from now? Do the analysts have a valid justification for their targets, or are they behind the curve on recent company and industry developments? A high price target relative to a stock's trading price can reflect optimism about the future, but can also be a precursor to target price downgrades if the targets were a relic of the past. These are questions that require further investor research.  \n\n\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Blu-ray discs may be the dominant form of physical home media in the movie and TV world, but they aren't enjoying quite the same kind of run that their DVD predecessors did. In fact, DVD sales actually still outpace Blu-ray sales, and sales of both formats combined fell by nearly half from 2014 to 2015. Today, many customers turn to alternatives that don't require them to own physical copies in any format. 's  Amazon Video, 's iTunes, 's Google Play Video, and other digital media marketplaces offer digital sales and rentals of movies and TV shows, and they've been very successful. Home entertainment revenue is actually up despite the plunge in sales of physical media, because digital marketplaces have more than made up the difference. aren't the only ones competing in this space, though.   bought digital marketplace Vudu in 2010. And 's  Fandango is also in this space with a digital video rental and purchase marketplace called FandangoNow. Though the tech companies have some advantages, at least one of their competitors is working hard to catch up. Fandango announced last week that it will acquire Walmart's Vudu, effectively neutralizing a threat to FandangoNow and consolidating the resistance to the big tech's major marketplaces.Image source: Getty ImagesVudu has never been as dominant as its tech-backed competitors, and it's not that hard to imagine why. Many of Vudu's competitors enjoy the distinct advantage of being owned by the very same tech companies that make streaming devices and maintain streaming platforms. Amazon's Amazon Video rental and purchase service is built right into its Fire TV platform -- users don't even have to select an app to get to the marketplace, because it's integrated into the main menus in the Fire TV platform. Fire TV has more than 40 million users, which is a pretty big head start. Google Play Video is, of course, a default app on the Android TV platform, which is built into some brands of smart TVs and is available on devices like 's NVIDIA Shield and . Users of Apple TV devices (which run Apple's tvOS) find iTunes' digital marketplace readily available via the Apple TV app. Of course, tech's situation is not totally static, and not all tech platforms are flourishing -- iTunes, one of the first in this space, was dominant in the early 2010s and has since lost its lead.FandangoNow has managed to even the playing field a bit with a deal that puts it on   devices. FandangoNow is built into the Roku platform in the form of the \"Movie Store by Fandango\" and \"TV Store by Fandango,\" each of which is available on Roku's main menu, off to the side of the app icons. , but FandangoNow's position on the platform isn't quite the same as the ones its tech competitors enjoy on their parent company's platforms. Fire TV users log in with their Amazon accounts, so there's no extra login process to worry about when it comes time to rent or buy media. With FandangoNow on Roku, users still have to create a separate account. The process is made easier, at least, by the fact that the billing is done through users' Roku accounts.It's important to remember that Comcast also has a share in video rentals in the form of on-demand content and digital copies purchased through the set-top boxes that Comcast pay-TV customers use. Comcast added the option to purchase digital media (rather than just rent it as on-demand content) and surged to a 15% market share in 2017. But the cord-cutting trend is bad news for on-demand offerings tied to Comcast's set-top boxes, which is part of why Fandango's digital media business is important.Buying Vudu makes a lot of sense for Fandango. According to Walmart, Vudu has been installed on 100 million devices, including more than 14 million downloads on mobile devices. Vudu is a significant player in the digital video rental and sales space, and it also offers a free, ad-supported video-on-demand (AVOD) service similar to the ones that have been so successful for companies like Amazon and Roku -- though Walmart  translating that platform into the sorts of ad sales that have flowed to those other companies.By buying Vudu, Fandango removes the service as a competitor and consolidates the competition to the tech giants' video marketplaces. Vudu's AVOD service could patch a hole in Fandango's streaming offerings and give the company something to tempt fans of free streaming services like Tubi and 's Crackle, as well as advertisers who might otherwise turn to competitors. (Fandango's parent company, Comcast, has a new AVOD service of its own in the form of subsidiary NBCUniversal's Peacock, but  that Vudu's AVOD service will \"complement\" Peacock's.)This deal is coming in the midst of an international crisis that is driving up streaming in a customer base that is now largely stuck at home. The \"stay-at-home streaming boom\" helps explain why Comcast acted now. As for Walmart's part in the decision, that comes as no surprise; the company has reportedly been weighing a sale of Vudu for at least a few months now. Changing circumstances may just have pushed Comcast toward a deal that Walmart had already wanted to make.The current crisis doesn't just make Fandango's streaming side more important; it's also actively hurting the other, larger part of Fandango's business, which is movie theater ticket sales. Fandango wants to scale up its home media side to match its massive presence in movie theater ticket sales, and that would certainly be a nice thing for the company to be able to pull off at a moment when movie ticket sales have plunged to their lowest point in 20 years.And there's yet another reason this timing makes sense: the   is , a company that offers an AVOD service much like Vudu's version. With Peacock in the midst of a \"soft launch,\" it makes sense for Comcast to move to strengthen its budding AVOD business against a competitor by making this acquisition (and if this move drives up Tubi's asking price and costs Fox money, then so much the better for Comcast).Fandango's home media marketplace holdings now look more impressive and more ready to battle the competitors that the tech giants own. And since consolidation among those tech giants is very unlikely, Fandango can count on a fairer fight going forward. But Fandango will still have to find a way to make it in a market that rewards integration, like Amazon's Fire TV/Amazon Video synergy, and it will need to solve whatever problems caused Walmart to fare worse in AVOD ad sales than other companies have. The real work is still getting started.{%sfr%}When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Comcast wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Media giant   saw its shares head higher on Tuesday after analyst Kutgun Maral of RBC Capital initiated coverage of the stock with a buy rating. It appears that in the 30% broad market rally from March lows, investors are still looking for undervalued stock ideas.Shares finished 4% higher on the day, and have now recovered 41% from lows hit last month.Image source: Getty Images.Fox Corporation generates revenue through advertising and affiliate fees across its cable programs and television networks. The problem is that Fox's audience is increasingly cutting the cord, opting for on-demand streaming video instead. It still has valuable content, like live sports, but some of that content is in question because of COVID-19. That may make it hard to attract advertisers, a near-term risk that Maral acknowledges.However, Maral likes Fox's strong balance sheet and free-cash-flow generation. Given what he sees, he slapped the stock with an outperform rating and gave it a price target of $31 per share. At the time, Fox traded around $26, implying 19% upside. That would imply that Fox is a  at these prices.Regarding the balance sheet, Fox is in a better position than some. At the end of the second quarter of fiscal 2020, it had around $2 billion in cash and cash equivalents on the balance sheet, and around $8 billion in noncurrent liabilities. Subsequent to Q2, the company made moves such as acquiring streaming platform Tubi and offering $600 million in senior notes, meaning these numbers are slightly different now. I'm not sure I'd necessarily call the balance sheet \"strong,\" but Fox is certainly very liquid in this time of economic uncertainty.Additionally, Fox is a profitable business. While Maral likes free cash flow, I prefer to look at net earnings by generally accepted accounting principles (). Through the first two quarters of fiscal 2020, Fox has earned $827 million. Some of that was from investment gains, but even subtracting those one-time items, it was profitable. Those earnings mean Fox trades below 10 times trailing earnings, which does indeed look cheap.In the end, one analyst opinion doesn't make or break a long-term investing thesis. Investors need to assess Fox's plan to stay relevant as consumer demand shifts toward streaming (the Tubi acquisition is relevant). While shares may still have some upside this year, the company needs to guard against being left behind.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Fox Corporation (A Shares) wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Shares of   were climbing higher on Friday after announcing a new partnership with   in India, strengthening its leadership position in the country. As of 1:00 p.m. EST, the stock was up 8%. But it had traded 18% higher at one point.The Visa partnership is the only news specific to Eros explaining the stock's move. However, it's possible investors are sending the stock higher due to strong results from other media companies this week.Image source: Getty Images.Eros International offers a top streaming service in India called Eros Now. With its new partnership, Visa cardholders in India can subscribe to Eros Now for half the regular price. The platform had 26.2 million paying subscribers as of the third quarter of fiscal 2020. Considering India's population is over 1.3 billion, there's still plenty of room for growth in its home market.The Visa partnership with its more attractive pricing could accelerate subscriber growth, which would be good for Eros International.However, investors may simply be rewarding Eros International stock due to earnings reports from other . Both  and  traded higher this week after beating Wall Street's earnings expectations. When multiple companies in the same industry report encouraging results, it can sometimes change investors' perspective, lifting all related stocks.While it's not uncommon to see related tickers rise, it's not relevant for long-term investors. After all, each company's results will be distinct. That said, reviewing results from competitors can be helpful in understanding business and consumer trends. The meatier news for Eros International investors is the Visa partnership. Financial terms of the agreement weren't given. But this could potentially lower customer acquisition costs for Eros Now and drive subscriber growth. Both factors would boost profitability, which is very relevant when you're buying and holding for the long haul.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Eros International wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["The  has disrupted the world in a way that we have never seen before. Given the many unknowns from its spread, governments had no choice but to shut down borders, close businesses and order everyday citizens to stay at home. If it were not for the Federal Reserves’ actions in boosting liquidity, the stock market would have fallen more. Still, the pandemic paused many sectors of the economy. One segment that is still likely growing its audience is the media space. By extension, media stocks may recover.People need to watch the news to know the status of the pandemic daily. There are seven media stocks whose online and television audience levels will likely increase as the pandemic plays out. The companies include:These firms offer streaming content that will keep their viewers distracted while at home. Some of these companies run television channels that supply timely news about the virus. And after the bear market started over a month ago, these stocks are all trading at sharp discounts from their 52-week high. In the case of AT&T and Charter, mobile data and voice usage will increase. Demand for cable internet bandwidth will increase, too. That is because all that online activity in offices now occurs at home. With the viewership on an uptrend likely to continue in the near-term, what returns should investors expect from these media stocks?Source: Todd A. Merport / Shutterstock.com\n\tComcast owns NBCUniversal. Before the lockdown in the U.S., NBC News broke the record with the  debate ever. And even though February feels like an eternity ago, its  gets many coronavirus update posts that bring in nearly a million views.Comcast will not earn advertising revenue from the Olympics now that it is delayed until next year. That loss is only temporary: the company will book such revenue later. Conversely, CMCSA stock is down in 2020 as it discounts lost advertising revenue. This is in stark contrast to 2019 results, in which the company  free cash flow of $13.4 billion. It also raised its dividend by 8 cents to 92 cents.Last year, NBCUniversal reported an adjusted EBITDA of $833 million, up 13.5%. It achieved its third most profitable year in its history, and NBC’s lower advertising revenue in 2020 will prove temporary. Eventually, businesses will slowly open again and will resume ad spending on the network.With the stay-at-home order in effect, Comcast’s cable internet demand should grow. In the fourth quarter, it added 372,000 customers. Cable communications revenue grew 2.6% to $14.8 billion. In the current quarter, the company may report growth in these services as the consumption of content at home increases.In a 5-year discounted cash flow model, assume that revenue grows by at least 1% annually. Further with the following assumptions below, CMCSA stock has a fair value of ~$41.Data courtesy of Source: nikkimeel / Shutterstock.com\n\tDisney Television owns sports channels ESPN and ABC. Although many major sports events are canceled, hurting ESPN revenue, Disney’s ABC channel will thrive at this time. For the week of March 23-29, NBC was in second place. The  in an average of 4.72 million viewers. Some of the most-watched shows include Chicago Med, The Voice and the drama Council of Dads.In the movie space, Disney’s film release schedule will get delayed. This will hurt short-term revenues for the quarter. But if movie theaters re-open later on, the company should have some box-office hits in the books. For example, Mulan is a live-action film that may open in theaters on July 24. Black Widow is  for release on Nov. 6. Long-term investors holding DIS stock will get rewarded in 2022. Captain Marvel 2 will be released on Jul. 8, 2022. And Black Panther 2 will play on May 6, 2022.Investors should not forget that Disney+, a streaming service costing , attracted strong viewership thanks to The Mandalorian. When it releases the second season, the company should expect an increase in Disney+ signups.Source: Leonard Zhukovsky / Shutterstock.com\n\tIn the second quarter,  second-quarter fiscal revenue growing 5% to $3.78 billion. The company benefited from higher affiliate revenue growth of 7%. Advertising revenue grew by 1%. Conversely, given the sharp drop in FOXA stock in the last few weeks, markets are signaling low expectations from advertising revenue. But the coronavirus pandemic will likely lead to a sharp increase in viewership for Fox News.In the last quarter, the company  the No. 1 position for the Fox Network and broadcast. It was also in the No. 1 position with Fox News. Management said that “our first half results illustrate the power and importance of our brands to our partners and audiences, validating our strategy to build Fox around live sports, live news and event programming.”Just as Disney’s ESPN will suffer from a lack of live sports, Fox may offset the drop in sports viewership with its news coverage. And when advertisers increase their spending, they will choose the Fox network because of the growing audience base.Source: Piotr Swat / Shutterstock.com\n\tA growing need for cable during such times will give Charter Communications a lift. In the fourth quarter, the adjusted EBITDA in the company cable unit grew 8.9% from last year.  grew from 26.3 million to 27.3 million. Mobile lines grew by 171,000 while residential internet users increased by 24,000. Both services will likely grow as consumer demand increases during the stay at home order.Charter’s advertising revenue, which fell 22.7% from last year, may continue falling. In Q4/2019, Charter had lower political revenue. Later on this year, this may bounce back as politicians resume their advertising spend.Charter’s disciplined capital deployment strategy, along with lower capital intensity, should push free cash flow growth higher. Improvements in its cable margin should give the current quarter a lift. The company said that its higher average revenue per user (ARPU) is sustainable. Thanks to its programming and good customer relationship, expect EBITDA to grow at a faster pace than its revenue growth.Source: Sattalat phukkum / Shutterstock.com\n\tDespite withdrawing its first-quarter guidance due to the , the microblogging giant is more important to society now than ever. The site enables users to post pandemic-related news in real-time.Operationally, Twitter said that first-quarter revenue will fall. It will also report a GAAP operating loss. Costs for improving the product will hurt near-term results, but are ultimately beneficial for all users. Already, Twitter has a monetizable daily active user (mDAU) of around 164 million. This is up from 134 million in the year-ago period.Twitter’s Chief Financial Officer said that “The COVID-19 impact began in Asia, and as it unfolded into a global pandemic, it has impacted Twitter’s advertising revenue globally more significantly in the last few weeks.” Investors should model lower revenue in the near-term, but growth later on this year. In this scenario, Twitter stock is worth at least $27 a share in a 5-year discounted cash flow revenue exit model ().Source: JHVEPhoto/Shutterstock.com\n\tA surge in streaming video, as a result of most people staying home, will give a lift to the Roku ecosystem. In the last few quarters, Roku benefited from consistently strong sales of Roku-powered flat-screen televisions. The firm had 32.3 million  up until Q3/2019. Chances are good that since March, Roku usage grew sharply.Consumers, hungry for television and movie content, likely switched Roku on. It also added  of free HBO shows, movies, and Sesame Street episodes. This benefits Roku in two ways. First, viewership will grow immediately, even though revenue may not. Second, user habits may change as consumers head to Roku to access the content. In the longer-term, a higher audience base will boost advertising revenue and subscription sales.Source: Jonathan Weiss/Shutterstock\n\tAT&T’s HBO video streaming service might get a lift after the company offered HBO NOW and . On the cable television front, coverage of the pandemic lifted the viewership for CNN. The channel  its primetime audience. For example, from March 16-20, CNN’s viewers per day almost doubled to 790,000.The telecom giant  an “uptick in kids, family and news viewership.” The company benefited from school closures as demand for kids entertainment increased. So, when schools eventually open again, viewership habits in the children age group may change to AT&T’s benefit. AT&T TV and DIRECTV offered movies like Frozen II and Spies Like Us that suited families. In the months ahead, it may tweak its programming to target a family audience.AT&T’s debt may give bears a reason to sell the stock. But after the Fed cut interest rates to 0%, the telecom giant may refinance its upcoming debt, lowering interest rate costs. Plus, with HBO’s growth ahead and a resumption in movie releases from Warner Bros., the company has strong long-term prospects.Chris Lau, contributing author for InvestorPlace.com and numerous other financial sites. Chris has over 20 years of investing experience in the stock market and runs the Do-It-Yourself Value Investing Marketplace on Seeking Alpha. He shares his stock picks so readers get original insight that helps improve investment returns. As of this writing, he did not hold a position in any of the aforementioned securities.The post  appeared first on .The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Anyone reading this already likely knows telco name   has struggled on the television front. The timing of its 2015 acquisition of DirecTV couldn't have been any unluckier, getting the company into the TV business right as the cord-cutting movement began.Several attempts at a streaming service -- first under the DirecTV brand and then rebranded as an AT&T product -- have fizzled, and while it's finally leveraging last year's WarnerMedia deal into a new streaming product called HBO Max, investors are nervous. At $14.99 per month, the service (when it launches in May) will be the highest-priced non-live streaming service available. It's a big gamble in an industry that's quickly turning into a commodity business.And there's the rub -- one of them anyway. AT&T remains relatively tone-deaf on the pricing front.The other rub? Packaging. There are simply too many ways to plug into AT&T's several television services, some free, and some not. Consumers are getting confused.Image source: Getty Images.Good news for most current HBO Now (WarnerMedia's streaming version of HBO) subscribers interested in seeing what HBO Max is all about: you'll be upgraded for free, provided you presently pay HBO directly. Everyone else will have to pony up the aforementioned $14.99 per month.New customers of AT&T TV will also gain free access to HBO for a year -- as well as new DirecTV customers -- which presumably qualifies them for one year of free HBO Max. 's  cable customers will enjoy HBO Max as well if they're already HBO customers through Charter's Spectrum.Now buckle up.Streaming service HBO Now (not to be confused with HBO Go) is another option, purchased a la carte at a price of $14.99 per month as well. Once HBO Max debuts, HBO Now subscribers will effectively become HBO Max customers. HBO Go is essentially a free version of HBO Now, but only accessible to cable customers who also subscribe to regular HBO through a traditional cable provider. Spectrum customers, of course, won't need it.And that's just the HBO franchise. Consumers looking for something a little wider in scope can sign up for AT&T TV, AT&T TV Now, or AT&T Watch TV. Those are the company's (respectively) cable TV equivalent, a combination of live and on-demand television that costs $55 per month, and a skinny cable bundle that sells for $15 per month. The basic version of AT&T TV Now no longer includes HBO, but for an extra $10 per month, customers can add it on.There's an  in the works too. No word yet on how it will be priced, though it could be free and/or bundled with AT&T TV.Oh yeah -- AT&T Unlimited Elite wireless users get free access to HBO, which again, presumably qualifies them for free HBO Max.That was an admittedly tedious (and somewhat exhausting) exercise. But, that's the point. AT&T may be confusing  with its \"throw spaghetti on the wall and see what sticks\" approach to streaming. It's hardly the only prospective misstep AT&T is taking with its television business, however. Pricing itself may also be problematic.The free access to AT&T Watch TV or any one of HBO's derivatives isn't actually free. Someone, somehow is paying for it. The company likely offered Charter wholesale-like pricing, and AT&T Unlimited Elite wireless customers are paying $50 per month for access to wireless and video services that cost money to support. The company may well reach its goal of , but that doesn't necessarily translate into 50 million subscribers' worth of additional revenue.Perhaps worse, when the word \"free\" becomes part of the equation, it can cheapen the perceived value of the service to those who might otherwise be willing to pay a premium.To that end, the price of HBO Max itself is another potential tripwire. One streaming service has to be the most expensive one, but AT&T is launching HBO Max after rivals have already established themselves.  is the market leader, with a lower starting price point.   has seen a great early start with Disney+, which . Subscribers can use Disney+, ESPN+, and Hulu combined for only $12.99 per month. In the meantime, entirely free, ad-supported streaming services like Tubi and Pluto TV are catching on quick. Tubi said in February -- before millions of people were trapped at home by COVID-19 and     -- it had already garnered 25 million regular viewers.Sure, AT&T has the option of bundling HBO/WarnerMedia content and AT&T's telecom offerings in a variety of ways. Just as a reminder though, the whole point of the DirecTV acquisition was to cross-sell and co-promote the company's different services. It hasn't helped. AT&T has been steadily losing DirecTV customers since 2016, and it's been bleeding streaming customers since 2018 despite the promotion of package deals. Consumers .Data source: . Chart by author.So what are the two simple details AT&T has to get right on the television front? Boiled down to their simplest form, pricing and packaging.AT&T's decision-makers continue to struggle with both, however, seemingly telling TV watchers what they should want and what they should be willing to pay rather than responding to what TV watchers have demonstrated they want and will pay.HBO Max may well end up being the highest quality on-demand service in the world. If consumers can't perceive that value in the midst of what's become a very crowded and competitive arena though, that quality is going to be irrelevant. Offering television choices in a confusing labyrinth of ways only further frustrates prospective customers.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and AT&T wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["\nIn early trading on Thursday, shares of Starbucks topped the list of the day's best performing components of the Nasdaq 100 index, trading up 4.5%.  Year to date, Starbucks has lost about 25.6% of its value.\n\nAnd the worst performing Nasdaq 100 component thus far on the day is Walgreens Boots Alliance, trading down 6.9%.  Walgreens Boots Alliance is lower by about 32.1% looking at the year to date performance.\n\nTwo other components making moves today are Splunk, trading down 3.9%, and Fox, trading up 3.4% on the day.\n\n\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["By some measures, the global coronavirus outbreak couldn't have been more devastating for  . The parent company to a movie studio and theme park name Universal, a wide swath of its business has been put on hold, and its NBC unit continues to face a cord-cutting headwind along with a pandemic-induced slowdown in advertising buys. On the flipside, stay-at-home (and work-at-home) mandates may have cemented its broadband business in place with consumers, while a depressed economy could make cheap entertainment like its upcoming Peacock streaming service a smash hit.Plenty of rough patches are sure to lie ahead. But, for the same reasons Comcast was a healthy addition to portfolios before the  raced out of control, the stock's even more of a buy now.Image source: Getty Images.It's regarded as a cable television name, but pay-TV is not a huge chunk of what Comcast does these days. Linear TV service only accounted for about one-fifth of last year's total revenue, while network TV only made up roughly another one-fifth of its business. The other 60% of the top line consisted of movies, amusement parks, broadband service, and Sky's direct-to-consumer operation.How the revenue mix is changing over time is particularly noteworthy, perhaps now more than ever.Data source: . Chart by author.Yes, traditional television and the cable lines that pipe it into  are under attack from all directions.   may have led the charge, but it's not alone on the streaming front anymore. NBC's fate largely reflects that of cable television itself. Comcast arguably took too long to recognize and respond to that reality.Comcast is responding now though, in spades.The short version of a long story: Comcast is no longer prioritizing the growth of its cable and video entertainment ventures . It still intends to offer cable service, as well as fuel its NBC network. But, ever since Comcast's CFO Mike Cavanagh commented last year that the company \",\" it's been true to his word.The organization has instead prioritized investments in its broadband infrastructure for 2020 because, as it turns out, that's a . Consumers may subscribe to multiple streaming services as well as multiple video conferencing tools, and they can buy such services from a number of players. Their high-speed internet connections ultimately power them all, often without a second thought from consumers.Comcast isn't just backing away from an all-out effort to keep its cable TV and network businesses thriving. It's embracing the very thing working against each.Yes, that's streaming video. The company announced last year it would launch a relatively robust stand-alone option in 2020. We've learned since then it's going to be called Peacock, but more than that, we've learned there's going to be a completely free, ad-supported version of the service that can draw on Universal's and NBC's deep library of content. As fellow Fool Danny Vena pointed out earlier this year, the lowest, least expensive tier of the platform will offer around  when it goes live for all consumers in July. Other, more expensive tiers will offer more and newer content.It's not Peacock's mere existence that makes Comcast so compelling heading into (and then out of) the coronavirus firestorm, though. It's what seems to be relatively modest expectations.The company says it's looking for by 2024. The outlook may underestimate just how much interest there is in such a well-supported service when it's appositely free, however. For perspective,   has amassed more than  to its Disney+ service after launching in November with a relatively limited (albeit high-quality and marketable) library of content. Ad-supported video venue Tubi TV,    , reported it had brought 20 million regular monthly viewers into its fold last year, and that was without the marketing firepower a name like Comcast has at its disposal.As for Comcast's Universal theme parks and film ventures, unfortunately, they'll just have to take their lumps. The good news is, those aren't particularly big businesses compared to the company's other arms. The stock's 23% tumble from its January high also mostly reflects the effect the coronavirus pandemic has and will have on the organization's bottom line.Data source: Thomson Reuters/Refinitiv. Chart by author.More than anything though, Comcast's core businesses are the kind that prove to be recession-resistant -- if that's what's in the cards -- yet marketable even if the global economy is able to pull itself out of the slump. Broadband customers are well aware they'd , yet consumers are also weary of ever-growing monthly bills linked to . A free or low-cost one backed by a big studio and television name should draw quite a crowd.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Comcast wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Right now, the hottest slice of the streaming video market is the ad-supported segment, in contrast to purely subscription-based options like . And    clearly knows it. Last week, the entertainment company -- which became a stand-alone entity a year ago after 's   of most of 21st Century Fox -- announced its $440 million purchase of commercial-supported video streamer Tubi.That deal takes the last of the major independent ad-supported video on demand (AVOD) companies off the table; at this point, each of the major networks and studios has an ad-supported or ad-subsidized streaming service in its portfolio.Now, let the games begin as they vie for dominance.Image source: Getty Images.Ad-supported streaming has been around almost as long as streaming itself has, although mostly as an afterthought until January 2019. That's when  , noting the success of Tubi and 's  ad-supported channel IMBDtv, announced it was planning its own ad-supported offering that would be a lot like classic broadcast television. The planned service would , and make it completely free for viewers willing to tolerate a few more of those ads than paying subscribers will see. It will even stream the same video content cable customers enjoy, although not quite in real-time.Just a few days later,    -- when it was still just Viacom -- announced its acquisition of ad-supported video-streamer Pluto TV. That same day, Disney-owned Hulu lowered the monthly price of its ad-subsidized subscription. Last month, ViacomCBS revealed it would be  of its CBS All Access. Later in February, Comcast acquired Xumo, which offers free and subscription-based video entertainment.It doesn't take a detective to spot the trend. Media companies want a piece of this growing niche, and they'll buy or build their way into it. Most are doing both.For all the positioning that companies have been doing just since the beginning of last year, even more lies ahead. Comcast's Peacock, which will lean heavily on the properties of NBC and Universal, won't launch until July. Xumo and Tubi are both established AVOD operations, but both are new additions to parent companies that didn't build them, and Xumo will eventually have to compete with its homegrown rival, Peacock. Fox, meanwhile is at the beginning of its AVOD learning curve with Tubi, and ViacomCBS  about when its ad-supported service might debut or what it will look like when it does.All of these entities, however, are moving fast, and most may ultimately be positioning themselves to keep Peacock in check, fearing it could become the powerhouse within the ad-supported arena.That concern would be well justified.Describing Peacock as a first-of-its-kind service isn't hyperbole. Until now, networks and studios have had an interest in making their content relatively exclusive to one video venue. Disney, for instance, moved several of its  and Marvel films from previous partner Netflix to its new Disney+ streaming service.Networks and studios aren't as hesitant to double-dip with their video content now though, particularly when they own all the mediums through which it's available. Comcast doesn't just own NBC and Universal. It's also a major cable provider, and it will soon be a streaming powerhouse able to offering tons of network and studio content. That makes Peacock a potent prospect, even more so considering that consumers who are starting to feel subscription-fee fatigue will be able to get it free.That subscription-fee fatigue is real, too. Most U.S. households say they aren't willing to spend more than $40 per month on streaming subscriptions, and more than one-third of U.S. households say they . They are, however, remarkably open to watching a few commercials in exchange for free on-demand video. A recent poll taken by The Trade Desk and YouGov indicated more than half of all TV watchers were  in exchange for lower priced (or free) streaming video. The same survey also indicated that people would prefer those ads to be targeted so that they are relevant to them.Like any close race, the most exciting moments come at the end, and this year should be the beginning of the final lap in the race among streaming names to establish AVOD supremacy. At stake is their shares of a revenue pool that Digital TV Research estimates will be worth $20 billion by 2024 in North America alone and $56 billion on a global basis.Given that, look for the major players to pull out all the stops in 2020 to attract viewers and secure the widest foothold in the market they can manage. Competitive pricing and compelling content will be their weapons of choice, although bundling is likely to be a favored tactic too.The odds-on favorite to win the race is still Comcast though, if only because it's so close to launching Peacock, and is so far ahead in the  that commercial-buying companies will want in order to make airing their ads on these platforms worth their while.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Fox Corporation (A Shares) wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["  is offering 30 days of free access to a collection of over 20 premium channels on its platform through its Home Together initiative it launched last Friday.With viewers locked down at home during the coronavirus pandemic, millions more people looking for entertainment than might otherwise do so.The streaming platform notes that over \"the coming weeks, we will focus on highlighting programming like this as we all spend extra time at home.\"Image source: Roku.The Roku initiative is offering extended free trials, which can be accessed through The Roku Channel or through the \"Featured Free\" feature. It represents an  who might stay beyond the free trial after the crisis passes. Roku notes there are 100 million people in households who have a Roku device. Roku is the largest seller of connected smart TVs, with one out of every three sets being sold having the Roku OS installed.Programming from channels such as Showtime, Epix, and Smithsonian will all be included in the Home Together package. Roku also notes that there are other free trials being offered through its platform, as well as some individual shows being unlocked within premium channels., for example, is offering a free trial through April 23 for its CBS All Access streaming service, while  is unlocking all past seasons of  as well as their live news feed for Roku customers.The offers are available to U.S. customers for a limited time and will require people to cancel any subscription they try out at the end of the promotional period to avoid being charged.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Roku wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["It would be easy to breeze right past the headline and not give it a second thought, chalking the announcement up to mere formality.    needs detailed information about its TV viewers so it can better target television commercials with its streaming service Tubi, and  can supply it. Why not work together?Give the news a closer, second look though, and one may start to wonder exactly why -- or even how -- a credit reporting bureau is working with a media giant, providing sensitive information that should arguably be kept confidential. Besides, how would TransUnion even know about your viewing or shopping preferences?There's the rub. This is a partnership that should gnaw at consumers. It should also concern regulators and lawmakers. Even media names may want to think twice before plugging into the same idea. Fortunately, it's not a prospective moral hazard that rival television name   even has to consider. It's already figured out how to gather and utilize consumer data for its TV platforms.Image source: Getty Images.The press release was posted in mid-April, though likely lost in a sea of coronavirus-related headlines. The two companies co-announced:The partnership enables Tubi to deliver curated content and viewer experiences by establishing a more enriched view of individuals and households. This unique picture of the connected consumer is created by combining Tubi's deep understanding of content viewing behaviors with TransUnion's robust data assets, rooted in their cross-verified consumer database. As a result, advertisers can more seamlessly bridge the gap between individual and household, and deliver a more personalized ad experience alongside the content.Translation: If you're watching Tubi video content, TransUnion is telling Fox other details about your life, including information about your family.It's only half as alarming as it may seem to be on the surface. Advertisers can already make some pretty reasonable assumptions about you just based on the programs you're watching, and you can bet that streaming platforms like  are  to your Amazon.com purchase history. Your internet service provider pretty much knows every website you visit too. But, all of those are more or less expected. Consumers have given up on even trying to remain entirely anonymous.Bringing a credit bureau into the mix, however, is a new and uncomfortable spin on an old idea. What information is stored in a \"cross-verified consumer database?\" Incomes? Credit scores? Job history? Social security numbers? Perhaps more important, what measures are being taken to ensure security of personal information when it's being passed to and from Fox?While Comcast has always worked to give its advertisers the best and most meaningful data possible, it's stepped up the development of its capabilities of late to create a unified offering called  that allows advertisers to most effectively purchase air time.As the name suggests, the One Platform \"gives marketers the power to reach all audiences everywhere they are across the full NBCUniversal ecosystem, and enables every impression to be data-informed.\"That \"data-informed\" detail is the key. While Comcast doesn't say exactly what its NBCUniversal unit knows about viewers, presumably it's information decidedly useful to advertisers. One Platform is a data gathering and measurement tool as well, however, with the February revelation of the platform explaining \"NBCUniversal will be expanding CFlight cross-platform impression measurement to include OTT co-viewing, out-of-home measurement (OOH) as well as short-form video.\"OTT means over-the-top television, and in this instance primarily refers to the company's upcoming streaming service called Peacock slated for full commercial launch in July. That's an important detail too. One Platform lets advertisers run campaigns that utilize all of NBCUniversal's  vehicles, and measure the collective response.Perhaps most important of all, Comcast didn't have to tap a credit bureau to give its advertisers valuable information about its customers. Comcast already has enough of what it needs, and it doesn't need to take a chance on a partnership that's questionable at best and risky at worst.Curiously, privacy hawks haven't made much of a fuss about TransUnion's agreement with Fox's Tubi, although it's possible they've also been hampered by fallout from the COVID-19 outbreak. It's also possible that neither Tubi nor Fox are high enough in profile to draw the attention of potential critics.This is still no small matter though. Should the partnership find its way into the spotlight -- or worse, somehow cause a data breach -- don't be surprised to see public pushback. Not wanting to cause any more ire, Comcast is well-positioned to win any displaced advertising dollars.  are kind of funny about doing business with companies that fail to protect their personal data.In a much broader sense, however, the TransUnion/Tubi agreement underscores just how important consumer data will be as we move into the streaming era. It also illustrates just how difficult it is to gather and analyze that data. In this regard, there's nothing else out there quite like One Platform.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Comcast wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["After the close of trading on Monday, it was reported that   was offering 6 million shares of   at $57.50 and $59 per share. That was well below Monday's closing price of $63.84, which was already down a stunning 21.1% for the day during the worst single-day drop in the market since 1987. That was a  that large shareholders may have wanted out of the high-flying growth stock at just about any price. After all, Roku topped $176 per share as recently as last August, so to see a large shareholder wanting out at $60 was not what shareholders wanted to hear.  However, we now know who the big seller was, and the answer to the question should probably make Roku shareholders breathe a bit easier -- at least, as easy as one can breathe in this environment.Image source: Getty Images.It turns out that Morgan Stanley was acting as an intermediary for   , which had retained its news and sports divisions after selling its massive movie studio and other television channels to   almost exactly one year ago. Fox had been a pre- investor in Roku since 2013, good for a 5% stake. Apparently, Fox had earmarked its Roku winnings to buy Tubi for $440 million, a deal that was announced on Tuesday. Tubi is a free streaming service that sells ads to make money.Fox is likely making the Tubi purchase in an effort for self-preservation. As more and more of the world cuts the cord on traditional linear TV, companies like Fox, which retained sports and news programming as the last bastions of the cable bundle, may feel the need to adapt in case even sports and news aren't enough to retain large cable audiences anymore. That means Fox needs a streaming option, and Tubi is just that. Tubi licenses non-exclusive films and TV shows, and claims that customers spend 160 million hours per month on its platform in total. Likely, Fox will add local news and sports to Tubi's current licensed offerings.Fox said in a statement that it is \"essentially exchanging a passively held minority investment for full ownership and control of a leadership position in the free ad-supported streaming market.\" That's not totally the case, as the bargain-basement price it received for Roku only amounted to about $350 million, assuming a 6-million-share sale at $58 per share. That's well short of $440 million, and likely the reason that Fox panic-sold its stake after a massive drop in Roku's share price. If Roku continued to fall, it's likely Fox would have had difficulty paying up for Tubi, potentially endangering the deal altogether.For downtrodden Roku shareholders that have seen the stock fall a whopping 65% from its all-time highs, there's no doubt that last night's news was a relief. That's because it shows the sale was something of a panic sale for a specific purpose, not necessarily a statement about large shareholders' negative views on Roku.That being said, Roku's stock is still a story about massive . So if a global recession severely eats into advertising revenue, shareholders still may have tough times ahead. But at least for now, shareholders can cling to this bit of \"less bad\" news.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Roku wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Looking at the universe of stocks we cover at , on 3/3/20, Israel Chemicals Ltd (Symbol: ICL), Yum China Holdings Inc (Symbol: YUMC), and Fox Corp (Symbol: FOX) will all trade ex-dividend for their respective upcoming dividends.  Israel Chemicals Ltd will pay its quarterly dividend of $0.018 on 3/18/20, Yum China Holdings Inc will pay its quarterly dividend of $0.12 on 3/25/20, and Fox Corp will pay its semi-annual dividend of $0.23 on 4/1/20.  \n\nAs a percentage of ICL's recent stock price of $3.69, this dividend works out to approximately 0.49%, so look for shares of Israel Chemicals Ltd to trade 0.49% lower — all else being equal — when ICL shares open for trading on 3/3/20.  Similarly, investors should look for YUMC to open 0.28% lower in price and for FOX to open 0.75% lower, all else being equal.\n\n\n\n\n\nBelow are dividend history charts for ICL, YUMC, and FOX, showing historical dividends prior to the most recent ones declared.\n\nIsrael Chemicals Ltd (Symbol: ICL):\n   Yum China Holdings Inc (Symbol: YUMC):Fox Corp (Symbol: FOX):\nIn general, dividends are not always predictable, following the ups and downs of company profits over time.  Therefore, a good first due diligence step in forming an expectation of annual yield going forward, is looking at the history above, for a sense of stability over time.  This can help in judging whether the most recent dividends from these companies are likely to continue.  If they do continue, the current estimated yields on annualized basis would be 1.95% for Israel Chemicals Ltd, 1.13% for Yum China Holdings Inc, and 1.51% for Fox Corp.  \n\n\n\n\t\t\n\nIn Friday trading, Israel Chemicals Ltd shares are currently down about 0.5%, Yum China Holdings Inc shares are off about 3%, and Fox Corp shares are off about 1.4% on the day. \n\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Fox Corp. (FOXA, FOX) said it agreed to buy Tubi, Free Ad-Supported Streaming Service, for about $440 million in cash.FOX said it plans to continue to run Tubi as an independent service anchored by its consumer offering of licensed entertainment content. Tubi Founder and CEO Farhad Massoudi will continue to head Tubi.FOX, which expects to close the Tubi transaction before June 30, 2020, will finance the Tubi acquisition principally with the net proceeds from the completed sale of its stake in Roku Inc.Tubi, which is currently available on more than 25 digital platforms in the United States, features over 20,000 titles and 56,000 hours of film and episodic television programming from over 250 content partners, including many of the major studios. The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Shares of media company    jumped on Monday. The stock had risen 8% by the time the market closed.The stock's rise was likely primarily driven by a rebound in the overall market during the trading day. But analyst commentary may have helped, too; one analyst reiterated an outperform rating for the stock on Monday. Image source: Getty Images.Highlighting optimism in the overall market on Monday, the  rose more than 3% as stocks continued rebounding from a sharp drop in late February and early March. Fox's gain on Monday likely similarly reflects a bounce higher from a big sell-off in its own shares. Even when including the stock's gain on Monday, shares of the media giant are still down 37% since Feb. 19.Separately, Credit Suisse analyst Douglas Mitchelson lowered his price target for Fox stock on Monday but reiterated an outperform rating. The lowered price target reflects an expectation for adverting revenue and subscriber trends to take a hit amid the coronavirus pandemic. Mitchelson's updated $37 12-month price target, down from $45 previously, still implies more than 50% upside.There's a lot of uncertainty around advertising spend as many companies have been hurt by travel restrictions and stay-at-home orders. Investors should look to Fox's next quarterly update to see how the pandemic is affecting the company.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Fox Corporation (A Shares) wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Looking at the underlying holdings of the ETFs in our coverage universe at , we have compared the trading price of each holding against the average analyst 12-month forward target price, and computed the weighted average implied analyst target price for the ETF itself. \tFor the Vanguard Mega Cap Value ETF (Symbol: MGV), we found that the implied analyst target price for the ETF based upon its underlying holdings is $94.28 per unit.\n\n\nWith MGV trading at a recent price near $77.77 per unit, that means that analysts see 21.23% upside for this ETF looking through to the average analyst targets of the underlying holdings.   Three of MGV's underlying holdings with notable upside to their analyst target prices are Fox Corp (Symbol: FOX), Ford Motor Co. (Symbol: F), and Tyson Foods Inc (Symbol: TSN). Although FOX has traded at a recent price of $30.99/share, the average analyst target is 54.89% higher at $48.00/share. Similarly, F has 38.09% upside from the recent share price of $6.97 if the average analyst target price of $9.62/share is reached, and analysts on average are expecting TSN to reach a target price of $92.43/share, which is 33.59% above the recent price of $69.19. Below is a twelve month price history chart comparing the stock performance of FOX, F, and TSN:  \n\n   Below is a summary table of the current analyst target prices discussed above:\n\nAre analysts justified in these targets, or overly optimistic about where these stocks will be trading 12 months from now? Do the analysts have a valid justification for their targets, or are they behind the curve on recent company and industry developments? A high price target relative to a stock's trading price can reflect optimism about the future, but can also be a precursor to target price downgrades if the targets were a relic of the past. These are questions that require further investor research.  \n\n\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Broadcast news and entertainment giant   , announced late Tuesday that it would acquire free, ad-supported streaming service Tubi for $440 million in cash. The company said the move was designed to \"broaden and enhance FOX's direct-to-consumer digital reach and engagement.\" The deal is expected to close by June 30. Fox, which emerged after the  to , said it will continue to run Tubi as an independent service, so it won't be rebranded with the Fox logo.Image source: Tubi.Tubi is found on more than 25 digital platforms in the United States, featuring over 20,000 titles and 56,000 hours of film and television programming from more than 250 content partners, which includes many of the major studios. When combined with Fox's sports and news shows, the streaming service will have access to a broad cross-section of content for viewers.The company said it will finance the acquisition with the proceeds from the sale of its 5% early stage stake in  streaming provider  , \"essentially exchanging a passively held minority investment for full ownership and control of a leadership position in the free ad-supported streaming market.\" Fox also said it will \"expand our partnership with [Roku] as a result of the Tubi acquisition.\"Late last year, Tubi reported 25 million monthly active users, which tend to be younger-skewing, while also willing to accept advertising in exchange for the platform's laundry list of licensed television shows and films. This will help increase Fox's reach to a more digitally native audience while also increasing the value of its advertising by allowing it to better target desired consumers.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Fox Corporation (A Shares) wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["It's another turbulent day in the stock markets. You might think that with  running rampant, people self-quarantining, social distancing, and cocooning at home watching TV, now would be a good time to own cable and television companies. But apparently, Wall Street disagrees.T including  , , and  are some of the biggest losers on Wall Street today. As of 1:25 p.m. EDT Monday, Disney shares were down 6.8%, Fox 7.4%, and Comcast 3.6%.Image source: Getty Images.Earlier today, all three stocks were down 10% and more, which means that some unlucky souls certainly sold at the bottom, suffering even worse losses than we are looking at now.Does any of this make sense?After all, just this past weekend, the Federal Reserve cut interest rates by a full percentage point, such that the Fed's targeted rate is now ranging from 0.25% all the way down to 0%. Simultaneously, the Fed announced  to buy U.S. Treasuries and mortgage-backed securities, pushing money into the economy in exchange.Again, you'd think this would be good news for stocks, but apparently, Wall Street disagrees.There is a more logical explanation for why two of these stocks would be going down. Even if television viewing goes up in the coming weeks, Disney has , and so has Comcast, which owns  theme parks, a $6 billion a year business. This doesn't explain why Fox would be going down, however -- certainly not down more than either Disney or Comcast.Then again, there's an awful lot that doesn't seem to make sense about the markets these days. When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Walt Disney wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["It's relatively good news for streaming services like , and even  , which distributes digital video through Prime. But the biggest beneficiary of the paradigm shift spotted by digital video editing and production platform Grabyo is the soon-to-be-launched Peacock service from NBCUniversal -- a division of cable giant  . Simply put, Grabyo's recent survey of consumers indicates that 74% of television watchers will only be streaming their content by 2025.On the surface, it's neither surprising nor alarming. Cable companies that have been on the wrong end of the cord-cutting craze are finally stepping up their streaming game. In addition to the impending launch of Peacock,   revealed last month it was , similar ad-supported video platform.  just announced its , which injects advertisements into television programming and movies to make them free for watchers.Somehow, though, Comcast's Peacock still looks like it comes out the winner of this budding branch of the streaming video market.Grabyo's survey confirms what most investors already innately know -- streaming is so well focused and affordable that it's negating the need for cable TV. The firm's data further indicated 36% of consumers looking to cut the cord rated affordability as one of the top three reasons to do so... a data point that may understate consumers frustration with high cable bills.Image source: Getty Images.It's curious, however. While the poll found most consumers intend to use only streaming video services within five years, customers don't exactly hate their cable providers, or their prices. An impressive 33% of cable customers rate the value of their TV service as \"very good,\" while 43% of them deem cable television a \"good\" value for the money. Streaming fares a little better, but not leaps and bounds so.These numbers suggest what this year's expected slowdown in cord-cutting also imply. That is, we may be nearing a streaming/linear cable equilibrium where the remaining traditional cable TV customers have decided their monthly bill and their advertisement exposure is fair for what they're getting. It may also tacitly suggest there's a bit of ground in between those two extremes of the free/premium continuum that's been mostly overlooked by the industry... until now.The concept itself is certainly proven. SpotX's 2020 Vision report published in December points out that a little more than 60% of streaming consumers already do watch . SpotX also indicated 40% of video content now being streamed is actually ad-supported.Enter Peacock, built from the ground up to deliver cheap, network-caliber entertainment with a few ads, and backed by a sizable library of new and old content choices from a network and a major movie studio.With nothing more than a passing glance, Peacock could look just like another Netflix or Prime. That's not what it is though, by a long shot. Peacock is being built from the ground up to be a marketable hybrid of a Netflix-like service and network content one would expect to see on an NBC affiliate station. Live sports and regular prime-time programming will also be available via Peacock, with the commercials one would expect to see aired through a cable broadcast.In other words, Peacock may not be linear cable, but it's certainly close enough that consumers will be hard-pressed to identify a meaningful difference.Comcast won't operate by itself in this middle ground for very long, though. While details about its service are scant, ViacomCBS has made clear it's going to dig deep into its vaults to build on its existing CBS All Access platform. With properties like Nickelodeon, Comedy Central, BET, Smithsonian, and more primed to contribute as many as 30,000 TV episodes and up to 1,000 films to the cause, ViacomCBS has the potential to become a player. It's just  on the planning front, however, that most consumers may have already become comfortable with Peacock before ViacomCBS even figures out what it is.This is a speed-based race too. Grabyo's outlook may say 74% of television fans will be purely streaming by 2025, but that migration has already started. Peacock will be available closer to the beginning than the end of that shift, and it will be the first real ad-supported option of its caliber, giving it a chance to turn test-drivers into buyers before a competitor does.If anything, the advent of the coronavirus outbreak might only accelerate Grabyo's expectation.TV-viewership measurement name  reports that when  have been stuck at home for prolonged stretches, television viewing time can jump as much as 60% above the norm. Although the COVID-19 contagion will eventually pass, consumers may still be nervous about getting out when Peacock officially launches in mid-July. Should a recession take hold, that too will keep people at home and looking for cheap entertainment.Either way, Peacock wins, particularly if consumers have tired of what's on Netflix or Prime by that point in time.ViacomCBS could conceivably have its ad-supported service up and running by around that time, but that would be rushed effort, and likely wouldn't have the well-planned  in place that Comcast has built for Peacock.In simplest terms, Peacock still looks poised to rule the roost, now more than ever. Comcast's platform will be an easy off ramp for hesitant cord cutters to take, and Grabyo agrees more and more that they are ready to make some sort of switch. The company's plans to amass at least  by 2024 now don't seem so crazy after all. Indeed, they may be a bit modest.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Comcast wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Twenty-First Century Fox, Inc. (FOX) revealed a profit for its second quarter that rose from the same period last year.The company's profit came in at $300 million, or $0.48 per share.  This compares with $8 million, or $0.01 per share, in last year's second quarter.Excluding items, Twenty-First Century Fox, Inc. reported adjusted earnings of $64 million or $0.10 per share for the period. The company's revenue for the quarter rose 5.6% to $3.78 billion from $3.58 billion last year.Twenty-First Century Fox, Inc. earnings at a glance:-Earnings (Q2): $64 Mln. vs. $268 Mln. last year.\n-EPS (Q2): $0.10 vs. $0.43 last year.\n-Revenue (Q2): $3.78 Bln vs. $3.58 Bln last year.\n The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Legendary investor Warren Buffett advises to be fearful when others are greedy, and be greedy when others are fearful.  One way we can try to measure the level of fear in a given stock is through a technical analysis indicator called the Relative Strength Index, or RSI, which measures momentum on a scale of zero to 100.  A stock is considered to be oversold if the RSI reading falls below 30.\n\nIn trading on Tuesday, shares of Fox Corp (Symbol: FOX) entered into oversold territory, hitting an RSI reading of 28.6, after changing hands as low as $32.645 per share.  By comparison, the current RSI reading of the S&P 500 ETF (SPY) is 29.6.  A bullish investor could look at FOX's 28.6 RSI reading today as a sign that the recent heavy selling is in the process of exhausting itself, and begin to look for entry point opportunities on the buy side.    The chart below shows the one year performance of FOX shares:\n   \n   \n\nLooking at the chart above, FOX's low point in its 52 week range is $29.61 per share, with $43.6308 as the 52 week high point — that compares with a last trade of $32.83.  \n\n\n\n\n\n\n\n\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["After a tough Friday, U.S. equities rebounded on Monday. That said, letÃ¢Â\u0080Â\u0099s look at a few top stock trades for Tuesday.\t (NASDAQ:) posted solid gains on Friday in the face of a market-wide correction. The move came on , but has yet to approach the after-hours gains north of $2,100. For now, AMZN has a high of roughly $2,055, as it flirts with a big-time breakout.Included here is a weekly chart of Amazon, as shares hover near the $2,025 area, a zone of long-time resistance. If AMZN can rally over $2,055 and above $2,100, it may do more than take out its after-hours high of $2,133. It may embark on a breakout over the ensuing months and quarters.If it canÃ¢Â\u0080Â\u0099t breakout, look to see if it can maintain above $2,000. Below puts a pullback in the cards, possibly down to the 50-week moving average and uptrend support (blue line). That is, if the 10-week moving average doesnÃ¢Â\u0080Â\u0099t support the stock on its pullback.\tOn Friday,  (NASDAQ:) slipped on reports that its dispute with Fox (NASDAQ:, NASDAQ:)  of the Super Bowl. Ultimately, the issue was resolved and Roku rallied almost 7% on Monday as a result.Still, Roku has not been rallying like most of its growth-stock peers over the past few months. Once $127.50 broke on Friday, readers  for a drop down to the $120 area, which is exactly what they got on Friday.Below $120, and $105 to $100 may be on the table. However, as long as it holds, Roku may be okay. Over $130 puts it over downtrend resistance (purple line) and the 20-day moving average, and puts the declining 50-day moving average on the table.\tBulls have to be impressed with the way  (NYSE:) stock continues to hold up. Over the past few sessions, volatility has been climbing and equities have been under pressure Ã¢Â\u0080Â\u0094 but not Yeti.Shares continue to hold up well around that breakout mark between $36 and $37. On a close below $36, short-term bulls may consider stopping out and looking for a pullback into support. That comes into play near uptrend support (blue line) and the 200-day moving average, provided the 50-day moving average doesnÃ¢Â\u0080Â\u0099t hold up.However, over $36 and bulls may very well keep with the long trade. Over $37.61 Ã¢Â\u0080Â\u0094 the recent high Ã¢Â\u0080Â\u0094 and Yeti shares can break out, with $40 in sight.\tDid you miss  (NASDAQ:)? This stock has been on fire, rallying 14% at one point on Monday.The stock broke out over downtrend resistance (purple line) to start the year, but  last week when it pulled back into uptrend support (blue line).With shares erupting higher, letÃ¢Â\u0080Â\u0099s see if prior support at $90 acts as resistance or if itÃ¢Â\u0080Â\u0099s reclaimed and acts as support. On a pullback, see if the just-established 200-day moving average near $80 acts as support. Below puts the 50-day moving average and uptrend support back on the table.Bret Kenwell is the manager and author of  and is on Twitter . As of this writing, Bret Kenwell is long ROKU and AMZN.The post  appeared first on .The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Twenty-First Century Fox, Inc. (FOX) will host a conference call at 4:30 PM ET on Feb. 5, 2020, to discuss its Q2 20 earnings results.To access the live webcast, log on at investor.foxcorporation.com The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["  users hoping to stream Super Bowl LIV on 's   streaming apps might be out of luck. The two have failed to renew a distribution contract for seven Fox channels on Roku's platform.The blackout of Fox's channels -- set to begin sometime on Jan. 31 -- is somewhat unprecedented and runs parallel to the challenges smaller media companies have had in negotiating carriage deals with traditional pay-TV providers in recent years. While users of 's  Fire TV couldn't stream YouTube for several months, that stemmed from a much broader spat between the retail giant and YouTube's parent company, 's Google.Roku's hardball tactics with Fox despite Sunday's Super Bowl indicates relative strength for the streaming platform. And while it could cause some short-term pain as a portion of Roku users are turned off by the inconvenience of the situation, Roku ought to come out ahead in the long run. Moreover, renegotiating distribution with other media companies and leveraging its sizable audience could lead to additional growth in revenue per user.Image source: Roku.Roku used to compare its active account number to the subscriber base of pay-TV providers. In the fourth quarter last year, management wrote, \"In the U.S. alone, our active account base would make the Roku platform equivalent to the No. 2 traditional pay-TV/cable company.\" And after substantial cord-cutting at the two biggest providers in 2019, Roku's audience is probably big enough to call itself No. 1.Roku is also substantially larger than Amazon's Fire TV in the United States. While Amazon counts over  globally, it seems to be far less popular than Roku in the U.S. Roku users streamed more than twice as many hours as Fire TV users in the third quarter, according to data from Conviva.The carriage dispute with Fox puts Roku's size in perspective. It's hard to imagine many other distributors willing to forego the potential audience provided by the Super Bowl.The details of the dispute remain unknown, but the blackout likely revolves around ad inventory splits. Amazon had a  with  ahead of the launch of Disney+. Amazon wanted a greater share of ad inventory for Disney's ad-supported streaming apps. The two were able to come to terms before the launch of the new service.Demanding a larger share of ad inventory presents a path to accelerate revenue per account for Roku. The streaming company generated $22.58 per account in the 12 months ended in September 2019. But growth is slowing as it gets bigger, despite continued  and the shift of ad spend from traditional to connected TV.Taking a bigger share of ad inventory provides another axis for Roku's revenue growth. Combined with increased engagement and increased average ad prices, it would provide a big shot in the arm for Roku's platform business.But it requires Roku to take tough stances like it's doing with Fox. Roku needs to be aware of its users' switching costs and available substitutes in order to come to the negotiating table with confidence. The more smart-TV users in its customer base, the higher the average switching cost. (Smart TVs are harder to replace than a streaming stick.) Roku's smart-TV user base is growing faster than any other company's, taking one-third of sales in the United States. Furthermore, the more options for streaming similar -- or even the exact same -- content on Roku's platform, the stronger Roku's stance. In the case of Fox and the Super Bowl, Roku will have lots of alternatives, including the free NFL channel. What's more, Roku can use its marquee display advertising to point its users in the right direction, so the user experience remains pleasant with minimal costs.That won't be the case with all content providers. Some  will have much stronger positions than Fox and bring large, engaged audiences to the table. But as Roku grows its audience and engagement, it becomes more powerful, and it can grow revenue through demanding more from its content partners.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Roku wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["There's no denying that   was one of the best-performing stocks of 2019. The streaming pioneer's stock price rocketed 337% last year, driven by soaring growth. Revenue grew 50% year over year in the most recent quarter, but the company's platform is growing even faster, up 79%, and now accounts for 69% of Roku's total revenue. Streaming hours also saw robust increases, up 68% year over year to 10.3 billion hours, while active users' accounts grew 36% to 32.3 million.Roku's stock took a nosedive on Friday, however, falling about 7% to its lowest point since early November, as the company let customers know that channels from   -- which will be broadcasting Super Bowl LIV this weekend -- will not be available on its platform beginning Friday, Jan. 31.Image source: Getty Images.The companies are embroiled in a bitter dispute, as a distribution agreement between the two expired on Friday. Roku began notifying its customers in an email that \"all stand-alone FOX channels will no longer be available on Roku streaming devices.\" Roku provided a list of seven channels that were on the chopping block: Fox Now, Fox Sports, Fox News, Fox Business, Fox Soccer, Big Ten Network, and Fox Nation. As of Friday afternoon, the channels were all still available on the Roku platform, so it's unclear exactly when the channels will actually be removed.The company went on to point out that customers could still catch the big game through a variety of other services on its platform, including FuboTV, -controlled Hulu, Sling TV, 's YouTube TV, as well as through a number of other live TV services. Roku also suggested that customers would be able to watch Fox over the air with an antenna. A spokesperson for Fox placed the blame squarely on Roku, calling its tactics a \"poorly timed negotiating ploy.\" The company's statement went on to say:Roku's threat to delete FOX apps from its customers' devices is a naked effort to use its customers as pawns. To be clear, FOX has not asked Roku to remove our apps, and we would prefer Roku continue to make them available without interruption. ... Only Roku can pull apps from its customers' devices, and we would urge them to stop the intimidation tactics and reconsider the merits of irritating their best customers in pursuit of Roku's own interests. Of course, there are two sides to every story. \"We offered Fox an extension ... if an agreement is not reached, we'll be forced to remove the channels,\" a Roku spokesperson said.The Super Bowl is one of the most-watched live events on broadcast television, viewed on 67% of U.S. televisions. Last year, more than 98 million viewers watched the championship game.It's worth noting that ratings have dipped in recent years, sliding in each of the past four years. In 2018, 103.5 million watched the game, down from 111.3 million and 11.9 million in 2017 and 2016, respectively. It peaked in 2015 at 114.4 million.This could be an expensive gambit by both companies, resulting in lower overall viewership across both Roku's platform and Fox's networks. Advertising is a big component of revenue for both broadcasters, so it would be in each company's best interest to resolve this dispute quickly -- especially since there are only two days until the big game.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Roku wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Twenty-First Century Fox, Inc. (FOX) will host a conference call at 4:30 PM ET on Feb. 5, 2020, to discuss its Q2 20 earnings results. To access the live webcast, log on at investor.foxcorporation.com The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Investors considering a purchase of Fox Corp (Symbol: FOX) shares, but cautious about paying the going market price of $33.68/share, might benefit from considering selling puts among the alternative strategies at their disposal.  One interesting put contract in particular, is the October put at the $30 strike, which has a bid at the time of this writing of 20 cents.  Collecting that bid as the premium represents a 0.7% return against the $30 commitment, or a 1% annualized rate of return (at Stock Options Channel we call this the YieldBoost).\n\n\n\nSelling a put does not give an investor access to FOX's upside potential the way owning shares would, because the put seller only ends up owning shares in the scenario where the contract is exercised.  And the person on the other side of the contract would only benefit from exercising at the $30 strike if doing so produced a better outcome than selling at the going market price.  ().  So unless Fox Corp sees its shares fall 10.7% and the contract is exercised (resulting in a cost basis of $29.80 per share before broker commissions, subtracting the 20 cents from $30), the only upside to the put seller is from collecting that premium for the 1% annualized rate of return.\n\n\n\nBelow is a chart showing the trailing twelve month trading history for Fox Corp, and highlighting in green where the $30 strike is located relative to that history:\n  \n\n   \nThe chart above, and the stock's historical volatility, can be a helpful guide in combination with fundamental analysis to judge whether selling the October put at the $30 strike for the 1% annualized rate of return represents good reward for the risks.  We calculate the trailing twelve month volatility for Fox Corp (considering the last 240 trading day closing values as well as today's price of $33.68) to be 24%.  For other put options contract ideas at the various different available expirations, visit the  page of StockOptionsChannel.com.\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\nIn mid-afternoon trading on Tuesday, the put volume among S&P 500 components was 1.87M contracts, with call volume at 1.87M, for a put:call ratio of 0.76 so far for the day, which is above normal compared to the long-term median put:call ratio of .65.  In other words, if we look at the number of call buyers and then use the long-term median to project the number of put buyers we'd expect to see, we're actually seeing more put buyers than expected out there in options trading so far today.\n.\n\t\t\t\t\t\t\t\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Like any high-flying asset on Wall Street, thereÃ¢Â\u0080Â\u0099s an argument to be made that  (NASDAQ:) needs a breather. Last year, TTD stock returned a massive 132% for shareholders. And since its initial public offering, the equity has consistently broken new ground. But once you see that attractive entry point for Trade Desk, youÃ¢Â\u0080Â\u0099ll want to pounce for one pivotal reason: the advertising efficiencies inherent in the companyÃ¢Â\u0080Â\u0099s programmatic platform.\tIn my last article about TTD stock, I discussed the underlying organizationÃ¢Â\u0080Â\u0099s . Particularly, innovations in streaming and connected TV affords advertisers informational opportunities that simply donÃ¢Â\u0080Â\u0099t exist in the linear TV ecosystem. I wrote:Where Trade Desk stock specifically benefits is that the underlying company can offer advertisers unprecedented information about their ad engagements. With streaming technologies, Trade Desk can offer clients the who, what, where, when and why. That simply wasnÃ¢Â\u0080Â\u0099t possible in the linear TV era.\tAnd this opportunity truly comes into play when weÃ¢Â\u0080Â\u0099re talking about live events such as the upcoming Super Bowl. Over the decades, the final game of the NFL post-season has become linear TVÃ¢Â\u0080Â\u0099s flagship arena. According to data compiled by Statista, in 2002, the average cost of a 30-second Super Bowl XXXVI commercial was $2.3 million. Last year, for Super Bowl LIII, this figure ballooned to $5.25 million.But for advertisers, the Super Bowl is a big question mark. As Washington Post contributor Paul Farhi noted, Ã¢Â\u0080Â\u009cSecond-half advertisers, meanwhile, not only , they also have to fight viewer fatigue.Ã¢Â\u0080Â\u009dAnd this is exactly why TTD stock is so compelling longer term.As you probably know subconsciously, not all Super Bowl commercials are equal. Farhi further states that, Ã¢Â\u0080Â\u009cAdvertisers tend to clamor to show ads in the first half of the game and usually in the first quarter. The reason? ItÃ¢Â\u0080Â\u0099s when the audience is most stable, most predictable and most attentive to the advertising.Ã¢Â\u0080Â\u009dThatÃ¢Â\u0080Â\u0099s a completely true statement Ã¢Â\u0080Â¦ for linear TV. But what if an organization can mitigate this unpredictability and leverage it for advertising efficiencies? This concept is the core of what drives the longer-term narrative for TTD stock. As a representative from Trade DeskÃ¢Â\u0080Â\u0099s corporate communications wrote to me in an email:Within linear TV, the broadcast gives away ad slots or puts a low price tag on them during overtime for advertisers because live sports is just so unpredictable; thereÃ¢Â\u0080Â\u0099s no way a broadcaster can predict the game will go into overtime. But with CTV [connected TV], TTD can capitalize on the overtime and find advertisers willing to pay in real-time because that last 20 minutes may bring an audience that is the most engaged.That almost-exact scenario played out in 2017 for Super Bowl LI. Prior to this championship game, no other Super Bowl in history went into overtime. Obviously not knowing that this game would become possibly the greatest comeback in football,  (NASDAQ:, NASDAQ:)  for such a scenario.Now, if viewers watch on linear TV, this programmatic advantage is moot. But Trade DeskÃ¢Â\u0080Â\u0099s representative notes that:Ã¢Â\u0080Â¦thereÃ¢Â\u0080Â\u0099s an increasing number of people who will be watching the Super Bowl through streaming servicesÃ¢Â\u0080Â¦ThatÃ¢Â\u0080Â\u0099s where the opportunity lies for programmatic advertising. If the game goes into overtime, advertisers will have the opportunity to target these viewers. Advertisers plan out their ad campaigns through TTD, knowing that overtime is a possibility.An interesting wrinkle to the burgeoning programmatic advertisement space is that linear TV is losing popularity even in marquee events. For instance, Super Bowl TV viewership  with 114.4 million viewers.Last year, viewership plummeted to 98.2 million.To be fair, this could be a combination of streamingÃ¢Â\u0080Â\u0099s growing presence in live events, as well as declining interest in traditional sports. However, evidence indicates that when the modern Super Bowl audience watches the big game, theyÃ¢Â\u0080Â\u0099re more .\tFor instance, during the 2018 Super Bowl,  (NYSE:) reported a 671% increase in streaming for Will PowersÃ¢Â\u0080Â\u0099 Ã¢Â\u0080Â\u009cAdventures in Success.Ã¢Â\u0080Â\u009d This song was related to SquarespaceÃ¢Â\u0080Â\u0099s commercial. And Skylar GreyÃ¢Â\u0080Â\u0099s Ã¢Â\u0080Â\u009cStand by MeÃ¢Â\u0080Â\u009d enjoyed a 408% boost due to a Budweiser commercial.In other words, todayÃ¢Â\u0080Â\u0099s live sports audience members are watching in a digitally connected network of instant information and gratification. And as this audience evolves with the underlying technology, so too will their penchant for connected TV. Logically, this plays directly into the hands of Trade Desk and TTD stock.As of this writing, Josh Enomoto did not hold a position in any of the aforementioned securities.The post  appeared first on .The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["rom a distance,  looks to be at a high point. The pro wrestling company (which would bristle at that term, preferring \"sports entertainment\") has locked in lucrative five-year U.S. television rights deals for its signature and programs. It also has a rich deal to produce two shows a year in Saudi Arabia, higher rights fees on most markets around the world, and a third night of live programming on a major cable network.Those deals have set the company up well for the next few years. So if your retirement horizon is three or four years, it probably makes sense to hold WWE stock. Outside of that window, however, this company has some red flags when it comes to its ability to maintain its position (and revenue) in the long term.WWE has put most of its eggs in the TV rights basket. Image source: WWE.WWE's television rights deals for on 's USA Network and on FOX last five years, and should give the company stability and predictable revenue growth. The two deals will bring in $311 million in 2019, rising to $462 million in 2021, according to . The company does not break out revenue from its deal to produce shows in Saudi Arabia, but it's believed to be around $50 million a year. In addition, the company now has two hours for its  brand/show on USA, for which it's getting between $50 and $100 million in annual revenue (the exact numbers have not been reported yet).Despite all of that good news, there are signs that the company has slipped in popularity. That may be thanks to rival AEW (which airs its weekly  on TNT opposite NXT on USA), or consumer disillusionment with the brand. So while TV revenue has increased, a number of other areas have fallen through the first three quarters of 2019:When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has quadrupled the market.*David and Tom just revealed what they believe are the  for investors to buy right now… and World Wrestling Entertainment wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["ans of have nothing to worry about for five years. The company has locked in television revenue for that period, which should keep it steadily profitable (and able to pay its dividend) over that time frame pretty much no matter what else happens to its business.That's the good news for investors, but it's not the whole story for the company. WWE has seen its overall popularity drop -- including television ratings, streaming network subscribers, and live attendance. These trends may stabilize, but if they don't, the self-described sports entertainment company may have some serious long-term viability problems.WWE has seen its biggest shows lose audiences. Image source: WWE.WWE's revenue appears strong, or at least it will be once its new television deals kick in. The company will earn roughly $500 million a year over each of the next five years for its and programs in the U.S. That's roughly double what it earned in the past year, and it's money that does not come with any significant new expenses.Add to that WWE's third night of cable programming with its NXT brand on 's USA at a reported $30 million a year, and the company clearly has strong revenue. That should bode well for investors and WWE's dividend, but there are some long-range headwinds to be concerned about. Net income came in at $0.06 per share in Q3. That's down from $33.6 million ($0.37 per share) in the same quarter a year ago. That decline in profit means that the company will not cover its $0.12 per share  and will have to dip into its cash reserves to pay out shareholders.That will almost certainly change when the new television deals begin. The increases in revenue delivered by them will essentially be all profit since expenses are not rising significantly.WWE has a struggling business when it comes to audiences and a thriving one when it comes to revenue. Eventually, those two things have to line up. Either the company will find a way to become more popular (perhaps due to added exposure on Fox), or it will keep losing audience and not be able to make new TV deals that equal its current ones.Investors can take heart in the fact that the company has a few years to turn around its fortunes. Wrestling has generally been a cyclical business, and it's very possible this current down cycle will abate before WWE has to negotiate its next set of domestic TV deals. If it doesn't, though, its dividend will become hard to afford because its non-TV revenue does not support it.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has quadrupled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and World Wrestling Entertainment wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["  shares dropped 36% to $63.50 from  to August 2019, before stabilizing for several months. Following Q3 earnings, the stock sank again, this time dropping 18% to $55.70. The initial decline followed an earnings report that included falling revenue across multiple segments and net losses, which the  attributed to on-air talent missing time due to injuries. While company management pointed to returning wrestlers and the launch of televised events on   as reasons for optimism later in the year, Q3 earnings showed continued weakness. Quarterly revenues once again fell 1.1% year-over-year, with falling live-event ticket and merchandise sales offsetting gains from media content. WWE returned to profitability in the quarter, but its net income of $5.8 million was drastically lower than the $33.6 million from the prior year.Image Source: WWEIt is not all bad news for WWE. The company's television deals with Fox and   are  its broadcast revenue in 2020. WWE has also experienced frustrating delays in completing a deal with Saudi Arabia to host events, distribute media, and create content for the Middle East and North African regions. On Nov. 4, the company announced a completed deal with Saudi Arabia, which helped improve investor outlook on a topic that was straining relations with talent and testing confidence in the market.WWE's difficult year makes the stock look expensive based on trailing price-to-earnings (101.4) and  (31.2), both of which are substantially higher than entertainment industry averages. Even adjusting for the bullish 2020 outlook, WWE's forward price-to-earnings ratio is 21.04, which is comparable to  , and much higher than that of Fox, , , or . A PEG ratio of 1.95 is similarly higher than a majority of the major content creation stocks. WWE does not even pay a substantial dividend, with a yield of 0.87% being the lowest among dividend stocks in the industry. WWE has enjoyed expansion through its proprietary streaming platform, which has steadily gained subscribers, now totaling more than 1.58 million, driving its media segment growth year-over-year. While growth is good, the company might be facing a problem if this is the primary avenue for sustainable expansion. First, it is difficult to create incentives for paid subscribers while simultaneously broadcasting so much free content, thereby creating a situation in which segments cannibalize each other. Further, competition for media subscription dollars is expected to intensify, with many major entertainment companies, , launching their own streaming platforms a la . WWE also faces increased direct competition within its niche, with  bringing several well-known former WWE stars to a new promotion. It is hard to understand how a 50% decline in WWE's share price, coinciding with major revenue expansion announcements for next year, can possibly result in a situation in which the battery of valuation metrics look so pedestrian, or even slightly expensive. As mentioned above, there are stronger dividend payers in the industry.This bull story for WWE hinges entirely on the company's ability to continue dominating its niche and monetizing new revenue opportunities effectively across the globe. Such a narrative certainly includes execution risk, and skeptics will point to the fact that WWE achieved better television ratings 20 years ago despite the presence of competition. It might wind up being a bet that the company can identify another charismatic superstar who can transcend the business and captivate audiences as in the past. Either way, WWE isn't down and out just yet.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has quadrupled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and World Wrestling Entertainment wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Shares of   were moving higher last month after the television network posted better-than-expected results in its third-quarter earnings report. The stock finished the month up 12%, according to data from .As the chart below shows, the 's biggest boost came in the beginning of the month, when its earnings report came out. data by .Shares of Fox, which now consists primarily of the Fox broadcast network and Fox cable news and sports networks, jumped 6% on Nov. 7 after the earnings report was posted. Revenue in the quarter rose 5% to $2.67 billion, ahead of estimates of $2.6 billion, and the company saw gains in both its cable network and broadcast television segments. Affiliate fees, or what it collects from cable and satellite providers, climbed 4%, a sign it's been able to pass along price increases even as cable subscribers dwindle.  Image source: Getty Images.Adjusted EBITDA increased 12% in the quarter to $856 million, and adjusted earnings per share rose by a penny to $0.83, well ahead of estimates of $0.69.CEO Lachlan Murdoch called it \"a solid start,\" adding that Fox \"delivered strong financial results in the quarter and we are making tremendous progress on the operational goals and strategic initiatives that we outlined at our Investor Day in May.\"Despite the gains last month, Fox shares are still down 12% since the deal with  was completed in March. However, as the recent round of results shows, Fox's business should be able to deliver steady, if modest, growth now that it's shed its assets that were most threatened by the rise of video streaming.Management did not give guidance, but over the next year, the company should also benefit from the boom in political advertising during the election year.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has quadrupled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Fox Corporation (A Shares) wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["U.S. stocks keep moving higher, with another green day on Monday. All three major indices again closed at all-time highs. But it’s how stocks are rising that seems a bit strange.\tMost notably, this hardly seems like a a bull market full of  or even ebullient optimism. Broad market indices keep drifting higher, but the  still hasn’t had a one-day gain over 1% in over five weeks.The stocks that are gaining, too, aren’t the kind of names that often rise at this point in a bull market. Cyclicals have done well, to be sure. But growth names have pulled back,  have been mostly hammered, and many energy stocks are at or near 52-week lows. The long-awaited shift from growth to value seems to have arrived in some fashion, but that shift hardly has been consistent.Tuesday’s big stock charts highlight three stocks along the continuum of the current market. They include the market’s biggest growth name, one of its cheaper large-cap stocks, and an intriguing play that’s somewhere in between. Together, they provide a cross-section of the trends currently at play for U.S. stocks. As such, they give some clues as to how the market has behaved in recent months and how it might behave going forward. (NASDAQ:) has been notably excluded from the recent rally. Fellow tech mega-caps  (NASDAQ:),  (NASDAQ:, NASDAQ:), and  (NASDAQ:) all trade at or just off all-time highs. As the first of Monday’s big stock charts shows, that’s not the case for AMZN stock — and that chart suggests it actually could get worse in the near-term:Investors initially cheered   (NASDAQ:,NASDAQ:) executed with  (NYSE:). But as the second of Tuesday’s big stock charts shows, those same investors have mostly shrugged since the sale closed in March.Of late, however, FOX stock has bounced from October lows, and technically and fundamentally there’s an intriguing case for further upside:The third of our big stock charts, (NYSE:), sits firmly on the value side of the market. WHR stock is one of the cheapest names in the S&P 500, at less than 9x forward earnings. The problem at the moment might be that’s one of the few positives WHR has going for it:As of this writing, Vince Martin has no positions in any securities mentioned.The post  appeared first on .The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Fox Corp. (FOXA, FOX) Wednesdasy announced that its Board of Directors has authorized a $2 billion stock repurchase program. The company plans to repurchase, in the open market or otherwise, a combination of Class A common stock and Class B common stock. The company also announced that it has entered into an accelerated stock repurchase transaction to repurchase, in the aggregate, $350 million of its Class A common stock pursuant to the stock repurchase program. The company also intends to promptly buyback about $150 million of Class B common stock. As CEO Lachlan Murdoch said, \"We are committed to deploying capital to maximize long-term stockholder value through a balanced approach of appropriate organic investment, accretive M&A, and returns of capital to our stockholders. This stock buyback program reflects the confidence we have in the long-term investment case for the Company, which is underpinned by the strength of our core brands and the sustainability of our business, and which we believe is well positioned to continue to generate healthy free cash flow.\" The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Fox Corp. (FOXA, FOX) Tuesday said it has agreed to buy three television stations from Nexstar Media Group (NXST) for $350 million.The stations FOX will be acquiring are located in Seattle, Washington and Milwaukee, Wisconsin, two key markets that align with the company's sports rights. The transaction will expand Fox Television Stations' market presence to 14 of the top 15 DMAs. The stations being acquired by Fox are KCPQ and KZJO in Seattle and WITI in Milwaukee.Executive Chairman and Chief Executive Officer Lachlan Murdoch said, \"This acquisition expands the reach of one of FOX's core assets, our television stations portfolio, and further strengthens what is already a highly profitable and cash generative business. The Seattle and Milwaukee markets both overlap with key sports markets, creating significant opportunities for growth and collaboration.\"Jack Abernethy, CEO of Fox Television Stations, added, \"Acquiring stations in these high-performing NFC markets enhances our already strong nationwide footprint and further demonstrates Fox Television Stations' commitment to serving our viewers, advertisers and local communities.\" As part of this transaction, FOX has agreed to sell Nexstar two stations in Charlotte, North Carolina, FOX-affiliate WJZY and MyNetworkTV-affiliate WMYT, for about $45 million. The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Shares of   gained more than 5% on Thursday, after the newly streamlined media company reported better-than-expected earnings, on higher cable and satellite fees and strong content licenses.Fox was spun out as an independent earlier this year as part of 's  of the television and studio businesses of Twenty-First Century Fox. After markets closed Wednesday, it reported fiscal first-quarter adjusted earnings of $0.83 per share on revenue of $2.67 billion, topping analyst expectations for $0.69 per share in earnings on sales of $2.6 billion.Image source: Getty Images.Quarterly net income of $513 million was down year over year due primarily to a change in the value of Fox's investment in , but revenue was up 5% from the same quarter in 2018, as 14% growth in television affiliate revenue more than offset a 2% decline in advertising revenue. Fox also reported a 65% increase in other revenue, supported by growth in the television and cable-network programming segments.In a statement, CEO Lachlan Murdoch highlighted ratings hits including , , and National Football League broadcasts as driving higher results. Murdoch also said:The Company delivered strong financial results in the quarter and we are making tremendous progress on the operational goals and strategic initiatives that we outlined at our Investor Day in May. ... At the same time, we have successfully renewed distribution agreements with many of our largest partners that reflect the strength of our brands. This progress gives us further confidence in the Company's differentiated strategy and our ability to deliver long-term value for our shareholders.Following the Disney deal, Fox is a smaller, more-focused company that's much more reliant on broadcast. Investors should keep close tabs on how well advertising revenue holds up in the quarters to come, especially if the U.S. economy falls into a . But for this quarter, at least, Fox's strategy to focus on sports rights and live events -- including wrestling, baseball, and football coverage -- seems to be working.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has quadrupled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Fox Corporation wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Investing legend  once wrote that individual investors can beat the market if you \"invest in what you know.\" That adage is certainly true for certain household , and proof that one doesn't necessarily need to put all their money behind a high-flying technology stock to get market-beating returns. In fact, if you happen to use a certain product or service day in and day out -- and love using it -- chances are, it's going to be a winning stock over time.Don't believe me? Check out these two widely known, extremely popular consumer brands that have successfully turned $250 (or less) into $1 million (or more!).These household names have made investors a fortune. Image source: Getty Images.The characters, stories, products, and experiences of   have been delighting parents and children alike for decades, but over the long term, it's quite possible Walt Disney shareholders have been delighted even more.Founded by Walt Disney and his brother Roy in 1923, Disney hit cartoon gold with the first Mickey Mouse short  in 1929, followed by the company's first feature-length film, , in 1937. From then on, Disney was off to the races, solidifying itself as the leading children's storytelling brand.But a single media product alone can't generate the kind of 4,000-fold returns we are talking about, and Disney soon found other avenues through which to exploit its storytelling brand. Most notably, the company launched itself into the theme park business in 1971, with the opening of Walt Disney World.  What may surprise some people is that the parks and resorts division was the highest-revenue-generating segment of the Disney empire over the first nine months of 2019. However, the biggest profit center for Disney is its cable television networks, which spans the Disney Channel, ABC, and, most importantly, ESPN, the self-proclaimed worldwide leader in sports. Disney acquired ABC/Capital Cities -- and ESPN along with it -- in 1995 under then-CEO Michael Eisner, the first of several savvy acquisitions that catapulted Disney into a 21st-century media conglomerate.Then in the 2000s, current CEO Bob Iger made another consequential series of acquisitions, bringing in Pixar, Marvel, and Lucasfilm (the home of ) under the Disney umbrella. These moves proved a masterstroke, as branded entertainment with well-known intellectual property has been the dominant-performing type of film content of the past decade.Finally, Disney bought the TV and film assets from    just last year, giving the company majority control of streaming service , and giving Disney the heft to take on   and others in the streaming wars. How much have Disney shareholders made over time? Though the company was founded in the 1920s, Disney didn't go public until 1957, selling shares to the public at $13.88 per share. Since 1957, Disney has  six times, splitting 2-for-1 three times, 3-for -1 one time, and 4-for-1 two times.  Therefore, one share of stock at the IPO has been split into 384 shares. That means if you had invested just $250, your initial 18 shares would have turned into 6,912 shares. Using a current stock price of $145, that $250 investment would be worth just over $1 million today. And that's not even including Disney's dividends. Currently, Disney pays out $1.76 annually, adding $12,162.12 every year on top of an investor's stock gains.As Disney has long been the go-to brand for children's storytelling,   has been synonymous with low prices. Founded by Sam Walton in 1962 as a single store in Bentonville, Arkansas, Walmart expanded outside the state by 1968 and then sold shares to the public in 1970 at just $16.50 per share, to fund its continued expansion.Walmart's corporate value is to offer customers the ability to \"save money, live better,\" and it has stayed true to that ethos throughout its evolution. Walmart's initial success may be attributed to its having offered low enough prices to customers in rural areas, whom many larger national retailers ignored, thinking they wouldn't make for profitable business. However, once Walmart cracked the code on cost-conscious rural consumers, it aggressively expanded outside the U.S. Southeast and across the country, undercutting other retailers with its commitment to low prices.Walmart's success can also be attributed to its willingness to experiment and evolve, all while sticking to its core low-price ethos. The company opened the Sam's Club warehouse format in 1983, followed in 1988 by the first Walmart Supercenter, which combined general merchandise with a full grocery store. Today, Walmart is the largest grocer in the U.S., with 22% market share, according to analysts.Fast-forward to today, and current CEO Doug McMillon has been investing aggressively to take on the threat of e-commerce, , offering two-day shipping in 2017, and even changing the corporate name from Wal-Mart Stores to just plain Walmart in 2018 to de-emphasize its physical stores.  While technology disruption is a concern for sure, investors are applauding Walmart's efforts to expand its e-commerce abilities, with shares up 24% over the past year. How well have Walmart's shareholders fared over the years? The stock has split 2-for-1 11 times, meaning that for each share bought at its IPO, an investor would have 2,048 shares today.  Purchasing $250 worth of stock back in 1970 would have gotten an investor roughly 15 shares. Today, that would have been split into 30,720 shares worth some $3.6 million.That's a shocking return on an investment, more than tripling the performance of Disney, and also not including dividends. Walmart's current dividend is $2.12 per share, meaning not only would that initial $250 have earned you a fortune, but it would also entitle you to receive $65,126 in dividend payments this year alone.What did both Disney and Walmart do right? In my mind, both had a clear brand value proposition that appeals to an extremely wide swath of people, and both relentlessly executed on that brand promise over and over again. For Disney, it has always stayed true to its promise of inspiring young people to go on adventures, be a force for good, and survive life's challenges outside their parents' homes. For Walmart, having a commitment to the lowest price and highest convenience was a universal principle that appealed to almost all consumers. By standing for a promise and consistently delivering on that promise many times over with excellent execution, both companies have turned very small investments into huge fortunes over the past 50 years.If you're looking at a younger consumer brand with the hopes it could set you up for retirement years down the road, ask yourself if the company has a solid, widely appealing brand promise, and if management can execute on the promise for years and years to come.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has tripled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Walt Disney wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Twenty-First Century Fox, Inc. (FOX) will host a conference call at 4:30 PM ET on Nov. 6, 2019, to discuss its Q1 20 earnings results.To access the live webcast, log on at investor.foxcorporation.com The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["op Consumer StocksWMT\t+0.10%\tMCD\t-1.39%\tDIS\t-0.15%\tCVS\t+1.43%\tKO\t-0.60%\tConsumer stocks were ending mixed in late Monday trade, with the shares of consumer staples companies in the S&P 500 falling nearly 0.3% this afternoon while the shares of consumer discretionary firms in the S&P 500 were ahead almost 0.4%. Among consumer stocks moving on news: (+) Roku () was more than 9% higher shortly before Monday's closing bell after Bank of America Merrill Lynch earlier began analyst coverage of the streaming video platform with a buy investment recommendation and a $154 price target.In other sector news:(+) Tiffany & Co. () jumped over 30% to the highest share price in more than a year after confirming it received an unsolicited $14.6 billion takeover proposal from Louis Vuitton owner LVMH. Tiffany said it was not discussing the $120 per share offer with LVMH although its board is \"carefully reviewing the proposal.\"(+) TEGNA () rose fractionally after the television broadcaster Monday said it has renewed station affiliation agreements with Fox Corp (FOX,FOXA) affiliates in six markets - Abilene and San Angelo, Texas; Harrisburg, Pa.; Hartford, Conn.; Huntsville, Ala.; and Tucson, Ariz. The new agreements include three stations acquired last year from Nexstar Media Group (NXST).(-) Walgreens Boots Alliance () turned narrowly higher after the pharmacy retailer Monday said it expects no growth in its adjusted FY20 net income compared with its non-GAAP profit of $5.99 per share during the 12 months ended Aug. 31, matching Wall Street estimates but upstaging above-consensus Q4 financial results.The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["t's been a wild ride for investors in   this year. After flying from the top rope and reaching all-time high's earlier this year, WWE has been down for the count, losing nearly two-thirds of its value, putting the stock down about 7% so far this year.The match is far from over, however, as WWE is scheduled to report the financial results of its third quarter after the market close on Thursday, Oct. 31. Let's look back at what has caused the wild swings to see if it provides any insight into what investors can expect when the company reports earnings.Kofi Kingston and Samoa Joe fight for the WWE Championship at Extreme Rules. Image source: WWE.For the second quarter, WWE reported revenue of $268.9 million, a 4.5% year-over-year decline, though the company faced tough comps because of record revenue in the prior-year quarter. Adjusted operating income before depreciation and amortization (OIBDA) of $34.6 million declined by 20% compared with the prior-year quarter, though it exceeded the company's guidance. That resulted in diluted earnings per share of $0.11, which were flat year over year, but easily surpassed the expectations for a loss per share of $0.03. The top line missed analysts' consensus estimates of $275 million, caused by declines in each of WWE's operating segments. The company's media segment fell to $197 million, down 3% year over year. Both live events and consumer products also declined, falling to $48.8 million and $23.1 million, a decline of 7% and 13%, respectively. Average paid subscribers for the company's streaming service also decreased, falling to 1.69 million, down about 6% year over year.WWE has always been a cyclical business, but the timing of its recent slump couldn't be worse. In mid-2018, the company signed new, landmark network deals for its two biggest programs.    acquired the rights to  in a deal reportedly worth $1.025 billion. 's  NBCUniversal retained the rights to  in a deal valued at $265 million annually for five years. The ink on those deals is barely dry and the networks may be wondering what they've gotten themselves into. Ratings for  slumped 14% year over year in the first quarter, and 11% in Q2. Likewise, ratings for  fell 13% in Q1, while sinking 7% last quarter. There was some relief in early July, as  and  saw ratings improve by 1% and 2%, respectively, compared with the year-ago period.The incumbent also faces competition from new kid on the block --  (AEW) -- backed by Jacksonville Jaguars owner Shad Khan. The groups cable TV show has been creating buzz and recent reports indicate that some WWE headliners are considering defecting to AEW.WWE only provides broad strokes when it comes to guidance, and the company said for the third quarter it expects OIBDA in a range of $17 million to $22 million, which would represent a decline of between 53% and 39% from the year-ago quarter.For its part, Wall Street has fairly muted expectations. Analysts' consensus estimates are calling for revenue of $191.43 million, which would represent year-over-year growth of less than 2%, while expecting earnings per share of $0.02, a far cry from the $0.37 it reported in the prior-year quarter. WWE has a lot to prove when it reports earnings on Thursday.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has quadrupled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and World Wrestling Entertainment wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["ompanies use dividends as a way to distribute some of their profits to shareholders. Ideally, those payouts will be made using cash the company doesn't need for operations, growth or capital investment (though that's not always the case).Usually, these  are handed out on a quarterly or semiannual schedule. In rare situations, however, companies pay  -- one-time extra payments to shareholders.Sometimes these take place because a company has a triggering event -- perhaps the sale of a division -- or had an unexpectedly profitable period that it does not expect to duplicate. In other cases, a company may choose to pay a special dividend because it's doing well and has built up a stockpile of cash larger than it needs for promoting growth or capital investment.A special dividend can be a very pleasant surprise. Image source: Getty Images.A special dividend can be anything from a small payment to a major one. In 2004,  paid a $3 per share dividend. That was a $32 billion payout by the company that netted then-Chairman Bill Gates $3.2 billion, which he pledged to give to his charitable foundation, according to , which currently distributes a regular quarterly dividend of $0.65, has paid out  on multiple occasions -- $7 per share in 2017, $5 per share in 2015, and $7 per share in 2012. The warehouse club has a fairly predictable revenue model compared to most retailers. More than 90% of its profits come from membership fees, and its pace of expansion has been steady as it has opened about the same number of new stores each year. As a result, the chain can forecast its cash needs better than most of its peers -- and to know when the amount it has on hand is exceeding its needs.That's something that may actually happen again at Costco soon. CFO Richard Galanti talked about the possibility of offering another special dividend during the company's fourth-quarter . He would not confirm that one was coming, but noted that past special dividends have been well-received, and that the chain  \"in our back pocket.\"While the management of many other companies use corporate funds to repurchase shares to enrich their personal holdings, [Founder] Nick [A. Caporella] has always encouraged the Board to favor cash dividends over stock repurchases. If National Beverage had used the cash paid in dividends to purchase stock, the Company would today be 100% owned by Nick and the last seven-plus years of shareholder appreciation would have gone to Nick.Special dividends are rare, so as an investor, you should never buy a stock with the expectation of one forming a key part of your investment thesis. However, if you already like a stock, the possibility of such a bonus can be an extra cherry on top.In the case of those few companies, like Costco, that have distributed special dividends more than once, it would be natural to conclude that in the right circumstances, they might do so again. But even with that precedent set, there are no guarantees.If you'd like to dowse the market in search of other potential special dividend candidates, you could look for companies that are sitting on a lot of cash, or have received large one-time windfalls (or are about to). These influxes of money might come from an unexpectedly great quarter, or from an asset divestiture of a type that's not likely to occur again -- for example, when sold its movie assets and most of its television assets to .It's worth noting that in the case of the 21st Century Fox sale, there was no bonus dividend payout to Fox shareholders. Like most companies, it apparently plans to use its free cash for growth, to buy back shares, or to hold on the books against the chance of the proverbial rainy day.A special dividend from a stock you own is like getting an unexpected bonus at work. You won't know it's coming, but you might be able to see some hints. And after one arrives, you'll likely be able to look back and recognize that the signs were there. But if you go into the office expecting a surprise bonus, you'll spend a lot of days being disappointed -- and the same is true when it comes to special dividends.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has quadrupled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Costco Wholesale wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["op Consumer StocksWMT\t-0.38%\tMCD\t-1.38%\tDIS  \t-0.11%\tCVS \t+1.69%\tKO   \t -0.51%\tConsumer stocks were mixed in Monday trade, with the shares of consumer staples companies in the S&P 500 falling nearly 0.4% this afternoon while the shares of consumer discretionary firms in the S&P 500 were ahead almost 0.3%. Among consumer stocks moving on news: (-) Walgreens Boots Alliance () was fractionally lower after the pharmacy retailer Monday said it expects no growth in its adjusted FY20 net income compared with its non-GAAP profit of $5.99 per share during the 12 months ended Aug. 31, matching Wall Street estimates but upstaging above-consensus Q4 financial results. In other sector news:(+) Tiffany & Co. () jumped over 30% to the highest in more than a year after confirming it received an unsolicited $14.6 billion takeover proposal from Louis Vuitton owner LVMH. Tiffany said it was not discussing the $120 per share offer with LVMH although its board is \"carefully reviewing the proposal.\"(+) TEGNA () rose nearly 2% after the television broadcaster Monday said it has renewed station affiliation agreements with Fox Corp (FOX,FOXA) affiliates in six markets - Abilene and San Angelo, Texas; Harrisburg, Pa.; Hartford, Conn.; Huntsville, Ala.; and Tucson, Ariz. The new agreements include three stations acquired last year from Nexstar Media Group (NXST).The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Twenty-First Century Fox, Inc. (FOX) reported a profit for first quarter that declined from the same period last year.The company's bottom line totaled $499 million, or $0.80 per share.  This compares with $604 million, or $0.97 per share, in last year's first quarter.Excluding items, Twenty-First Century Fox, Inc. reported adjusted earnings of $521 million or $0.83 per share for the period. The company's revenue for the quarter rose 5.1% to $2.67 billion from $2.54 billion last year.Twenty-First Century Fox, Inc. earnings at a glance:-Earnings (Q1): $521 Mln. vs. $507 Mln. last year.\n-EPS (Q1): $0.83 vs. $0.82 last year.\n-Revenue (Q1): $2.67 Bln vs. $2.54 Bln last year.\n The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - TEGNA Inc. (TGNA) and Fox Corp. (FOXA, FOX) said they have entered into a comprehensive, multi-year deal that renews station affiliation agreements for six TEGNA markets, including three stations acquired from Nexstar Media Group in September.The new agreement includes full carriage of the Fox broadcast network, including the NFL on FOX, the MLB World Series, WWE Friday Night SmackDown, The Masked Singer, 9-1-1 and Prodigal Son. The deal also covers continued carriage of TEGNA's Fox affiliates' local station programming on all major streaming platforms.Dave Lougee, president and CEO of TEGNA said, \"This new multi-year agreement allows our viewers and advertisers continued access to premium content such as NFL football and award-winning local news, weather and sports.\"The agreement includes renewals for these TEGNA-owned FOX affiliates: KXVA in Abilene, Texas; WPMT in Harrisburg, Pennsylvania.; WTIC in Hartford, Connecticut; WZDX in Huntsville, Alabama; KIDY in San Angelo, Texas; and KMSB in Tucson, Arizona. The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - U.S. satellite TV provider DISH Network corp. (DISH) said Sunday that it reached a multi-year carriage agreement with Fox Corp. for its owned-and-operated local stations, as well as FS1, FS2, BTN, Fox Soccer Plus and Fox Deportes. The company did not provide details of the terms of the agreement.\"We appreciate our customers' patience as we worked to reach a long-term agreement that restores the Fox networks and local broadcast stations,\" DISH said in a statement.Fox owned-and-operated local stations, FS1 and FS2 were restored on DISH and its online service Sling TV. BTN, Fox Soccer Plus and Fox Deportes were restored on DISH.The Fox channels went dark to Dish customers on September 26 after the two companies could not reach an agreement. Dish had claimed that Fox was demanding double-digit pricing increases while Fox claimed the satellite TV service provider was using the blackout as a negotiating ploy. In the end the two companies reached a compromise.\"We are pleased to announce that we have reached an agreement with Dish and Sling, and they are immediately restoring their subscribers' access to the Fox networks and television stations,\" Fox said Sunday. The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Fox Corp. (FOXA, FOX) confirmed that Credible Labs Inc.'s (CRD.AX) stockholders approved a proposed acquisition of 67% of the equity of Credible by Fox Corp.The transaction is now only subject to the receipt of regulatory approvals and other customary closing conditions.In August, Fox Corp. said that it agreed to buy 67 percent of the equity in U.S.-based consumer lender Credible Labs Inc. for about US$265 million. FOX would commit up to US$75 million of growth capital to Credible over about two years. The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["egendary investor Warren Buffett advises to be fearful when others are greedy, and be greedy when others are fearful.  One way we can try to measure the level of fear in a given stock is through a technical analysis indicator called the Relative Strength Index, or RSI, which measures momentum on a scale of zero to 100.  A stock is considered to be oversold if the RSI reading falls below 30.\n\nIn trading on Wednesday, shares of Fox Corp (Symbol: FOX) entered into oversold territory, hitting an RSI reading of 29.8, after changing hands as low as $30.26 per share.  By comparison, the current RSI reading of the S&P 500 ETF (SPY) is 38.0.  A bullish investor could look at FOX's 29.8 RSI reading today as a sign that the recent heavy selling is in the process of exhausting itself, and begin to look for entry point opportunities on the buy side.    The chart below shows the one year performance of FOX shares:\n   \n   \n\nLooking at the chart above, FOX's low point in its 52 week range is $30.26 per share, with $42.50 as the 52 week high point — that compares with a last trade of $30.31.  \n\n\n\n\n\n\n\n\n \nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], [" has a dividend -- $0.12 per share in the most recent quarter -- that currently must be paid partly from its cash reserves. The company's net income rose in the second quarter to $10.4 million (or $0.11 per diluted share) from $10 million in the same quarter last year, meaning that its dividend costs WWE more than its entire quarterly profit.That's not a major concern because revenue will rise sharply with its new television deals.  will roughly double its broadcast revenue from just under $200 million per quarter to $400 million when its new deals with  and  fully kick in.WWE can afford its dividend since its increased TV revenue, which will be in place for five years, is essentially all profit. The company may spend some of that on retaining talent through higher salaries, but TV rights fees currently account for roughly 80% of its revenue, and that number will increase dramatically beginning in Q3.The self-defined sports entertainment company has the cash to , or at least it will. That does not mean the company should continue to pay one.WWE's Seth Rollins. The company has seen its TV ratings and attendance drop. Image source: WWE.The new television deals cover up a lot of problems. The company may be less popular than it has been in many years, and that has happened at a time when it faces new competition from a , which is in primetime on the TNT network.Domestic television ratings have fallen 14%, while live attendance at its events has dropped by 12%. The company also saw paying subscribers to its streaming network fall by 6%.These are troubling numbers that the company essentially has five years to fix. Realistically, TV ratings for should increase because it's moving from cable (USA) to broadcast network Fox. But expectations are much higher being on a broadcast network, so the company has to deliver ratings if it hopes to see the deal renewed.Both Fox and USA (which has kept Monday night's and now airs a second show,  on Wednesday nights) probably won't make money on their WWE deals. So it's imperative that the company work toward reversing its ratings trends -- and that has to include more than the short-term gimmick of bringing back past stars.WWE has two things it needs to invest its cash in. The first is locking up talent, including its own and any free agents who might move the needle. That's especially important because AEW debuted to 1.4 million television viewers, has strong momentum, and may be perceived as the hipper brand.While working on creating talent that can bring an audience to TV (and to live shows), the company also needs to further develop its streaming network, which has basically stagnated. Paying customers of WWE Network offer a steady revenue stream and a hedge against the company's TV rights being worth less when these deals expire.A dividend should be used when a healthy company has more cash than it needs to execute its priorities and wants to return cash to shareholders. That's not the case with WWE. Even if it moves from barely profitable and not able to cover its dividend to steadily profitable after its new TV deals kick in, it should not be returning money to shareholders.WWE needs to spend money developing and signing talent. That's an elusive thing that there is no exact formula for. The next John Cena or Hulk Hogan may be toiling in wrestling's lower tiers or he or she may be playing another sport. Finding new stars is key, and doing that costs a lot of money because the success rate is so low.The company also needs to invest in content that makes consumers want to subscribe to its network. That's a very big challenge given that it airs seven hours of prime time programming on Fox and USA as well as a few secondary shows.These aren't easy problems to solve; they largely relate to the company not being as popular as it once was. Until it figures out how to reverse that, it should be spending money on the problem while building a cash reserve for a very possible rainy day -- not handing it back to investors.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has quadrupled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and World Wrestling Entertainment wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Fox Corporation (FOXA, FOX) will present at the Goldman Sachs 28th Annual Communacopia Conference.The event is scheduled to begin at 1:15 PM ET on Sept. 18, 2019.To access the live webcast, log on to investor.foxcorporation.com The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["\nCullen/Frost Bankers, Inc. (Symbol: CFR), which makes up 0.30% of the iShares Morningstar Mid-Cap Value ETF (JKI), has seen 2 directors and officers purchase shares in the past six months, according to the recent Form 4 data.  The ETF holds a total of $1,410,141 worth of CFR, making it the #138 largest holding.  The table below details the recent insider buying activity observed at CFR:\nAnd Fox Corp (Symbol: FOX), the #150 largest holding among components of the iShares Morningstar Mid-Cap Value ETF (JKI), shows 2 directors and officers as recently filing Form 4's indicating purchases.  The ETF holds $1,301,818 worth of FOX, which represents approximately 0.28% of the ETF's total assets at last check.  The recent insider buying activity observed at FOX is detailed in the table below:\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["hen   first proposed  in December 2017 to acquire most of the assets of   , the ambitious bet to expand its reach sent shock waves through the entertainment industry.But when all was said and done six months later, and after a brief bidding war that saw   raise the stakes with its own $65 billion cash offer, Disney managed to win Fox's affections with a  cash-and-stock deal -- or an enterprise value of more than $85 billion if you included Fox's debt to be assumed by Disney.At the time, Disney justified the hefty premium by noting the \"intrinsic value of [Fox's assets had] increased\" since it made its first offer, crediting both operational improvements and tax reform for the change. And Fox, for its part, chose the House of Mouse as its preferred suitor thanks to a combination of its enormous bid, superior strategic fit, the \"attractiveness\" of the equity portion of Disney's offer, and -- more pertinent to this article -- what it viewed as a lower risk that the purchase might fail in the face of regulatory scrutiny.Sure enough, Disney had already been working with antitrust regulators for months before making its final bid, and it later agreed to sell a portfolio of Fox's regional sports networks to help push the deal forward.As it turns out, Disney quietly closed on those sales in recent weeks, adding multiple billions of dollars to its coffers and effectively reducing the real cost of its blockbuster Fox acquisition in the process.IMAGE SOURCE: GETTY IMAGES.First, with the approval of the U.S. Department of Justice, exactly two weeks ago, Disney sold 21 regional Fox Sports networks -- representing the bulk of its previously agreed divestments -- to   for an aggregate price of $9.6 billion (after accounting for minority interests).Then last Thursday (Aug. 29, 2019), Disney followed by announcing the sale of its 80% equity interest in the YES Network to a group comprising the Yankees (or Yankee Global Enterprises, which already owned the remaining 20% of YES) as well as Sinclair,  , and a number of other smaller supporting investors at an enterprise value of $3.47 billion.The result? Disney is now free of the regional sports networks that would have otherwise prevented its massive Fox acquisition from closing earlier this year -- and it's more than $13 billion richer for its divestment efforts.It's unclear, however, exactly how Disney plans to use the net proceeds of these divestments. But whether it goes to paying down debt, funding the  that is its studios segment, improving its , creating original content for Hulu and its upcoming , or helping fuel capital returns initiatives, it's clear the move leaves Disney better positioned to lead the entertainment industry forward. And it should only help solidify Disney's status as a  for investors for years to come.Motley Fool co-founders Tom and David Gardner have spent more than a decade beating the market. After all, the newsletter they have run for over a decade, , has quadrupled the market.*Tom and David just revealed their ten top stock picks for investors to buy right now. Walt Disney  -- but there are nine others you may be overlooking.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["e finally have the details on 's  streaming offering, Disney+, and it seems pretty clear the House of Mouse is looking to shake up the streaming video.Set to launch in mid-November, the service will feature tons of recent and classic Disney films, as well as series specifically built for the platform. If Disney's rich intellectual property library wasn't enough of a boost to the new service, Disney+ is debuting at $6.99 per month in the United States. -- making it far cheaper than comparable streaming services from the likes of   and  .  In this video , we break down the major players in streaming video and talk about how their services play into each companies' overall strategy.{%sfr%}  Hi, and welcome to The Motley Fool's Bottom Line series. In this video, we're going to take a look at Disney's new video streaming service, called Disney+, and how it stacks up against the established competitors.Ever since Walt Disney's announcement of Disney+, fans and investors alike have been eagerly awaiting the latest entrant into the streaming wars.Disney+ is scheduled to launch on Nov. 12, and the company expects to have more than 100 recent films and over 400 older movies available within the first year.It's also developing 25 new series and movies that will be exclusive to the platform.The Disney+ programming will come from across the company's Marvel, Pixar, Lucasfilm, and Disney brands, as well as contributions from Fox and National Geographic.While creating an entirely new video streaming service is certainly a big move for Disney, how exactly does Disney+ stack up to its rivals?One of the most important differentiating factors between Disney+ and its competitors is its price. Disney+ costs just $6.99 per month in the U.S., and if you pay annually, it's only a $69.99 per year.The price includes four simultaneous streams, 4K video, ultra high definition (UHD), and high dynamic range (HDR) picture quality when available, all at no extra cost. And users also get unlimited video downloads.To put this into context, Netflix's premium plan, which offers some similar features, costs $15.99 a month, far more than Disney+. And Disney+ is cheaper than Amazon Prime Video -- the second-largest streaming service in the U.S. -- which costs $8.99 per month.In addition to its low cost, Disney will also offer a bundle of Disney+, ESPN+, and the ad-supported version of Hulu for just $12.99 in the U.S. Which will give viewers access to sports programming, the library of content from Disney, as well as original programming and broadcast shows from Hulu.But just because Disney will have the best video streaming deal doesn't mean it'll easily topple Netflix and Amazon's dominance.Netflix has 60 million paying subscribers in the U.S. and 91 million international subscribers. Meanwhile, Amazon's has more than 100 million Prime members in the U.S. that have access to the company's video streaming service.Subscribers aside, both Amazon and Netflix have spent years -- and billions of dollars -- creating their own original video content. For Netflix, spending huge sums of money to produce and license content -- including $15 billion in 2019 -- is a matter of survival.Netflix's entire business is built on video streaming, and it has to be the best at what it does in order to grow its top and bottom lines.For Amazon, video streaming is more of a side business that provides value to its Prime members and keeps its customers engaged with the company.While Disney has its theme parks, and its vast movie and TV empire, the company is betting that Disney+ will play an important role in controlling its own content, as well as forging direct relationships with its customers.Disney's CEO Bob Iger recently said that \"Disney+ marks a bold step forward in an exciting new era for our company....\"The bottom line is that Disney+ will likely be one of the most competitive video streaming services on the market. And even Netflix and Amazon will have a hard time matching Disney's stockpile of beloved characters and stories.No other company has been as successful at turning storytelling into such a lucrative business as Disney -- which is why Disney+ competitors should be worried.The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Fox Corp. (FOXA, FOX) and Charter Communications Inc. (CHTR) Monday said announced a long-term, comprehensive renewal of their distribution agreement for FOX's full portfolio of leading news, entertainment and sports networks. In addition, FOX and Charter will cooperate to mitigate piracy, implementing business rules to address unauthorized access to content.Michael Biard, President of Operations and Distribution for FOX commented: \"We are pleased that our renewed agreement provides Charter customers with continued access to our entire suite of networks and expands the ways in which they can access the FOX brands through additional video-on-demand and TV Everywhere platforms. We appreciate Charter's professional and collaborative approach throughout this process, and we look forward to expanding on our partnership in the days ahead.\" Added Tom Montemagno, Executive Vice President, Programming Acquisition for Charter: \"This agreement allows continued access to all of the FOX programming for our customers and FOX viewers, but it will also amplify our mutual efforts to address piracy and abusive password sharing issues. We appreciate FOX's desire to further collaborate as the video landscape continues to evolve.\"\n \nThe renewal covers distribution of the FOX Television Stations, FOX News Channel, FOX Business Network, FS1, FS2, BTN, and FOX Deportes. The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Twenty-First Century Fox, Inc. (FOX) released a profit for fourth quarter that decreased from last year.The company's earnings totaled $454 million, or $0.73 per share.  This compares with $471 million, or $0.76 per share, in last year's fourth quarter.Excluding items, Twenty-First Century Fox, Inc. reported adjusted earnings of $389 million or $0.62 per share for the period. The company's revenue for the quarter rose 5.0% to $2.51 billion from $2.39 billion last year.Twenty-First Century Fox, Inc. earnings at a glance:-Earnings (Q4): $389 Mln. vs. $416 Mln. last year.\n-EPS (Q4): $0.62 vs. $0.67 last year.\n-Revenue (Q4): $2.51 Bln vs. $2.39 Bln last year.\n The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["ver since  first announced plans for its new Disney+ service in late 2017, many industry watchers have understandably assumed the family-friendly streaming-media offering would be a shoo-in to directly challenge the dominance of established leaders in the space when it launches on Nov. 12, 2019.To be sure, earlier this week, shares of competitor   fell after CEO Reed Hastings admitted it will be a \"whole new world starting in November,\" pointing to Disney+ and other services set to provide \"tough competition\" for the attention of consumers.We've also seen signs Disney+ could be even ; recent early potential user surveys have indicated it could reach at least 60 million to 90 million subscribers -- and, in turn, achieved sustained profitability -- far earlier than Disney's initial 2024 target for the metrics. Then in late August, Disney opted to get a head start by offering all members of its D23 club (which has a free tier) a three-year subscription to Disney+ for just $141 -- that's less than $4 per month and well below its originally planned $6.99-per-month starting price.IMAGE SOURCE: WALT DISNEY CO.But make no mistake, the Disney+ hype machine is only just getting started.Disney hasn't offered specific numbers just yet for how many people seized that discounted three-year opportunity. But it seems to be working from a position of strength now; late Sunday, the company sent its first mass email containing a link for early interested users to preorder Disney+ at the regular price of $6.99 per month, or $69.99 (roughly $5.83 per month) for an annual membership.So why do I think Disney+'s marketing and early recruitment efforts are set to ramp up between now and its Nov. 12, 2019, launch date?Remember, Disney is arguably the most experienced business in the world when it comes to hyping the brands comprising its enviable , including not only its namesake studios, TV networks, and  but also Pixar, , Marvel, and a  (National Geographic among them) thanks to its recently closed $71 billion acquisition of most of the assets of .That's not to mention that Disney hasn't yet begun widely publicizing its separately announced $12.99-per-month bundle -- which is on par with the most popular pricing tier offered by Netflix -- that will include a combined subscription comprising Disney+, Hulu (of which Disney currently owns 70%, with a deal in place to  Comcast's remaining 30% stake), and ESPN+ (which  on its own this past February).In any case, if Disney follows the tried-and-true formulas it uses to promote its most popular blockbuster films and other entertainment products, I suspect we'll see marketing and preorder activity for Disney+ reach a fever pitch in the coming weeks -- just in time for the company to provide an encouraging update on its prelaunch progress during its next quarterly  in early November. Assuming Disney+ indeed hits the ground running with millions of subscribers ready to watch at launch, it could be just the spur Disney bulls need to drive the stock to new heights.Motley Fool co-founders Tom and David Gardner have spent more than a decade beating the market. After all, the newsletter they have run for over a decade, , has quadrupled the market.*Tom and David just revealed their ten top stock picks for investors to buy right now. Walt Disney  -- but there are nine others you may be overlooking.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Twenty-First Century Fox, Inc. (FOX) will host a conference call at 4:30 PM ET on Aug. 07, 2019, to discuss its Q4 19 earnings results. To access the live webcast, log on at investor.foxcorporation.com The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["ox Corporation (FOX) will begin trading ex-dividend on September 03, 2019. A cash dividend payment of $0.23 per share is scheduled to be paid on October 02, 2019.  Shareholders who purchased FOX prior to the ex-dividend date are eligible for the cash dividend payment.  At the current stock price of $32.45, the dividend yield is 2.84%.The previous trading day's last sale of FOX was $32.45, representing a -22.24% decrease from the 52 week high of $41.73 and a 3.74% increase over the 52 week low of $31.28.FOX is a part of the Consumer Services sector, which includes companies such as Sirius XM Holdings Inc. (SIRI) and Spotify Technology S.A. (SPOT).  For more information on the declaration, record and payment dates, visit the  page. Our   has the full list of stocks that have an ex-dividend today.The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["n early trading on Friday, shares of Fox topped the list of the day's best performing components of the Nasdaq 100 index, trading up 0.6%. Year to date, Fox has lost about 6.7% of its value.\n\nAnd the worst performing Nasdaq 100 component thus far on the day is Electronic Arts, trading down 5.7%. Electronic Arts is showing a gain of 17.2% looking at the year to date performance.\n\nTwo other components making moves today are Activision Blizzard, trading down 3.0%, and FOXA, trading up 0.5% on the day.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["egendary investor Warren Buffett advises to be fearful when others are greedy, and be greedy when others are fearful.  One way we can try to measure the level of fear in a given stock is through a technical analysis indicator called the Relative Strength Index, or RSI, which measures momentum on a scale of zero to 100.  A stock is considered to be oversold if the RSI reading falls below 30.\n\nIn trading on Thursday, shares of Fox Corp (Symbol: FOX) entered into oversold territory, hitting an RSI reading of 29.8, after changing hands as low as $33.10 per share.  By comparison, the current RSI reading of the S&P 500 ETF (SPY) is 37.2.  A bullish investor could look at FOX's 29.8 RSI reading today as a sign that the recent heavy selling is in the process of exhausting itself, and begin to look for entry point opportunities on the buy side.    The chart below shows the one year performance of FOX shares:\n   \n   \n\nLooking at the chart above, FOX's low point in its 52 week range is $32.50 per share, with $42.50 as the 52 week high point — that compares with a last trade of $33.22.  \n\n\n\n\n\n\n\n\n\t\t\n\n \nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Twenty-First Century Fox, Inc. (FOX) will host a conference call at 4:30 PM ET on Aug. 07, 2019, to discuss its Q4 19 earnings results. To access the live webcast, log on at investor.foxcorporation.com The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["(RTTNews) - Fox Corporation (FOXA, FOX) will present at the Bank of America Merrill Lynch 2019 Media, Communications & Entertainment Conference.The event is scheduled to begin at 5:20 PM ET on Sept. 11, 2019.To access the live webcast, log on to investor.foxcorporation.com The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], [" shares  nearly 10% after the company reported earnings on July 25. The company beat its earnings guidance, but overall revenue dropped and its streaming network lost subscribers.None of these metrics matter all that much, though, as  investors will have nothing to worry about for a little over five years. That's the length of the self-identified \"sports entertainment\" brand's new television deals with  and . Those deals essentially double what WWE earns for U.S. television rights, more or less ensuring larger profits for the company.For investors, though, the real story isn't told by earnings -- it's about where the company's underlying popularity stands in five years when those deals come due.Seth Rollins has been one of the top WWE stars. Image source: WWE.WWE has seen its popularity fall to all-time lows right before its rights increases kick in. That puts a lot of pressure on company executives to turn things around. The flagship has seen ratings drop, but it still puts up very strong numbers for the U.S., which is where the show will continue to air.however, will be moving to FOX and airing in prime time on Fridays from 8-10 p.m. Being on network television increases the potential audience, but the company will need to deliver about 3 million viewers for the show each week to be considered a success.Hitting those numbers would mean reversing current trends. The company laid out its numbers in its second-quarter earnings release:Domestic TV ratings for  declined 14% in the first quarter 2019 from the prior year quarter but improved to a year-over-year decline of 11% in June. The improvement in June occurred despite a tough comparison to game 5 of the NBA championship on Monday, June 10. Similarly, domestic TV ratings for  declined 13% in the first quarter 2019, but improved to a decline of 7% in June, consistent with the ratings performance of the top 25 cable networks, which declined 7% during the month.Live attendance has also fallen, dropping by 12% in Q1 and 2% in Q2. In its first-quarter , the company blamed falling ratings and the attendance drops on the absence of several of its name personalities. But the reality is that WWE simply has not made new stars on the level of the ones it has lost, including John Cena (who still makes occasional appearances) and Dwayne \"The Rock\" Johnson.WWE popularity may have hit a low point, but wrestling has always been a cyclical business. The company may benefit from the fact that the pseudo sport itself may be on a major popularity upswing.A number of smaller companies have built significant followings, and All Elite Wrestling (AEW), a start-up funded by Jacksonville Jaguars-owner Shad Khan, has secured its own weekly prime time show on TNT beginning in October.AEW, which has sold its first few major shows without a TV deal, may take viewers from WWE. It could also bring back lapsed fans, and create new ones who may eventually check out WWE.The wrestling war of the 1990s actually made the whole sport more popular. That could happen here, or WWE might step up its game to defend its position as the clear market leader.WWE has to deliver enough ratings to keep FOX and Comcast happy. That means creating more fans, finding/building performers who connect with their audience, and regaining some lost popularity. That's daunting but not impossible, and having competition has historically been a positive for the company.As an investor, however, it's important to see the big picture. Quarterly earnings will increase due to the TV deals even if attendance keeps falling. But that's not the key metric -- the numbers that matter are the ratings for and.If those get stronger (or at least stabilize in Raw's case), the company will be able to get strong -- maybe even stronger -- deals five years from now. That's the finish line for the company, and really the only thing long-term shareholders should be considering.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has quadrupled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and World Wrestling Entertainment wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Marvel's \"Shang-Chi\" – the studio's first Asian superhero movie – is a sign of the times.Destin Daniel Cretton, who is of Asian descent, will be directing the film, which will feature a Chinese superhero who originally appeared in one of Marvel's 1973 comics.As a bilingual screenwriter with projects in the U.S. and China, I see \"Shang-Chi\" as yet another example of an exciting trend in Hollywood.More than ever before, studios are realizing that diverse casts and stories are just as profitable – if not more so – than the traditional Western narratives that dominated Hollywood for decades.When pitching a film to studios, writers and producers will commonly use what are called \"comps.\" These examples of previously released films that are similar in style or content bolster the feasibility of a film project; if a version of a pitched script has been successfully pulled off in the past, the studio might worry less about sinking money into it.A dearth of financially successful comps with diverse lead casts has made it tough to pitch films with nonwhite main characters. And that's one of the reasons why inclusive stories were only sporadically green-lit for major studio productions.For years, if you were to pitch a story to a major studio with an all-Asian cast, you would have had almost no comps other than \"Joy Luck Club.\" That critically acclaimed film pulled in US$32.9 million at the U.S. box office on a $10.5 million budget. While that's a respectable profit, it was no blockbuster, and it didn't trigger an onslaught of movies starring Asians.Then \"Crazy Rich Asians\" happened. The 2018 romantic comedy wildly surpassed expectations by earning $238 million around the world with a $30 million budget, making it the top-grossing romantic comedy in 10 years, surpassing both \"The Proposal\" and \"Sex and the City: The Movie.\"Other successes have followed. \"To All the Boys I've Loved Before\" features a Korean American teenager whose secret love letters are mailed to her crushes. \"Always Be My Maybe\" is about two Asian American childhood friends who fall for each other as adults.The same thing is happening with films that feature African American leads.Just in the past few years, \"Get Out,\" \"Us\" and \"Black Panther\" were blockbusters that starred black lead actors.Now, any screenwriter who wants to pitch a horror and superhero movie starring black actors or a romantic comedy with Asian characters has a handful of highly profitable comps at their disposal.Some claim the lack of representation on screen could be attributed to a simple fact: Movies need star power, and very few A-list movie stars were people of color.Aside from actors like Denzel Washington or Jennifer Lopez, it was rare for an actor of color to be able to \"carry\" a film. That reasoning doesn't hold water anymore. Today, Dwayne \"The Rock\" Johnson, who identifies as black and Samoan, is the world's highest-paid movie star.But one of the interesting aspects of films like \"Crazy Rich Asians\" is that they were huge successes at the box office without any marquee movie stars.This has done two things: It showed studios that star power isn't as necessary as it was once thought to be. And it has allowed a new crop of diverse actors to emerge, with these films acting as a springboard to stardom.Studios have since realized it's less of a financial risk to hire unknown actors, who they can then cultivate and, if all goes well, leverage for future projects. is doing just that with talents like Ali Wong. After two successful Netflix stand-up comedy specials, she co-wrote and starred in her first feature role in \"Always Be My Maybe\" for the studio.The same thing happened to Daniel Kaluuya of Universal Pictures' \"Get Out.\" Before the film, he was a relative unknown. Now he's starring in the upcoming \"Queen and Slim\" from the same studio.But why is all of this happening now?Ticket sales at U.S. cineplexes are at a six-year low, while marketing costs are soaring. As a result, studios are increasingly relying on international markets to reach profitability. Films like \"Coco\" – which is set in Mexico – and \"Fate of the Furious\" – which features Hispanic and African American lead actors – have global appeal.The most tantalizing market is China.\"Coco\" is the highest-grossing animated movie ever in China; it pulled in $189 million at the box office, which almost matched the $209 million it earned stateside. And \"Fate of the Furious\" actually made $392 million in China, easily overtaking the $226 million it earned in the U.S.China is presently Hollywood's biggest foreign market. According to projections by PricewaterhouseCoopers, this year the Chinese box office will rake in $11.05 billion, compared to ticket sales in the U.S. of $12.11 billion. Next year, however, China  expected to surpass the U.S. for the first time and be crowned the world's largest film market.Chinese audiences love superhero flicks. \"Avengers: Endgame,\" for example, earned more than $600 million in China alone. But films with modest budgets can also do well there. With a $10 million budget, the 2016 Bollywood hit \"Dangal\" made $193 million in China, almost tripling its $77 million take in India.As for the future? 's upcoming live-action \"Mulan,\" which is based on a classic Chinese folk tale with an all-Chinese cast and a budget exceeding $100 million, has the potential to shatter box office records.For too long, doors to mainstream Hollywood have been closed off to stories set in diverse cultures and precluded inclusive lead characters in popular movies.But now, thanks to a powerful , those doors are cracking open and studios are rolling out the red carpet.The result is happy shareholders and, for audiences, refreshing stories that more accurately reflect the world we live in.The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["Over the past three months,  (NYSE:) stock has rewarded shareholders well. I believe that shares of Disney, the leading entertainment and broadcasting company, belong in a diversified long-term portfolio, as the company has an extremely strong global entertainment brand and exciting growth prospects in streaming media. Year to date, DIS stock is up 29%.\nSource: Shutterstock\n\tHowever, it may now be time for investors to take some of the impressive paper profits in Disney shares. In the next several weeks, I expect DIS stock to be volatile and Disney stock price to decline, possibly until the company’s next earnings report in . Here are the most important things that investors should know about DIS and Disney stock.There are  that may help Disney stock price reach new highs in the coming quarters. One of them is its diversified and robust revenue streams, spanning across multiple geographies. The conglomerate also enjoys tremendous  globally.Four segments generate Disney’s revenue:On May 8, the company  for its second fiscal quarter. It logged revenues of $14.9 billion on earnings per share of $1.61 and beat analysts’ estimates on both the top and bottom line.Results from its  operating segments varied. CEO Bob Iger highlighted higher affiliate revenues from ESPN, as well as the popularity of its domestic theme parks. DIS also said that it  would be repositioning itself towards direct-to-consumer  services.Now shareholders would like to see another strong quarter when Disney reports earnings, expected on Aug. 6.For all four segments, there have been many positive developments this year.This year’s  for Disney is quite impressive. In April, Disney stock price  when the company said that the opening of Avengers shattered box office records.Memorial Day weekend saw moviegoers fill up theaters nationwide to watch the live-action remake of  Aladdin, as the  $112.7 million at the box office — a Memorial Day record.Following the $2 billion Avenger success story, the positive reception of Aladdin by the public is rather important because it could set the stage for Disney to further update its other iconic movies for the younger generations and their parents.Management has recently pointed out that, despite the trade tensions, many movies are seeing huge interest in .Meanwhile, Disney’s  increasing attendance rates and higher guest spending, leading to double-digit revenue growth. And devoted  have not hesitated to wait up to ten hours in line to ride the new roller coaster. Therefore, analysts are expecting another stellar year for the parks.The company’s new streaming service, Disney+,  and will include original movies and TV shows from Disney’s brands, including ABC, A&E, Disney Channel, Disney Studio, Fox Assets, Lifetime, Marvel, National Geographic, Pixar, Star Wars and The History Channel.In the U.S., the service, which is likely to appeal to a wide range of viewers, will cost $6.99 a month or $69.99 a year.  And the global launch of Disney+ will start in early 2020.Analysts expect  (NASDAQ:) to be  by the launch, as DIS is removing its movies from Netflix. At present, Netflix needs to constantly produce original content or license content from other providers. Hence, Netflix has sizeable content costs.Netflix’s most popular plan, the Standard tier, costs $12.99 a month, or twice the expected price of Disney+. It will be interesting to see how this price differential will affect the choice of subscribers.Could there possibly be a price war around the corner that could benefit the U.S. consumer? And could Disney+ potentially cost Netflix an important portion of its user base?Disney’s ESPN+ platform, the DTC sports entertainment video service, currently has over  subscribers. And the company expects that total to reach .In March 2019, Disney also  of some of — or, as it is now called,  (NASDAQ:, NASDAQ:) — assets. The deal has given Disney access to Fox’s popular film production businesses, including 20th Century Fox, Fox Searchlight Pictures, and Fox 2000, as well as Fox’s television businesses., who has been credited with building up , is upbeat about the positive effects of Fox’s popular franchises and branded content on Disney’s ecosystem. After this acquisition, Disney  , another . Hulu is expected to have mostly adult content as opposed to Disney+, which will focus on kids and will not even feature any R-rated movies.In other words, as of 2020, DIS will be able to stream the combined content library of Disney and Fox over three platforms: Disney+, ESPN+ and Hulu. And their combined momentum may very well push Disney stock to new highs. how a prolonged trade war between the U.S. and China could adversely affect Disney stock price. I’d like to highlight that Wall Street has also voiced concern that the U.S., as well as the global economy, could be headed for an .DIS is a . Prices of cyclical stocks tend to follow the business cycle. And, during prolonged economic downturns, cyclical stocks suffer. Let’s briefly remember how the economic downturn of a decade ago affected DIS stock.In July 2009, Disney’s quarterly profits  as the company said it  was “hurt by soft advertising sales at ABC and ESPN and dropping consumer spending at Disney World. The company also continued to suffer from a creative slump at its film studio.”During downturns, many businesses . Because Disney depends on advertising dollars, during an economic contraction, maintaining positive revenue, strong margins, and earnings growth might become difficult for DIS. Over time, share prices and earnings expectations tend to move in tandem.Hollywood  about how an upcoming recession may affect its results. Given that DIS is a conglomerate that makes and distributes movies, will Disney and Disney stock be immune to an economic decline? An economic downturn may adversely affect Disney’s sales, particularly in Consumer Products as well as Parks & Resorts segments.In 2019, Disney stock has caught the attention of investors. On Apr. 11, prior to Disney’s investor day presentation, the share price closed at $116.60. The next morning, DIS stock gapped up to open at $127.91. Then, on April 29, DIS stock reached what was then an all-time high of $142.37.In early May, Disney stock gave back back some of its April gains, mirroring the stock market’s volatility. On May 31, the stock saw $130.78. June has once again been good to shareholders, as the stock reached an all-time high of $142.95.So what is next for Disney stock, especially given that we have a fundamentally strong stock that might be making a double top in the technical charts?As a result of the recent impressive run-up of DIS stock, short-term technical indicators have become overextended. Investors who pay attention to s should note that Disney stock has become “overbought.”Therefore, between now and Disney’s next earnings report in early August, there is likely to be some profit taking in Disney shares.In such a case, DIS stock price could fall to the $130 area. If there is any further volatility and decline in the broader markets or the industry, then Disney could fall even further, toward $115, where Disney stock has major support. Then DIS may trade sideways between $115 and $125.It’s almost impossible to time a top and a bottom in the markets. However, it may be timely to take some of the paper profits in Disney stock. Alternatively, you may want to hedge your long stock position with a covered call that expires on July 19. That expiration date would give you enough time to evaluate your position prior to Disney’s upcoming earnings.Finally, if you are not yet a Disney shareholder, you may use any dip in the stock price to buy into the shares.Within the past decade, the entertainment marketplace has been changing, as we have witnessed the impressive growth of streaming and mobile video. Disney has been adding to its  entertainment empire, and I regard DIS stock as one of the key media and entertainment names to buy for value and future growth.However, the rest of June and July may bring further volatility to the stock market and I am expecting Disney stock to be hurt by further short-term profit taking.Long-term investors may want to use any potential price declines, especially around the $115- $125 level, as opportunities to buy DIS stock. Those who buy Disney stock will also benefit from its dividend, which provides a yield of 1.25%. In three to four years, patient shareholders are likely to be rewarded handsomely by DIS stock.As of this writing, Tezcan Gecgil did not hold a position in any of the aforementioned securities.The post  appeared first on .The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["ooking at the underlying holdings of the ETFs in our coverage universe at , we have compared the trading price of each holding against the average analyst 12-month forward target price, and computed the weighted average implied analyst target price for the ETF itself. \tFor the Invesco Russell 1000—Size Factor ETF (Symbol: OSIZ), we found that the implied analyst target price for the ETF based upon its underlying holdings is $31.46 per unit.\n\n\nWith OSIZ trading at a recent price near $28.66 per unit, that means that analysts see 9.79% upside for this ETF looking through to the average analyst targets of the underlying holdings.   Three of OSIZ's underlying holdings with notable upside to their analyst target prices are Fox Corp (Symbol: FOX), Jazz Pharmaceuticals plc (Symbol: JAZZ), and Sage Therapeutics Inc (Symbol: SAGE). Although FOX has traded at a recent price of $37.69/share, the average analyst target is 27.35% higher at $48.00/share. Similarly, JAZZ has 25.71% upside from the recent share price of $138.76 if the average analyst target price of $174.44/share is reached, and analysts on average are expecting SAGE to reach a target price of $204.40/share, which is 25.25% above the recent price of $163.20. Below is a twelve month price history chart comparing the stock performance of FOX, JAZZ, and SAGE:  \n\n   Below is a summary table of the current analyst target prices discussed above:\n\nAre analysts justified in these targets, or overly optimistic about where these stocks will be trading 12 months from now? Do the analysts have a valid justification for their targets, or are they behind the curve on recent company and industry developments? A high price target relative to a stock's trading price can reflect optimism about the future, but can also be a precursor to target price downgrades if the targets were a relic of the past. These are questions that require further investor research.  \n\n\n \nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], [" (NYSE:) is an old and well-established dog, but one that is learning an important new trick. Today we highlight the potential upside opportunity of the addition of more streaming to its family of products — adding Disney+ to ESPN+. This should take Disney stock to a new level.Source: Shutterstock\n\tInvestors have already started the process, which is evident from DIS stock’s incredible rally since March. Year to date Disney is up 30%, which is almost double that of the Dow Jones. So clearly it is in favor on Wall Street.It is tempting to short such a steep rising wedge, but that would be a mistake in the long run. Disney’s new streaming platform will change the game for this company and its bottom line. In fact, it is not too late to add DIS shares into portfolios. (NASDAQ:) is the disruptor that made consumers want to consume media in a brand new way. First NFLX started by sending us DVDs by mail, and it had its devout following from the get-go. But then sneakily they switched us all to streaming and we loved it. Sure, they’ve had their fair share of flubs with pricing but eventually management proved itself competent to grow into the giant it is now.Disney stands to benefit from that starting this year.So we now know some facts. First, the world wants the media to come to their devices whether it be smartphones , tvs or tablets.Second, we also know that the delivery method via streaming is the way to go. Most households now have internet connections that are fast enough to accommodate the trend. Moreover, we have 5G coming to make that even more ubiquitous.So it comes down to content, and Disney has gobs of it. Once they turn the service on, the revenues will flow. And with a good cost basis, the profits should also grow exponentially.There is not one person on this planet that doesn’t know Disney’s characters, from Mickey Mouse to Darth Vader. It has a huge library of very successful movies that people watch over and over again. And soon they will leverage that by making them available 24/7 from almost anywhere.The new platform could become the stand-in babysitter for most parents. Regardless of what other forms of entertainment families choose, the Disney streaming application will be among them.It is important to note that it won’t come down to choosing a winner here. There’s enough room for Netflix and Disney to thrive, so each thesis stands on its own.Netflix stock is stalled for now. Disney is just starting. They just need to turn on the spigot and let the content flow.Disney+ pricing sounds like it’s low enough that the signup rate will exceed expectations, and that will make investors grab for more shares, and the rally will continue.So this is an operational effort for DIS stock once the decision was made to actually do it. Turn it on and the viewership will grow. Going forward, they know how to produce content at a lower cost than their competition, and much of it is very successful. This new delivery method will merely make them more profitable.The ramp in Disney stock is steep, but not enough to warrant shorting it at this point. So is it a buy here? The answer is yes, especially if for the long term.The truth is that DIS stock has always been a buy. It is one consistent performer that rewards its holders well through thick and thin.For the investors who prefer to trade around the shorter-term gyrations in the stocks, these are our levels to know.If DIS stock can set a new high at $143.50 it could start another bullish burst to target $155 per share. The rising wedge also raises the risk of falling back to the $135 zone if the June trend fails.It is also important to note that if the general equity markets fail in a big way, DIS stock has an open gap to $119 per share that could fill. Although this is not my forecast, it is a scenario that exists.In summary, the Disney story is just starting a new chapter, one that starts soon and will raise eyebrows on Wall Street. I would want to already be long when people realize that the upside potential is even greater than anticipated.Nicolas Chahine is the managing director of . As of this writing, he did not hold a position in any of the aforementioned securities. Join his live chat room free .The post  appeared first on .The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["I remember times when  (NASDAQ:) hogged the headlines for weeks on end. These days, Wall Street is more preoccupied with cannabis stocks, or initial public offerings (IPOs) like (NYSE:) and, more recently,  (NASDAQ:). While it’s no longer in the limelight, NFLX stock is silently making moves in the background.Source: Shutterstock\n\tIt has been consolidating for a long while. But the opportunity today is with the levels where this action is taking place.Netflix stock is trading inside a range to establish a base camp that could catapult shares of NFLX $100 higher. Yes, it could still make a move to the high $400 per share. This opportunity is technical, so I would label it as tactical with medium conviction. It is independent of the company’s current value and its odds of long-term success.Since March 2018, Netflix stock has used $335 per share area as a major pivot. A year ago, the bulls broke NFLX out of that pivot. But then the fall correction reversed that move and sent NFLX shates the other way into its December lows.Then NFLX bounced off the lows very sharply and has spent all of 2019 consolidating around the same $335 per share zone. This is not a hard line in the sand but rather a band where bulls and bears are fighting it out fiercely. The end result of this stalemate will be a big move but where the direction is still unknown.If the equities in general rally, I bet Netflix will break out from these clutches. The exciting part comes from the fact that this would be a bullish inverse head-and-shoulder pattern that would result in a $100 move. This would be the opposite pattern to the one that crashed the stock last October from almost the same zone.This year, the bulls are in control of the stock market. Yes, we’ve had our bearish stints but the bulls bought the dips. While sentiment is not perfect, especially since we have an ongoing trade dispute between the U.S. and China, the U.S. Fed is now on the side of equities.This recent swoon is a perfect example. When the  fell on Trump’s Mexicican tariff tweet, traders followed up that reaction with the best week of the year. The bears are unable to sustain the selling and that’s why the stock market is are near all-time highs.This helps Netflix stock in deciding which way the move will go from this tight situation. If the near- to long-term price action trends higher, then NFLX stock is likely to break out. Once Netflix shares pass the last fail level, momentum buyers would come into play.This is still a momentum stock so when it catches a wind it accelerates in that direction. So then buying begets more buying. Those who chase it like to buy high and sell higher.There are short-term lines to know …Above $385 per share would be the best trigger for this move. But there will be resistances at $367 and $372. I know this sounds impossible, but as we’ve seen the rally in December, NFLX stock can move 40% in a matter of days.Conversely, below $332 per share would invite sellers so traders should set tight stops unless they plan on turning this trade into an investment. I prefer selling puts below current support to trade moves like this where the breakout is not guaranteed especially when we have so many geopolitical headline risk completely independent of NFLX itself.So what about its fundamentals? This is not a cheap stock. It sells at a 129 price to earnings ratio. But as long as it continues to be a growth stock investors need not judge its profitability. The bullish thesis on NFLX is that it has a massive addressable  and that it’s only begun to scratch the surface.The company has its critics and they are loud and proud. They offer excellent reasons to short it. NFLX spends too much on producing content. They also could have a problem with churn. Although they still have the first mover advantage, competition is nipping at their heels. Normally I wouldn’t worry about that yet but this bunch scary potential foes. (NYSE:) is the closest to go head to head and it comes with major advantages. I worry that Netflix management doesn’t give DIS enough respect. Every parent on the planet will want to subscribe to Disney’s stream because every child on earth will demand it. Luckily for NFLX is that they are both cheap enough that parents may not need to choose between the two yet.Moreover, NFLX ace in the pocket is its content but it comes at a tremendous expense. So they borrow to feed the beast and luckily that rates are not going anywhere for a long while so that’s not an imminent danger. But DIS already has content that people want and they do produce new versions much cheaper so they will be able to compete on margin if it comes to it.While I do sound like I am making an anti Netflix argument here, I am not. I do believe that NFLX needs a few miracles to go their way in the long term, here I see a potential rally that could deliver a ton of profits. So I set my alerts to chase it.Nicolas Chahine is the managing director of . As of this writing, he did not hold a position in any of the aforementioned securities. Join his live chat room free .The post  appeared first on .The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], [" (NYSE:) is known as the happiest place on earth and for a while this year, Disney stock was one of the happiest stocks on Wall Street. DIS is up 35% in a year, while the  is almost flat.Source: \n\tClearly, investors love owning Disney stock for now.The bullish thesis for DIS has been consistently based on the slam dunk success of its movies and parks. There were issues around the cord-cutting panic, but investors have finally come to terms with those fears.Now, the incremental element to that thesis is the expectations for DIS’s new streaming service to rival  (NASDAQ:). Bulls have few reasons to fret the event. DIS already owns a ton of content, so it’s a matter of installing a spigot, then turning it on.Preliminary pricing information suggests that it’s going to be cheap enough that it won’t even have to compete with NFLX. Most people will end up with both services for a while at least.But even if it did have to compete with the Goliath, I think that DIS won’t be a David. It will be a threat to NFLX instantaneously. But they can both coexist because of the diverse content that they produce. The advantage that Disney has is that it can produce its contents much cheaper than the extravagant sums that NFLX spends on its productions.Streaming is global so the addressable market is massive. Netflix has the first mover advantage from the streaming perspective … but does it? I contend that Disney was the first mover since no one on the planet doesn’t know Mickey Mouse. So reaching their audience will not be a problem for DIS.The incremental contribution to the Disney P&L is so potentially huge that I don’t think we can accurately evaluate it now. DIS stock sells at a trailing price-to-earnings ratio of 15X. So it’s already cheap in absolute terms and it’s nine times cheaper than NFLX. All of this means that upside in the stock price is almost a guarantee.Although I’m optimistic about DIS stock in the long term, I’m still apprehensive about the immediate price levels. I just don’t like chasing a stock that left a gap below as big as DIS did in April.I realize that there are upside catalysts looming just above current levels, so there definitely are important lines to watch in both directions for the short term. But for those who want to own it for the long term, they need not worry about these gyrations around the gaps.For the rest, I bet that Disney stock fills the gap below as soon as it loses $130.40. This would invite momentum sellers that would quickly target $120 per share. Conversely, if the bulls can break through $136.50, then it could invite buyers to retest the all-time highs. Meanwhile, DIS stock is in no-man’s-land for the short term.While I realize that not every chart gap fills, I just am uneasy about initiating a full long-term position in DIS with this giant void below. So I should either wait for a better entry point or at most take half of a position to start. This would leave room to add on dips.Yes, I’m confident that the DIS fundamentals are solid, but I still have to account for headline uncertainty. The U.S. is not done fighting its economic war with China and now it may be opening two new fronts with Mexico and India. So there are external reasons to worry about the effects on the DIS stock price.The bottom line is that Disney stock is headed higher over time. Holding it long here is a solid investment. But I still should pick my entry points as cleverly as possible and I just can’t fully commit all at once with a giant chasm below.Nicolas Chahine is the managing director of . As of this writing, he did not hold a position in any of the aforementioned securities. Join his live chat room free .The post  appeared first on .The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["fter more than three years with its stock stuck in neutral, it seems   can do no wrong. The House of Mouse has already produced several movies this year that have accumulated more than $1 billion each on box office receipts, and the company now has bragging rights to the highest-grossing film in history. This has helped push the stock up more than 45% since late last year. If that weren't enough, the company has now broken the record for all-time global box office achieved by any studio, raking in $7.67 billion in ticket sales, eclipsing its own record of $7.61 billion set by Disney in 2016 -- and there are still five months remaining in 2019. The photo-realistic re-imagining of  put Disney over the top. Image source: Disney.Disney has been on fire this year. Of the four movies that have grossed more than $1 billion in ticket sales, three -- , , and  -- belong to Disney. The fourth,  is owned by , but was co-produced by Disney-owned Marvel Studios. Two other Disney titles --  and  -- are on their way to topping the $1 billion benchmark. The five Disney titles alone have netted more than $6.8 billion in ticket sales.  On another important note,  recently achieved the record for  for a movie, generating $2.79 billion.If  and  are successful in their climb to $1 billion at the box office -- and many believe it's just a matter of time -- Disney will also set a new watermark for the number of films released in one year by a single studio to surpass $1 billion plus in ticket sales -- vaulting past a record it set back in 2016 with four.With the recent acquisition of Fox studios under its belt, Disney now accounts for about 45% of the more than $16 billion that consumers have spent at the movies.That percentage could also rise. Disney has a number of potential blockbusters waiting in the wings, including  and . When  was released in 2014, it became the highest grossing animated film of all time, ending its run with more than $1.27 billion in receipts. Likewise, when  was released in 2017, the previous chapter in the Skywalker saga earned $1.33 billion, while its predecessor --  -- topped $2.07 billion.Disney is counting on the latest installments of these successful franchises to add to its growing tally.At Comic-Con early this month, Disney laid out the  -- 11 upcoming projects, with six feature films and five series scheduled to debut on Disney+, the company's upcoming streaming offering.Disney's unrivaled treasure trove of intellectual property, which includes Pixar, Marvel, Lucasfilm, and Disney studios, combined with the recently acquired assets of Fox, provides the company with an unparalleled collection of stories and characters that will help the House of Mouse dominate the box office for years to come.When investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, , has quadrupled the market.*David and Tom just revealed what they believe are the  for investors to buy right now... and Walt Disney wasn't one of them! That's right -- they think these 10 stocks are even better buys.  The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], ["s the saying goes, there are many possible reasons for an insider to sell a stock, but only one reason to buy — they expect to make money. So let's look at two noteworthy recent insider buys.\n\nOn Monday, Fox Corp (FOX)'s Chairman, Keith Rupert Murdoch, made a $20.56M buy of FOX, purchasing 600,000 shares at a cost of $34.27 each. Bargain hunters are able to pick up FOX at a price even lower than Murdoch did, with shares trading as low as $33.68 in trading on Tuesday — that's 1.7% below Murdoch's purchase price. Fox Corp is trading down about 0.1% on the day Tuesday. This buy marks the first one filed by Murdoch in the past twelve months.\n\nAnd at Occidental Petroleum Corp (OXY), there was insider buying on Monday, by CEO Vicki A. Hollub who purchased 37,460 shares at a cost of $48.15 each, for a total investment of $1.80M. Occidental Petroleum Corp is trading up about 0.9% on the day Tuesday. Hollub was up about 1.4% on the buy at the high point of today's trading session, with OXY trading as high as $48.82 at last check today.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."]], "Title": ["Why Fox Needed to Acquire Tubi to Compete in Streaming", ["Why Fox Needed to Acquire Tubi to Compete in Streaming"], ["Analysts Expect 11% Upside For The Holdings of MGV"], ["3 Ad Stocks Missing Sports More Than We Are"], ["BUZZ-U.S. STOCKS ON THE MOVE-Tesla, Carnival Corp, Opiant Pharmaceuticals"], ["Apple Buys Virtual-Reality Startup NextVR"], ["Where's the 'Rain Check' for Missed Sports on TV?"], ["Why Fox Shares Rose 13% in May"], ["Why These Media Stocks Fell on Wednesday"], ["Fox Corporation Q3 adjusted earnings Beat Estimates"], ["Fox Corporation Stock Rises After a Strong Earnings Report"], ["Sports Broadcasts Are Somehow Still Getting Pricier"], ["Why Fox Corporation Stock Tumbled Today"], ["Analysts Expect MGC To Hit $113"], ["Fandango's Vudu Deal and the Digital Media Marketplace"], ["Why Fox Corporation Stock Was Headed Higher on Tuesday"], ["Why Eros International Stock Is Climbing Higher Again Today"], ["7 Media Stocks That Will Power Higher After the Pandemic Subsides"], ["AT&T's Streaming Television Hopes Hinge on These 2 Simple Details"], ["Nasdaq 100 Movers: WBA, SBUX"], ["Is Comcast Stock a Buy?"], ["With Fox's Acquisition of Tubi, Let the AVOD Wars Begin"], ["Roku Offering Month of Free Service to 20 Premium Channels During Pandemic"], ["How Fox's Partnership With TransUnion Is Ultimately a Win For ... Comcast?"], ["Looks Like Roku Shareholders Can Breathe a Sigh of Relief (for Now)"], ["Ex-Dividend Reminder: Israel Chemicals, Yum China Holdings and Fox "], ["Fox Corp. To Buy Streaming Service Tubi For $440 Mln In Cash "], ["Why Fox Corporation Stock Jumped on Monday"], ["How The Parts Add Up: MGV Targets $94"], ["Fox Corp Will Acquire Tubi to Enter the Streaming Wars"], ["Why Disney, Fox, and Comcast Shares Plunged Today"], ["Why Comcast's Peacock Will Be a Winner (and It's Got Nothing to Do With Coronavirus)"], ["Twenty-First Century Fox, Inc. Q2 adjusted earnings of $0.10 per share"], ["Relative Strength Alert For Fox "], ["4 Top Stock Trades for Tuesday: AMZN, ROKU, YETI, ZM"], ["Twenty-First Century Fox Q2 20 Earnings Conference Call At 4:30 PM ET "], ["Roku's Fox Blackout Threat Is a Sign of Strength"], ["Roku's Stock Tumbles as Its Battle With Fox Spills Over Into Super Bowl Weekend"], ["Twenty-First Century Fox Q2 20 Earnings Conference Call At 4:30 PM ET "], ["Agree To Buy Fox Corp At $30, Earn 1% Annualized Using Options"], ["What the Super Bowl Can Teach Us About TTD Stock"], ["Why WWE May Not Belong in Your Retirement Portfolio"], ["How Safe Is WWE and Its Dividend?"], ["World Wrestling Entertainment Shares Hit Rock Bottom in 2019, but Can It Kick Out of the Slump?"], ["Why Fox Corporation Stock Gained 12% in November"], ["3 Big Stock Charts for Tuesday: Amazon, Fox, and Whirlpool"], ["Fox Authorizes $2 Bln Share Buyback Plan "], ["Fox Agrees To Buy 3 TV Stations From Nexstar For $350 Mln "], ["Why Shares of Fox Corp. Are Gaining Today"], ["2 Consumer Stocks That Turned $250 Into Over $1 Million"], ["Twenty-First Century Fox Q1 20 Earnings Conference Call At 4:30 PM ET "], ["Consumer Sector Update for 10/28/2019: ROKU,WBA,TIF,TGNA,FOX,FOXA,NXST"], ["Can WWE Get Up Off the Mat When It Reports Earnings?"], ["What's a Special Dividend? (And Can You Predict When They'll Come?)"], ["Consumer Sector Update for 10/28/2019: WBA,TIF,TGNA,FOX,FOXA,NXST"], ["Twenty-First Century Fox, Inc. Q1 adjusted earnings of $0.83 per share"], ["TEGNA, Fox Reach Multi-year Carriage Deal - Quick Facts "], ["DISH Reaches Multi-year Carriage Agreement With Fox "], ["Credible Labs Stockholders Approve Proposed Acquisition By Fox Corp "], ["Fox is Now Oversold"], ["Here's Why WWE Should Drop Its Dividend"], ["Fox Corp. To Participate At Goldman Sachs Conference; Webcast At 1:15 PM ET "], ["Insiders Buy the Holdings of JKI ETF"], ["Disney's Fox Acquisition Just Got Billions Cheaper"], ["How Does Disney+ Stack Up to Netflix and Amazon's Prime Video?"], ["Fox Reaches Distribution Agreement With Charter "], ["Twenty-First Century Fox, Inc. Q4 adjusted earnings of $0.62 per share"], ["The Disney+ Hype Machine Is Just Getting Started"], ["Twenty-First Century Fox Q4 19 Earnings Conference Call At 4:30 PM ET "], ["Fox Corporation (FOX) Ex-Dividend Date Scheduled for September 03, 2019"], ["Nasdaq 100 Movers: EA, FOX "], ["Fox Becomes Oversold "], ["Twenty-First Century Fox, Q4 19 Earnings Conference Call At 4:30 PM ET "], ["Fox Corp. To Present At BOA Merrill Lynch Conference; Webcast At 5:20 PM ET "], ["Investors Are Looking at WWE All Wrong"], ["A Booming International Movie Market Is Transforming Hollywood"], ["Why Long-Term Investors Should Buy Disney Stock at Every Dip"], ["The Implied Analyst 12-Month Target For OSIZ"], ["Disney Stock Will Reward You for the Long Haul"], ["Remember the Epic $100 December Rally in Netflix Stock? It’s Coming Back"], ["Why Disney Stock Will Soon Beat the $145 Mark"], ["With Its Latest Record in Hand, Disney Truly Is the Mouse That Roared"], ["Tuesday 6/11 Insider Buying Report: FOX, OXY"]], "Published_Date": ["Jun 11, 2020 12:48PM EDT", ["Jun 11, 2020 12:48PM EDT"], ["Jun 1, 2020 9:03AM EDT"], ["May 12, 2020 11:04AM EDT"], ["Jun 8, 2020 9:03AM EDT"], ["May 15, 2020 12:50PM EDT"], ["May 12, 2020 11:05AM EDT"], ["Jun 8, 2020 9:44AM EDT"], ["May 13, 2020 5:53PM EDT"], ["May 6, 2020 4:11PM EDT"], ["May 7, 2020 3:05PM EDT"], ["Apr 30, 2020 8:15AM EDT"], ["Apr 30, 2020 11:56AM EDT"], ["Apr 30, 2020 8:44AM EDT"], ["Apr 30, 2020 8:40AM EDT"], ["Apr 28, 2020 4:35PM EDT"], ["May 8, 2020 1:41PM EDT"], ["Apr 14, 2020 3:27PM EDT"], ["Apr 20, 2020 7:45AM EDT"], ["Apr 2, 2020 10:28AM EDT"], ["Apr 8, 2020 9:35AM EDT"], ["Mar 24, 2020 9:35AM EDT"], ["Mar 30, 2020 10:12AM EDT"], ["Apr 28, 2020 8:28AM EDT"], ["Mar 18, 2020 9:10AM EDT"], ["Feb 28, 2020 10:21AM EST"], ["Mar 17, 2020 9:12PM EDT"], ["Mar 30, 2020 4:21PM EDT"], ["Feb 28, 2020 8:24AM EST"], ["Mar 18, 2020 10:56AM EDT"], ["Mar 16, 2020 2:28PM EDT"], ["Mar 22, 2020 9:30AM EDT"], ["Feb 5, 2020 4:16PM EST"], ["Feb 25, 2020 4:44PM EST"], ["Feb 3, 2020 4:06PM EST"], ["Feb 5, 2020 3:02PM EST"], ["Jan 31, 2020 3:36PM EST"], ["Jan 31, 2020 1:42PM EST"], ["Feb 5, 2020 6:07AM EST"], ["Feb 25, 2020 11:57AM EST"], ["Jan 28, 2020 10:06AM EST"], ["Nov 9, 2019 3:09PM EST"], ["Nov 23, 2019 12:00PM EST"], ["Nov 9, 2019 1:00PM EST"], ["Dec 5, 2019 6:32AM EST"], ["Nov 19, 2019 7:14AM EST"], ["Nov 6, 2019 5:00PM EST"], ["Nov 5, 2019 4:40PM EST"], ["Nov 7, 2019 4:21PM EST"], ["Jan 12, 2020 8:02AM EST"], ["Nov 6, 2019 6:05AM EST"], ["Oct 28, 2019 3:53PM EDT"], ["Oct 29, 2019 7:23AM EDT"], ["Oct 26, 2019 9:02AM EDT"], ["Oct 28, 2019 1:40PM EDT"], ["Nov 6, 2019 4:20PM EST"], ["Oct 28, 2019 7:50AM EDT"], ["Oct 6, 2019 9:56AM EDT"], ["Oct 14, 2019 11:02PM EDT"], ["Oct 2, 2019 4:33PM EDT"], ["Oct 8, 2019 7:12AM EDT"], ["Sep 18, 2019 12:15PM EDT"], ["Sep 26, 2019 9:59AM EDT"], ["Sep 6, 2019 3:49PM EDT"], ["Sep 3, 2019 4:14PM EDT"], ["Oct 21, 2019 11:56AM EDT"], ["Aug 7, 2019 4:11PM EDT"], ["Sep 24, 2019 4:55PM EDT"], ["Aug 7, 2019 6:05AM EDT"], ["Aug 30, 2019 9:00AM EDT"], ["Jul 5, 2019 10:24AM EDT"], ["Aug 15, 2019 11:58AM EDT"], ["Aug 7, 2019 3:00PM EDT"], ["Sep 11, 2019 3:00PM EDT"], ["Jul 29, 2019 9:39AM EDT"], ["Jul 9, 2019 9:51PM EDT"], ["Jun 21, 2019 5:00AM EDT"], ["Jul 30, 2019 8:03AM EDT"], ["Jul 8, 2019 10:50AM EDT"], ["Jun 12, 2019 3:28PM EDT"], ["Jun 5, 2019 10:03AM EDT"], ["Jul 30, 2019 8:47AM EDT"], ["Jun 11, 2019 10:31AM EDT"]], "Link": ["https://www.nasdaq.com/articles/why-fox-needed-to-acquire-tubi-to-compete-in-streaming-2020-06-11", ["https://www.nasdaq.com/articles/why-fox-needed-to-acquire-tubi-to-compete-in-streaming-2020-06-11"], ["https://www.nasdaq.com/articles/analysts-expect-11-upside-for-the-holdings-of-mgv-2020-06-01"], ["https://www.nasdaq.com/articles/3-ad-stocks-missing-sports-more-than-we-are-2020-05-12"], ["https://www.nasdaq.com/articles/buzz-u.s.-stocks-on-the-move-tesla-carnival-corp-opiant-pharmaceuticals-2020-06-08"], ["https://www.nasdaq.com/articles/apple-buys-virtual-reality-startup-nextvr-2020-05-15"], ["https://www.nasdaq.com/articles/wheres-the-rain-check-for-missed-sports-on-tv-2020-05-12"], ["https://www.nasdaq.com/articles/why-fox-shares-rose-13-in-may-2020-06-08"], ["https://www.nasdaq.com/articles/why-these-media-stocks-fell-on-wednesday-2020-05-13"], ["https://www.nasdaq.com/articles/fox-corporation-q3-adjusted-earnings-beat-estimates-2020-05-06"], ["https://www.nasdaq.com/articles/fox-corporation-stock-rises-after-a-strong-earnings-report-2020-05-07"], ["https://www.nasdaq.com/articles/sports-broadcasts-are-somehow-still-getting-pricier-2020-04-30"], ["https://www.nasdaq.com/articles/why-fox-corporation-stock-tumbled-today-2020-04-30"], ["https://www.nasdaq.com/articles/analysts-expect-mgc-to-hit-%24113-2020-04-30"], ["https://www.nasdaq.com/articles/fandangos-vudu-deal-and-the-digital-media-marketplace-2020-04-30"], ["https://www.nasdaq.com/articles/why-fox-corporation-stock-was-headed-higher-on-tuesday-2020-04-28"], ["https://www.nasdaq.com/articles/why-eros-international-stock-is-climbing-higher-again-today-2020-05-08"], ["https://www.nasdaq.com/articles/7-media-stocks-that-will-power-higher-after-the-pandemic-subsides-2020-04-14"], ["https://www.nasdaq.com/articles/atts-streaming-television-hopes-hinge-on-these-2-simple-details-2020-04-20"], ["https://www.nasdaq.com/articles/nasdaq-100-movers%3A-wba-sbux-2020-04-02"], ["https://www.nasdaq.com/articles/is-comcast-stock-a-buy-2020-04-08"], ["https://www.nasdaq.com/articles/with-foxs-acquisition-of-tubi-let-the-avod-wars-begin-2020-03-24"], ["https://www.nasdaq.com/articles/roku-offering-month-of-free-service-to-20-premium-channels-during-pandemic-2020-03-30"], ["https://www.nasdaq.com/articles/how-foxs-partnership-with-transunion-is-ultimately-a-win-for-...-comcast-2020-04-28"], ["https://www.nasdaq.com/articles/looks-like-roku-shareholders-can-breathe-a-sigh-of-relief-for-now-2020-03-18"], ["https://www.nasdaq.com/articles/ex-dividend-reminder%3A-israel-chemicals-yum-china-holdings-and-fox-2020-02-28"], ["https://www.nasdaq.com/articles/fox-corp.-to-buy-streaming-service-tubi-for-%24440-mln-in-cash-2020-03-17"], ["https://www.nasdaq.com/articles/why-fox-corporation-stock-jumped-on-monday-2020-03-30"], ["https://www.nasdaq.com/articles/how-the-parts-add-up%3A-mgv-targets-%2494-2020-02-28"], ["https://www.nasdaq.com/articles/fox-corp-will-acquire-tubi-to-enter-the-streaming-wars-2020-03-18"], ["https://www.nasdaq.com/articles/why-disney-fox-and-comcast-shares-plunged-today-2020-03-16"], ["https://www.nasdaq.com/articles/why-comcasts-peacock-will-be-a-winner-and-its-got-nothing-to-do-with-coronavirus-2020-03"], ["https://www.nasdaq.com/articles/twenty-first-century-fox-inc.-q2-adjusted-earnings-of-%240.10-per-share-2020-02-05"], ["https://www.nasdaq.com/articles/relative-strength-alert-for-fox-2020-02-25"], ["https://www.nasdaq.com/articles/4-top-stock-trades-for-tuesday%3A-amzn-roku-yeti-zm-2020-02-03"], ["https://www.nasdaq.com/articles/twenty-first-century-fox-q2-20-earnings-conference-call-at-4%3A30-pm-et-2020-02-05-0"], ["https://www.nasdaq.com/articles/rokus-fox-blackout-threat-is-a-sign-of-strength-2020-01-31"], ["https://www.nasdaq.com/articles/rokus-stock-tumbles-as-its-battle-with-fox-spills-over-into-super-bowl-weekend-2020-01-31"], ["https://www.nasdaq.com/articles/twenty-first-century-fox-q2-20-earnings-conference-call-at-4%3A30-pm-et-2020-02-05"], ["https://www.nasdaq.com/articles/agree-to-buy-fox-corp-at-%2430-earn-1-annualized-using-options-2020-02-25"], ["https://www.nasdaq.com/articles/what-the-super-bowl-can-teach-us-about-ttd-stock-2020-01-28"], ["https://www.nasdaq.com/articles/why-wwe-may-not-belong-in-your-retirement-portfolio-2019-11-09"], ["https://www.nasdaq.com/articles/how-safe-is-wwe-and-its-dividend-2019-11-23"], ["https://www.nasdaq.com/articles/world-wrestling-entertainment-shares-hit-rock-bottom-in-2019-but-can-it-kick-out-of-the"], ["https://www.nasdaq.com/articles/why-fox-corporation-stock-gained-12-in-november-2019-12-05"], ["https://www.nasdaq.com/articles/3-big-stock-charts-for-tuesday%3A-amazon-fox-and-whirlpool-2019-11-19"], ["https://www.nasdaq.com/articles/fox-authorizes-%242-bln-share-buyback-plan-2019-11-06"], ["https://www.nasdaq.com/articles/fox-agrees-to-buy-3-tv-stations-from-nexstar-for-%24350-mln-2019-11-05"], ["https://www.nasdaq.com/articles/why-shares-of-fox-corp.-are-gaining-today-2019-11-07"], ["https://www.nasdaq.com/articles/2-consumer-stocks-that-turned-%24250-into-over-%241-million-2020-01-12"], ["https://www.nasdaq.com/articles/twenty-first-century-fox-q1-20-earnings-conference-call-at-4%3A30-pm-et-2019-11-06"], ["https://www.nasdaq.com/articles/consumer-sector-update-for-10-28-2019%3A-rokuwbatiftgnafoxfoxanxst-2019-10-28"], ["https://www.nasdaq.com/articles/can-wwe-get-up-off-the-mat-when-it-reports-earnings-2019-10-29"], ["https://www.nasdaq.com/articles/whats-a-special-dividend-and-can-you-predict-when-theyll-come-2019-10-26"], ["https://www.nasdaq.com/articles/consumer-sector-update-for-10-28-2019%3A-wbatiftgnafoxfoxanxst-2019-10-28"], ["https://www.nasdaq.com/articles/twenty-first-century-fox-inc.-q1-adjusted-earnings-of-%240.83-per-share-2019-11-06"], ["https://www.nasdaq.com/articles/tegna-fox-reach-multi-year-carriage-deal-quick-facts-2019-10-28"], ["https://www.nasdaq.com/articles/dish-reaches-multi-year-carriage-agreement-with-fox-2019-10-06"], ["https://www.nasdaq.com/articles/credible-labs-stockholders-approve-proposed-acquisition-by-fox-corp-2019-10-14"], ["https://www.nasdaq.com/articles/fox-is-now-oversold-2019-10-02"], ["https://www.nasdaq.com/articles/heres-why-wwe-should-drop-its-dividend-2019-10-08"], ["https://www.nasdaq.com/articles/fox-corp.-to-participate-at-goldman-sachs-conference-webcast-at-1%3A15-pm-et-2019-09-18"], ["https://www.nasdaq.com/articles/insiders-buy-the-holdings-of-jki-etf-2019-09-26"], ["https://www.nasdaq.com/articles/disneys-fox-acquisition-just-got-billions-cheaper-2019-09-06"], ["https://www.nasdaq.com/articles/how-does-disney-stack-up-to-netflix-and-amazons-prime-video-2019-09-03"], ["https://www.nasdaq.com/articles/fox-reaches-distribution-agreement-with-charter-2019-10-21"], ["https://www.nasdaq.com/articles/twenty-first-century-fox-inc.-q4-adjusted-earnings-of-%240.62-per-share-2019-08-07"], ["https://www.nasdaq.com/articles/the-disney-hype-machine-is-just-getting-started-2019-09-24"], ["https://www.nasdaq.com/articles/twenty-first-century-fox-q4-19-earnings-conference-call-at-4%3A30-pm-et-2019-08-07"], ["https://www.nasdaq.com/articles/fox-corporation-fox-ex-dividend-date-scheduled-for-september-03-2019-2019-08-30"], ["https://www.nasdaq.com/articles/nasdaq-100-movers%3A-ea-fox-2019-07-05"], ["https://www.nasdaq.com/articles/fox-becomes-oversold-2019-08-15"], ["https://www.nasdaq.com/articles/twenty-first-century-fox-q4-19-earnings-conference-call-at-4%3A30-pm-et-2019-08-07-0"], ["https://www.nasdaq.com/articles/fox-corp.-to-present-at-boa-merrill-lynch-conference-webcast-at-5%3A20-pm-et-2019-09-11"], ["https://www.nasdaq.com/articles/investors-are-looking-at-wwe-all-wrong-2019-07-29"], ["https://www.nasdaq.com/articles/a-booming-international-movie-market-is-transforming-hollywood-2019-07-10"], ["https://www.nasdaq.com/articles/why-long-term-investors-should-buy-disney-stock-at-every-dip-2019-06-21"], ["https://www.nasdaq.com/articles/the-implied-analyst-12-month-target-for-osiz-2019-07-30"], ["https://www.nasdaq.com/articles/disney-stock-will-reward-you-for-the-long-haul-2019-07-08"], ["https://www.nasdaq.com/articles/remember-epic-%24100-december-rally-netflix-stock-its-coming-back-2019-06-12"], ["https://www.nasdaq.com/articles/why-disney-stock-will-soon-beat-%24145-mark-2019-06-05"], ["https://www.nasdaq.com/articles/with-its-latest-record-in-hand-disney-truly-is-the-mouse-that-roared-2019-07-30"], ["https://www.nasdaq.com/articles/tuesday-6/11-insider-buying-report%3A-fox-oxy-2019-06-11"]]}