{"Content": " (NYSE:) stock has enjoyed a huge rebound over the past month. Part of that is with the broader market; stocks in general are surging. And the renewed rise in  (NASDAQ:) stock has given the electric vehicle space a big jolt.Source: Sundry Photography / Shutterstock.com\n\t\nHowever, Nio is also up seemingly on its own merit. The company recently finalized a long-awaited bailout package from a Chinese government entity. This rescue plan gives Nio  in desperately needed funds. The company had been in danger of running out of cash prior to the $1 billion arriving.While the plan is good to the extent that it staves off immediate insolvency, Nio shareholders seem to be overlooking the severe dilution that came as a result of the deal.While the case for near-term bankruptcy is off the table in 2020, it’s hard to justify any share price up here near $6 either.Here’s why Nio traders should be moving to take profits on this huge run.Nio had gotten itself into deep financial trouble by the beginning of 2020. The loss of Chinese government subsidies for electric vehicles, a battery recall and massive overhead were all among contributing factors that put the company on life support.Then the novel coronavirus hit and the Chinese economy ground to a halt. It could have been lights out for Nio at that point, things looked ominous. The company’s own financial filings indicated it would run out of money this year unless it raised more capital.Despite the tough economic times, Nio did bring in needed money. But it came at a massive cost. Current shareholders will own just 76% of the new Nio. So, current shareholders gave up 24% of the company for just a $1 billion liquidity injection. This would value the whole firm at $4 billion – far short of the greater than $6 billion market capitalization it sports today.Things get even worse when you consider that the current Nio has to inject hundreds of millions of dollars into the new entity later this year, so it’s really receiving less than $1 billion of net cash for that 24% ownership stake that it gave up. And the old Nio remains saddled with debt, while the new Nio China has a cleaner balance sheet.Financial blogger Jeremy Raper recently made the argument that the Nio China deal structure represents a form of . This, for those unfamiliar with the lingo, means that the key resources of a company are removed, while debts are left with the original shareholders.It’s common to see allegations of asset stripping during bankruptcies and corporate reorganizations. In this case, Nio never filed bankruptcy, but this recent transaction may end up having a similar effect as you’d see during a restructuring.You see, there are now two entities here. The Nio China portion received the core assets of the operating company. However, according to Raper’s analysis of Nio’s corporate filings, Nio China didn’t take on any corresponding liabilities. Thus, Nio China is the “good” entity that has a strong balance sheet. Meanwhile the Nio domiciled in the Cayman Islands – which is what you own if you buy NIO stock – has more than $1 billion of liabilities left over.The problem here should be apparent. If Nio continues to burn through tons of money, the Nio vehicle in the Caymans will be unable to service its debts. And yet it won’t have wherewithal to acquire more funding. Remember that the key assets were shuffled off to Nio China, which NIO stock owners no longer entirely control.It’s easy to see how, further down the line, Nio China could end up consolidating the operation, leaving outside shareholders in the Cayman vehicle in a tenuous position.I’ve long considered Nio to be uninvestable. Note the emphasis on the word “invest” there. If you want to trade Nio shares based on short-term swings in the market, sentiment around electric vehicles, or what not, that’s one thing. It’s still risky and speculative, but it could be profitable.However, as an investment, Nio makes little sense. The company continues to utterly hemorrhage cash. It was seemingly just weeks away from running out of money in February. And now, with this bailout, Nio’s foreign shareholders have seemingly  of the enterprise to this new Nio China entity. That said, there’s some chance that things could still work out.But given the track record of other controversial U.S.-listed Chinese companies such as,  and now  (NASDAQ:), potential investors should be extra careful. Investing overseas already requires an additional level of due diligence, and when you throw massive operating losses and complex financial structures into the mix, things tend to end poorly for passive outside shareholders.Ian Bezek has written more than 1,000 articles for InvestorPlace.com and Seeking Alpha. He also worked as a Junior Analyst for Kerrisdale Capital, a $300 million New York City-based hedge fund. You can reach him on Twitter at @irbezek. At the time of this writing, he held no positions in any of the aforementioned securities.The post  appeared first on .The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.", "Title": "Nio Has Gotten Way Ahead of Itself", "Published_Date": "Jun 9, 2020 1:45PM EDT", "Link": "https://www.nasdaq.com/articles/nio-has-gotten-way-ahead-of-itself-2020-06-09"}