{"Name": ["MHR FUND MANAGEMENT LLC", "HIGHLAND CAPITAL MANAGEMENT LP", "HIGHLAND CAPITAL MANAGEMENT FUND ADVISORS, L.P.", "VANGUARD GROUP INC", "GAMCO INVESTORS, INC. ET AL"], "Description": ["NO INFO", "Highland Capital Management is an alternative investment management firm that manages hedge funds, structured investment vehicles and mutual funds. The firm invests in global public equities, as well as fixed income markets with a focus on leveraged loans, high yield bonds, and structured products.\nThe firm is headquartered in Dallas, Texas. It also operates offices in New York City, Sao Paulo, Buenos Aires, Seoul and Singapore. Highland reported approximately $13.9 billion of assets under management in 2018.In October 2019, Highland Capital Management filed for Chapter 11 bankruptcy protection.", "NO INFO", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "GAMCO Investors, Inc., formerly known as Gabelli Asset Management Company, is a provider of investment advice and brokerage services to mutual funds, institutional and select investors based in Rye, New York. It was founded by and is majority owned by Mario Gabelli, who has cumulatively earned more than $750 million in compensation from the company."], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "6.2", "41.3"], "KeyPeople": ["NO INFO", [], "NO INFO", ["Mortimer J. Buckley"], ["Mario Gabelli", "CEO", "Chairman"]]}