{"Name": ["PEMBROKE MANAGEMENT, LTD", "RENAISSANCE TECHNOLOGIES LLC", "RICE HALL JAMES & ASSOCIATES, LLC", "HARSPRING CAPITAL MANAGEMENT, LLC", "HILLSDALE INVESTMENT MANAGEMENT INC."], "Description": ["Pembroke Management Ltd. is a privately held Canadian investment management firm that manages investment portfolios and separately managed accounts for Canadian pension funds, foundations, endowments, wealthy families and individuals, in addition to the GBC family of mutual funds. Since Pembroke's founding in 1968, the portfolio management team has applied fundamental analysis and conducted ongoing executive level interviews in order to identify high quality companies with compelling growth prospects, unrecognized intrinsic value and strong entrepreneurial leadership.\nPembroke has offices in Montreal and Toronto.", "Renaissance Technologies LLC, also known as RenTech or RenTec, is an American hedge fund based in East Setauket, New York, on Long Island, which specializes in systematic trading using quantitative models derived from mathematical and statistical analyses. The firm is regarded as one of the \"most secretive and successful\" hedge funds in the world. Their signature Medallion fund is famed for the best record in investing history. Renaissance was founded in 1982 by James Simons, an award-winning mathematician and former Cold War code breaker.\nIn 1988, the firm established its most profitable portfolio, the Medallion Fund, which used an improved and expanded form of Leonard Baum's mathematical models, improved by algebraist James Ax, to explore correlations from which they could profit. Jim Berlekamp was instrumental in evolving trading to shorter-dated, pure systems driven decision-making. The hedge fund was named Medallion in honor of the math awards that Simons and Ax had won.Renaissance's flagship Medallion fund, which is run mostly for fund employees, is famed for the best track record on Wall Street, returning more than 66 percent annualized before fees and 39 percent after fees over a 30-year span from 1988 to 2018. Renaissance offers two portfolios to outside investors—Renaissance Institutional Equities Fund (RIEF) and Renaissance Institutional Diversified Alpha (RIDA).Simons ran Renaissance until his retirement in late 2009. The company is now run by Peter Brown (after Robert Mercer resigned). Both of them were computer scientists specializing in computational linguistics who joined Renaissance in 1993 from IBM Research. Simons continues to play a role at the firm as non-executive chairman and remains invested in its funds, particularly the secretive and consistently profitable black-box strategy known as Medallion. Because of the success of Renaissance in general and Medallion in particular, Simons has been described as the best money manager on earth.", "NO INFO", "NO INFO", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": [[], [], "NO INFO", "NO INFO", "NO INFO"]}