{"Name": ["MORGAN STANLEY", "UBS GROUP AG", "TOWER RESEARCH CAPITAL LLC (TRC)"], "Description": ["Morgan Stanley is an American multinational investment bank and financial services company headquartered at 1585 Broadway in the Morgan Stanley Building, Midtown Manhattan, New York City. With offices in more than 42 countries and more than 60,000 employees, the firm's clients include corporations, governments, institutions, and individuals. Morgan Stanley ranked No. 67 in the 2018 Fortune 500 list of the largest United States corporations by total revenue.The original Morgan Stanley, formed by J.P. Morgan & Co. partners Henry Sturgis Morgan (grandson of J.P. Morgan), Harold Stanley, and others, came into existence on September 16, 1935, in response to the Glass–Steagall Act that required the splitting of commercial and investment banking businesses. In its first year, the company operated with a 24% market share (US$1.1 billion) in public offerings and private placements.\nThe current Morgan Stanley is the result of merger of the original Morgan Stanley with Dean Witter Discover & Co. in 1997. Dean Witter's Chairman and CEO, Philip J. Purcell, became the Chairman and CEO of the newly merged \"Morgan Stanley Dean Witter Discover & Co.\"  The new firm changed its name back to \"Morgan Stanley\" in 2001. The main areas of business for the firm today are institutional securities, wealth management and investment management.\n\n", "NO INFO", "Tower Research Capital LLC is a financial services fund started by Mark Gorton and John Martello in 1998.\nThe financial engine behind many of Mark Gorton's business and civic interests is Tower Research Capital LLC, a financial services firm that he started in 1998, following a 4½ year stint in the proprietary trading department of Credit Suisse First Boston (now Credit Suisse). At Credit Suisse, Gorton traded stocks and built sophisticated hedging tools used to analyze markets. Tower evolved these models and specializes in quantitative trading and investment strategies based on proprietary trading algorithms using a statistical methodology to identify non-random patterns in the stock markets. Buying and selling are done through an automated trade execution infrastructure.Tower is staffed by employees proficient in diverse backgrounds such as mathematics, computer programming, physics, law, economics, engineering, finance, and more. As of 2012, Tower had 500 people in its global staff."], "NoShare(Trillion)": ["5.2", "NO INFO", "NO INFO"], "KeyPeople": [["James P. Gorman", "Chairman", "Chief executive officer|CEO", "Thomas R. Nides|Thomas Nides", "Chief financial officer|CFO"], "NO INFO", "NO INFO"]}