{"Name": ["OAKTREE CAPITAL MANAGEMENT LP", "JEFFERIES GROUP LLC", "IMPALA ASSET MANAGEMENT LLC", "RENAISSANCE TECHNOLOGIES LLC", "EVERMORE GLOBAL ADVISORS, LLC"], "Description": ["Oaktree Capital Management is an American global asset management firm specializing in alternative investment strategies. It is the largest distressed securities investor in the world, and one of the largest credit investors in the world. Oaktree emphasizes an opportunistic, value-oriented, and risk-controlled approach to investments in distressed debt, corporate debt (including high yield debt and senior loans), control investing (including private equity and special situations), convertible securities, real estate and listed equities.\nAs of December 31, 2019, the company managed $124.7 billion for its clientele which includes 73 of the 100 largest U.S. pension plans, as well as public funds, foundations, corporate and insurance companies, endowments, and sovereign wealth funds. The company's co-chairman, Howard Marks, has been described as “one of the savviest investors in the world,” and is known in the investment community for letters to investors called the \"Oaktree memos”.The firm was co-founded in 1995 by a group who had formerly worked together at the TCW Group starting in the 1980s. Oaktree quickly established a reputation in the high-yield and distressed-debt markets. On April 12, 2012, Oaktree Capital Group LLC became listed on the NYSE: OAK.On March 13, 2019, Brookfield Asset Management announced  that it had agreed to buy 62% of Oaktree Capital Management for about $4.7 billion, creating one of the world’s largest alternative money managers.", "Jefferies Group LLC is an American multinational independent investment bank and financial services company that is headquartered in New York City. The firm provides clients with capital markets and financial advisory services, institutional brokerage, securities research, and asset management. This includes mergers and acquisitions, restructuring, and other financial advisory services. The Capital Markets segment also includes its securities trading (including the results of its indirectly partially owned subsidiary, Jefferies High Yield Trading, LLC) and investment banking activities.On November 12, 2012, Jefferies announced its merger with Leucadia National Corporation, its largest shareholder. At that time, Leucadia common shares were trading at $21.14 per share. As of December 31, 2015, Leucadia shares were trading at $17.39 per share. Jefferies remains independent and is the largest operating company within the Jefferies Financial Group, as Leucadia was renamed in May 2018.On March 1, 2013, along with the closing of the merger, Jefferies & Company, Inc. was converted to a limited liability company and re-branded as Jefferies LLC. It is a subsidiary of Jefferies Group LLC, which itself is a subsidiary of Jefferies Financial Group, formerly Leucadia.According to Dealogic, Jefferies is the 9th largest investment bank in the world by revenue.", "NO INFO", "Renaissance Technologies LLC, also known as RenTech or RenTec, is an American hedge fund based in East Setauket, New York, on Long Island, which specializes in systematic trading using quantitative models derived from mathematical and statistical analyses. The firm is regarded as one of the \"most secretive and successful\" hedge funds in the world. Their signature Medallion fund is famed for the best record in investing history. Renaissance was founded in 1982 by James Simons, an award-winning mathematician and former Cold War code breaker.\nIn 1988, the firm established its most profitable portfolio, the Medallion Fund, which used an improved and expanded form of Leonard Baum's mathematical models, improved by algebraist James Ax, to explore correlations from which they could profit. Jim Berlekamp was instrumental in evolving trading to shorter-dated, pure systems driven decision-making. The hedge fund was named Medallion in honor of the math awards that Simons and Ax had won.Renaissance's flagship Medallion fund, which is run mostly for fund employees, is famed for the best track record on Wall Street, returning more than 66 percent annualized before fees and 39 percent after fees over a 30-year span from 1988 to 2018. Renaissance offers two portfolios to outside investors—Renaissance Institutional Equities Fund (RIEF) and Renaissance Institutional Diversified Alpha (RIDA).Simons ran Renaissance until his retirement in late 2009. The company is now run by Peter Brown (after Robert Mercer resigned). Both of them were computer scientists specializing in computational linguistics who joined Renaissance in 1993 from IBM Research. Simons continues to play a role at the firm as non-executive chairman and remains invested in its funds, particularly the secretive and consistently profitable black-box strategy known as Medallion. Because of the success of Renaissance in general and Medallion in particular, Simons has been described as the best money manager on earth.", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": [["John B. Frank|John Frank", "Bruce Karsh", "Howard Marks (investor)|Howard Marks"], ["Richard B. Handler", "Chairman", "Chief executive officer|CEO", "President (corporate title)|President", "Committee#Executive committee|Executive Committee"], "NO INFO", [], "NO INFO"]}