{"Name": ["VANGUARD GROUP INC", "UBS GROUP AG", "ADVISOR GROUP HOLDINGS, INC.", "ROYAL BANK OF CANADA", "JPMORGAN CHASE & CO"], "Description": ["The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "NO INFO", "NO INFO", "The Royal Bank of Canada (RBC; French: Banque royale du Canada) is a Canadian multinational financial services company and the  largest bank in Canada by market capitalization. The bank serves over 16 million clients and has 86,000+ employees worldwide. The bank was founded in 1864 in Halifax, Nova Scotia, although its corporate headquarters is located in Toronto, Ontario, and its legal head office in Montreal, Quebec. RBC's institution number (or bank number) is 003. In November 2017, RBC was added to the Financial Stability Board's list of global systemically important banks.\nIn Canada, the bank's personal and commercial banking operations are branded as RBC Royal Bank in English and RBC Banque Royale in French and serves approximately ten million clients through its network of 1,209 branches. RBC Bank is the U.S. banking subsidiary which formerly operated 439 branches across six states in the Southeastern United States, but now only offers cross-border banking services to Canadian travellers and expats. RBC also has 127 branches across seventeen countries in the Caribbean, which serve more than 16 million clients. RBC Capital Markets is RBC's worldwide investment and corporate banking subsidiary, while the investment brokerage firm is known as RBC Dominion Securities. Investment banking services are also provided through RBC Bank and the focus is on middle market clients.\nIn 2011, RBC was the largest Canadian company by revenue and market capitalization. and was ranked at No. 50 in the 2013 Forbes Global 2000 listing, The company has operations in Canada, and 40 other countries and had US$673.2 billion of assets under management in 2014.", "JPMorgan Chase & Co. is an American multinational investment bank and financial services holding company headquartered in New York City. JPMorgan Chase is ranked by S&P Global as the largest bank in the United States and the sixth largest bank in the world by total assets, with total assets of US$2.687 trillion. It is also the world's most valuable bank by market capitalization. JPMorgan Chase is incorporated in Delaware.As a \"Bulge Bracket\" bank, it is a major provider of various investment banking and financial services. It is one of America's Big Four banks, along with Bank of America, Citigroup, and Wells Fargo. JPMorgan Chase is considered to be a universal bank and a custodian bank. The J.P. Morgan brand, is used by the investment banking, asset management, private banking, private wealth management, and treasury services divisions. Fiduciary activity within private banking and private wealth management is done under the aegis of JPMorgan Chase Bank, N.A.—the actual trustee. The Chase brand is used for credit card services in the United States and Canada, the bank's retail banking activities in the United States, and commercial banking. Both the retail and commercial bank and the bank's corporate headquarters are currently located at 383 Madison Avenue in Midtown Manhattan, New York City, while the prior headquarters building directly across the street, 270 Park Avenue, is demolished and replaced with a new building. The current company was originally known as Chemical Bank, which acquired Chase Manhattan and assumed that company's name. The present company was formed in 2000, when Chase Manhattan Corporation merged with J.P. Morgan & Co.As of 2019, the asset management arm of the bank has US$2.988 trillion in assets under management, while its investment and corporate bank arm holds US$25.45 trillion in assets under custody. At US$45.0 billion in assets under management, the hedge fund unit of JPMorgan Chase is the third largest hedge fund in the world."], "NoShare(Trillion)": ["6.2", "NO INFO", "NO INFO", "NO INFO", "NO INFO"], "KeyPeople": [["Mortimer J. Buckley"], "NO INFO", "NO INFO", ["David I. McKay"], ["Jamie Dimon", "Chairperson|Chairman", "Chief executive officer|CEO", "President (corporate title)|President", "Chief operating officer|COO", "President (corporate title)|President", "Chief operating officer|COO", "Jennifer Piepszak", "Chief financial officer|CFO"]]}