{"Name": ["VANGUARD GROUP INC", "RUSSELL INVESTMENTS GROUP, LTD.", "GOLDMAN SACHS GROUP INC", "SUSQUEHANNA INTERNATIONAL GROUP, LLP", "MILLENNIUM MANAGEMENT LLC"], "Description": ["The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $6.2 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "Frank Russell Company is a subsidiary of London Stock Exchange Group (LSEG). However, its asset management division, as Russell Investments, was sold by LSEG to TA Associates in 2015.", "The Goldman Sachs Group, Inc., () is an American multinational investment bank and financial services company headquartered in New York City. It offers services in investment management, securities, asset management, prime brokerage, and securities underwriting.\nThe bank is one of the largest investment banking enterprises in the world, and is a primary dealer in the United States Treasury security market and more generally, a prominent market maker. The group also owns Goldman Sachs Bank USA, a direct bank. Goldman Sachs was founded in 1869 and is headquartered at 200 West Street in Lower Manhattan with additional offices in other international financial centers.As a result of its involvement in securitization during the subprime mortgage crisis, Goldman Sachs suffered during the financial crisis of 2007–2008, and received a $10 billion investment from the United States Department of the Treasury as part of the Troubled Asset Relief Program, a financial bailout created by the Emergency Economic Stabilization Act of 2008. The investment was made in November 2008 and was repaid in June 2009.Former employees of Goldman Sachs have moved on to government positions. Notable examples include former U.S. Secretaries of the Treasury Robert Rubin and Henry Paulson; current United States Secretary of the Treasury Steven Mnuchin; former Under Secretary of State John C. Whitehead; former chief economic advisor Gary Cohn; Governor of New Jersey Phil Murphy and former Governor of New Jersey Jon Corzine; former Prime Minister of Italy Mario Monti; European Central Bank President Mario Draghi; former Bank of Canada and Bank of England Governor Mark Carney; British Chancellor of the Exchequer Rishi Sunak; and the former Prime Minister of Australia Malcolm Turnbull. In addition, former Goldman employees have headed the New York Stock Exchange, the World Bank, and competing banks such as Citigroup and Merrill Lynch.\nThe company is ranked 62nd on the Fortune 500 list of the largest United States corporations by total revenue.", "Susquehanna International Group, LLP (SIG) is a privately held, global trading and technology firm. SIG comprises a number of affiliated entities specializing in trading and proprietary investments in equities, fixed income, energy, commodity, index and derivative products, private equity and venture capital, research, customer trading and institutional sales. Susquehanna is probably best known for expertise in derivatives pricing and trading, especially equity options.\n\nSIG is a specialist or DPM (designated primary market maker) in approximately 600 equity options and 45 index options on the CBOE, AMEX, PHLX, and ISE, including big name equities such as Google, Goldman Sachs, JPMorgan Chase, GE, PepsiCo, and Microsoft and indices such as Nasdaq and Russell 2000 options.SIG's headquarters office is in Bala Cynwyd, a western suburb of Philadelphia, Pennsylvania, US, and its European headquarters are in the IFSC, Dublin, Ireland. The firm employs more than 1,900 people in offices across North America (New York City, Chicago, San Francisco, Philadelphia, Boston, Stamford), Australia (Sydney), Europe (Dublin, London) and Asia (Shanghai, Beijing, Hong Kong, Tokyo). SIG is one of the largest employers in Lower Merion Township and was listed as one of Philadelphia Magazine's \"Coolest Companies\" in 2015.\n\n", "Millennium Management is an investment management firm with a multistrategy hedge fund offering. It is one of the world's largest alternative asset management firms with $39 billion assets under management. The firm operates in America, Europe and Asia."], "NoShare(Trillion)": ["6.2", "NO INFO", "1.859", "NO INFO", "NO INFO"], "KeyPeople": [["Mortimer J. Buckley"], "NO INFO", ["Lloyd Blankfein", "Chairman|Senior Chairman", "David M. Solomon", "Chairman", "CEO", "President (corporate title)|President", "Chief operating officer|COO", "Richard Gnodde", "John F. W. Rogers"], "NO INFO", ["General counsel|chief legal officer", "General counsel|chief legal officer"]]}