{"Name": ["NANTAHALA CAPITAL MANAGEMENT, LLC", "SEARCHLIGHT CAPITAL PARTNERS, L.P.", "FRONTIER CAPITAL MANAGEMENT CO LLC", "GOLDMAN SACHS GROUP INC", "EMANCIPATION MANAGEMENT LLC"], "Description": ["NO INFO", "Searchlight Capital Partners is a private equity firm. \nSearchlight Capital was established in 2010 by Eric Zinterhofer, Oliver Haarmann, and Erol Uzumeri, its founding partners. It has offices in New York,  Conduit Street, London and Toronto.In June 2015, Searchlight Capital (40%) and Liberty Global (60%) jointly acquired Choice Cable TV, Puerto Rico's second largest cable operator, for US$272.5 million.In December 2015, Searchlight Capital closed its second fund with $1.94 billion of commitments.", "NO INFO", "The Goldman Sachs Group, Inc., () is an American multinational investment bank and financial services company headquartered in New York City. It offers services in investment management, securities, asset management, prime brokerage, and securities underwriting.\nThe bank is one of the largest investment banking enterprises in the world, and is a primary dealer in the United States Treasury security market and more generally, a prominent market maker. The group also owns Goldman Sachs Bank USA, a direct bank. Goldman Sachs was founded in 1869 and is headquartered at 200 West Street in Lower Manhattan with additional offices in other international financial centers.As a result of its involvement in securitization during the subprime mortgage crisis, Goldman Sachs suffered during the financial crisis of 2007–2008, and received a $10 billion investment from the United States Department of the Treasury as part of the Troubled Asset Relief Program, a financial bailout created by the Emergency Economic Stabilization Act of 2008. The investment was made in November 2008 and was repaid in June 2009.Former employees of Goldman Sachs have moved on to government positions. Notable examples include former U.S. Secretaries of the Treasury Robert Rubin and Henry Paulson; current United States Secretary of the Treasury Steven Mnuchin; former Under Secretary of State John C. Whitehead; former chief economic advisor Gary Cohn; Governor of New Jersey Phil Murphy and former Governor of New Jersey Jon Corzine; former Prime Minister of Italy Mario Monti; European Central Bank President Mario Draghi; former Bank of Canada and Bank of England Governor Mark Carney; British Chancellor of the Exchequer Rishi Sunak; and the former Prime Minister of Australia Malcolm Turnbull. In addition, former Goldman employees have headed the New York Stock Exchange, the World Bank, and competing banks such as Citigroup and Merrill Lynch.\nThe company is ranked 62nd on the Fortune 500 list of the largest United States corporations by total revenue.", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "1.859", "NO INFO"], "KeyPeople": ["NO INFO", "NO INFO", "NO INFO", ["Lloyd Blankfein", "Chairman|Senior Chairman", "David M. Solomon", "Chairman", "CEO", "President (corporate title)|President", "Chief operating officer|COO", "Richard Gnodde", "John F. W. Rogers"], "NO INFO"]}