{"Name": ["BERKSHIRE HATHAWAY INC", "VANGUARD GROUP INC", "BLACKROCK INC.", "STATE STREET CORP", "FRANKLIN RESOURCES INC"], "Description": ["Berkshire Hathaway is an American multinational conglomerate holding company headquartered in Omaha, Nebraska, United States. The company wholly owns GEICO, Duracell, Dairy Queen, BNSF, Lubrizol, Fruit of the Loom, Helzberg Diamonds, Long & Foster, FlightSafety International, Pampered Chef, Forest River and NetJets, and also owns 38.6% of Pilot Flying J; and significant minority holdings in U.S. public companies Kraft Heinz Company (26.7%), American Express (17.6%), Wells Fargo (9.9%), The Coca-Cola Company (9.32%), Bank of America (6.8%), and Apple (5.22%). Beginning in 2016, the company acquired large holdings in the major US airline carriers, namely United Airlines, Delta Air Lines, Southwest Airlines and American Airlines but sold all of its airline holdings early in 2020.  Berkshire Hathaway has averaged an annual growth in book value of 19.0% to its shareholders since 1965 (compared to 9.7% from the S&P 500 with dividends included for the same period), while employing large amounts of capital, and minimal debt.The company is known for its control and leadership by Warren Buffett, who serves as chairman and chief executive, and by Charlie Munger, one of the company's vice-chairmen. In the early part of his career at Berkshire, Buffett focused on long-term investments in publicly traded companies, but more recently he has more frequently bought whole companies. Berkshire now owns a diverse range of businesses including confectionery, retail, railroads, home furnishings, encyclopedias, manufacturers of vacuum cleaners, jewelry sales, manufacture and distribution of uniforms, and several regional electric and gas utilities.\nAccording to the Forbes Global 2000 list and formula, Berkshire Hathaway is the eighth largest public company in the world, the tenth largest conglomerate by revenue and the largest financial services company by revenue in the world.As of April 2020, Berkshire's Class B stock is the eighth-largest component of the S&P 500 Index (which is based on free-float market capitalization) and the company is famous for having the most expensive share price in history with Class A shares costing around $300,000 each. This is because there has never been a stock split in its Class A shares and Buffett stated in a 1984 letter to shareholders that he does not intend to split the stock.", "The Vanguard Group is an American registered investment advisor based in Malvern, Pennsylvania with over $5.3 trillion in assets under management. It is the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock's iShares. In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services.\nFounder and former chairman John C. Bogle is credited with the creation of the first index fund available to individual investors and was a proponent and major enabler of low-cost investing by individuals. Vanguard is owned by the funds managed by the company and is therefore owned by its customers. Vanguard offers two classes of most of its funds: investor shares and admiral shares. Admiral shares have slightly lower expense ratios but require a higher minimum investment, often between $3,000 and $100,000 per fund.In addition to mutual funds and ETFs, Vanguard offers brokerage services, variable and fixed annuities, educational account services, financial planning, asset management, and trust services. Several mutual funds managed by Vanguard are ranked at the top of the list of US mutual funds by assets under management.Vanguard's corporate headquarters is in Malvern, Pennsylvania, a suburb of Philadelphia. It has satellite offices in Charlotte, North Carolina, and Scottsdale, Arizona. The company also has offices in Australia, Asia, and Europe.", "BlackRock, Inc. is an American global investment management corporation based in New York City. Founded in 1988, initially as a risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with $7.4 trillion in assets under management as of end-Q4 2019. BlackRock operates globally with 70 offices in 30 countries and clients in 100 countries. Due to its power, and the sheer size and scope of its financial assets and activities, BlackRock has been called the world's largest shadow bank.", "State Street Corporation is an American financial services and bank holding company headquartered at One Lincoln Street in Boston with operations worldwide. It is the second-oldest continually operating United States bank; its predecessor, Union Bank, was founded in 1792. State Street is ranked 15th on the list of largest banks in the United States by assets. It is one of the largest asset management companies in the world with US$2.511 trillion under management and US$31.62 trillion under custody and administration. It is the second largest custodian bank in the world.The company is ranked 247th on the Fortune 500 as of 2019. The company is on the list of the banks that are too big to fail published by the Financial Stability Board.The company is named after State Street in Boston, which was known as the \"Great Street to the Sea\" in the 18th century as Boston became a flourishing maritime capital. The company's logo includes a clipper to reflect the maritime industry in Boston during this time.\n\n", "Franklin Resources Inc. is an American multinational holding company that, together with its subsidiaries, is referred to as Franklin Templeton; it is a global investment firm founded in New York City in 1947 as Franklin Distributors, Inc. It is listed on the New York Stock Exchange under the ticker symbol BEN, in honor of Benjamin Franklin, for whom the company is named, and who was admired by founder Rupert Johnson, Sr. In 1973 the company's headquarters moved from New York to San Mateo, California. As of December 31, 2019 Franklin Templeton held US$698 billion in assets under management (AUM) on behalf of private, professional and institutional investors.\n\n"], "NoShare(Trillion)": ["NO INFO", "6.2", "7.43", "2.511", "NO INFO"], "KeyPeople": [["Warren Buffett|Warren E. Buffett", "Chairman", "CEO", "Charlie Munger|Charles T. Munger", "Chairman#Vice chairman and deputy chairman|Vice Chairman", "Ajit Jain", "Chairman#Vice chairman and deputy chairman|Vice Chairman", "Greg Abel", "Chairman#Vice chairman and deputy chairman|Vice Chairman"], ["Mortimer J. Buckley"], ["Laurence D. Fink|Larry Fink", "Robert S. Kapito|Robert Kapito"], [], ["Gregory E. Johnson", "Rupert Johnson, Jr.|Rupert H. Johnson Jr."]]}