{"Name": ["UBS GROUP AG", "VICTORY CAPITAL MANAGEMENT INC", "WELLS FARGO & COMPANY/MN", "MORGAN STANLEY", "ADVISOR GROUP HOLDINGS, INC."], "Description": ["NO INFO", "NO INFO", "Wells Fargo & Company is an American multinational financial services company headquartered in San Francisco, California, with central offices throughout the United States. It is the world's fourth-largest bank by market capitalization and the fourth largest bank in the US by total assets. Wells Fargo is ranked number 26 on the 2018 Fortune 500 rankings of the largest US corporations by total revenue. In July 2015, Wells Fargo became the world's largest bank by market capitalization, edging past ICBC, before slipping behind JPMorgan Chase in September 2016, in the wake of a scandal involving the creation of over 2 million fake bank accounts  and illegal manipulation of other accounts by Wells Fargo employees. Wells Fargo fell behind Bank of America to third by bank deposits in 2017 and behind Citigroup to fourth by total assets in 2018. Wells Fargo is incorporated in Delaware.The firm's primary operating subsidiary is national bank Wells Fargo Bank, N.A., which designates its main office as Sioux Falls, South Dakota. Wells Fargo in its present form is a result of a merger between San Francisco–based Wells Fargo & Company and Minneapolis-based Norwest Corporation in 1998 and the subsequent 2008 acquisition of Charlotte-based Wachovia. Following the mergers, the company transferred its headquarters to Wells Fargo's headquarters in San Francisco and merged its operating subsidiary with Wells Fargo's operating subsidiary in Sioux Falls. Along with JPMorgan Chase, Bank of America, and Citigroup, Wells Fargo is one of the \"Big Four Banks\" of the United States. As of June 2018, it had 8,050 branches and 13,000 ATMs. In 2018 the company had operations in 35 countries with over 70 million customers globally.In February 2014, Wells Fargo was named the world's most valuable bank brand for the second consecutive year in The Banker and Brand Finance study of the top 500 banking brands. In 2016, Wells Fargo ranked 7th on the Forbes Global 2000 list of largest public companies in the world and ranked 27th on the Fortune 500 list of the largest companies in the US. In 2015, the company was ranked the 22nd most admired company in the world, and the 7th most respected company in the world. As of December 2018, the company had a Standard & Poors credit rating of A−. However, for a brief period in 2007, the company was the only AAA-rated bank, reflecting the highest credit rating from two firms.On February 2, 2018, the US Federal Reserve Bank barred Wells Fargo from growing its nearly US$2 trillion-asset base any further, based upon years of misconduct, until Wells Fargo fixes its internal problems to the satisfaction of the Federal Reserve. In April 2018, The Wall Street Journal reported that the US Department of Labor had launched a probe into whether Wells Fargo was pushing its customers into more expensive retirement plans as well as into retirement funds managed by Wells Fargo itself. Subsequently in May 2018, The Wall Street Journal reported that Wells Fargo's business banking group had improperly altered documents about business clients in 2017 and early 2018. In June 2018, Wells Fargo began retreating from retail banking in the Midwestern United States by announcing the sale of all its physical bank branch locations in Indiana, Michigan, and Ohio to Flagstar Bank.", "Morgan Stanley is an American multinational investment bank and financial services company headquartered at 1585 Broadway in the Morgan Stanley Building, Midtown Manhattan, New York City. With offices in more than 42 countries and more than 60,000 employees, the firm's clients include corporations, governments, institutions, and individuals. Morgan Stanley ranked No. 67 in the 2018 Fortune 500 list of the largest United States corporations by total revenue.The original Morgan Stanley, formed by J.P. Morgan & Co. partners Henry Sturgis Morgan (grandson of J.P. Morgan), Harold Stanley, and others, came into existence on September 16, 1935, in response to the Glass–Steagall Act that required the splitting of commercial and investment banking businesses. In its first year, the company operated with a 24% market share (US$1.1 billion) in public offerings and private placements.\nThe current Morgan Stanley is the result of merger of the original Morgan Stanley with Dean Witter Discover & Co. in 1997. Dean Witter's Chairman and CEO, Philip J. Purcell, became the Chairman and CEO of the newly merged \"Morgan Stanley Dean Witter Discover & Co.\"  The new firm changed its name back to \"Morgan Stanley\" in 2001. The main areas of business for the firm today are institutional securities, wealth management and investment management.\n\n", "NO INFO"], "NoShare(Trillion)": ["NO INFO", "NO INFO", "NO INFO", "5.2", "NO INFO"], "KeyPeople": ["NO INFO", "NO INFO", ["Elizabeth Ashburn Duke|Elizabeth Duke", "Chairman|Chair", "Charles Scharf", "President (corporate title)|President", "CEO", "CFO", "C. Allen Parker", "General counsel"], ["James P. Gorman", "Chairman", "Chief executive officer|CEO", "Thomas R. Nides|Thomas Nides", "Chief financial officer|CFO"], "NO INFO"]}